{
  "nodes": [
    {
      "id": "fsrcbqt",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrcbqt/",
      "user": "AutoModerator",
      "text": "\nRemember that TrueReddit is a place to engage in **high-quality and civil discussion**. Posts must meet certain content and title requirements. Additionally, **all posts must contain a submission statement.** See the rules [here](https://old.reddit.com/r/truereddit/about/rules/) or in the sidebar for details. Comments or posts that don't follow the rules may be removed without warning.\n\nIf an article is paywalled, please ***do not*** request or post its contents. Use [Outline.com](https://outline.com/) or similar and link to that in the comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TrueReddit) if you have any questions or concerns.*",
      "sentiment": 0.8456
    },
    {
      "id": "fsrcodz",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrcodz/",
      "user": "DearBurt",
      "text": "Submission statement: Though there is a lot of focus on the social inequalities occurring in the U.S., this article takes a deeper look at economic inequalities and the link between economic inequality and social injustice. The author believes many of the social issues experienced by people of color throughout America would be greatly mitigated if they had more economic power.",
      "sentiment": -0.5719
    },
    {
      "id": "fsrf6r4",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrf6r4/",
      "user": "Lady_3_Jane",
      "text": "Oliver and Shapiro’s “Black Wealth / White Wealth”, published in ‘95, is required reading.",
      "sentiment": 0.4939
    },
    {
      "id": "fsrig33",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrig33/",
      "user": "byingling",
      "text": "&gt; The author believes many of the social issues experienced by people of color throughout America would be greatly mitigated if they had more economic power.\n\nOk, I have to admit I haven't read the article- but if this is the 'insight' it delivers, it isn't exactly eye opening. Race and income inequality and inequality of opportunity are inextricably linked in America. We live in a capitalist economy, so of course more wealth equals more power. That's the whole point of the game, ain't it?",
      "sentiment": 0.8702
    },
    {
      "id": "fsrrlya",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrrlya/",
      "user": "deadfisher",
      "text": "I mean, there's more to it than that, but, you know...",
      "sentiment": 0.0
    },
    {
      "id": "fsrrnkf",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrrnkf/",
      "user": "medalgardr",
      "text": "A second edition was published in 2006. It’s $55 or so on amazon, but used it’s a good price. \n\n[https://m.alibris.com/search/books/isbn/9780415918473utm_source=Google&amp;utm_medium=cpc?ds_rl=1264488&amp;ds_rl=1264488&amp;gclid=EAIaIQobChMIx5yiop3m6QIVMf7jBx1xlApCEAQYAiABEgIldfD_BwE&amp;gclsrc=aw.ds&amp;utm_campaign=NMPi_Smart_Shopping&amp;utm_term=NMPi_Smart_Shopping](https://m.alibris.com/search/books/isbn/9780415918473utm_source=Google&amp;utm_medium=cpc?ds_rl=1264488&amp;ds_rl=1264488&amp;gclid=EAIaIQobChMIx5yiop3m6QIVMf7jBx1xlApCEAQYAiABEgIldfD_BwE&amp;gclsrc=aw.ds&amp;utm_campaign=NMPi_Smart_Shopping&amp;utm_term=NMPi_Smart_Shopping)",
      "sentiment": 0.6907
    },
    {
      "id": "fsrzlxo",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsrzlxo/",
      "user": "WMDick",
      "text": "Interesting read. I appreciate reading a piece on race that did not immediately invoke racism and that also made some suggestions to fix a problem that were a bit more nuanced and certainly more helpful than 'end racism'.",
      "sentiment": 0.7684
    },
    {
      "id": "fssa5qb",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fssa5qb/",
      "user": "takatu_topi",
      "text": "&gt;The author believes many of the social issues experienced by people of color throughout America would be greatly mitigated if they had more economic power.\n\nAt the risk of introducing some potentially uncomfortable nuance to the discussion, it is not exactly accurate to lump in the economic realities faced by all ethnic minorities in the US under one heading. I couldn't find recent data from a quick search on household *wealth* by race, but in terms of *income* Asian households had over twice the average income of black households (87k vs 41k) and, notably, higher average incomes than white households (71K).\n\nhttps://www.pgpf.org/blog/2019/10/income-and-wealth-in-the-united-states-an-overview-of-data",
      "sentiment": -0.0644
    },
    {
      "id": "fssnd1n",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fssnd1n/",
      "user": "available_username2",
      "text": "Rich black people face a lot of racism too",
      "sentiment": -0.128
    },
    {
      "id": "fssrlzj",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fssrlzj/",
      "user": "N8CCRG",
      "text": "&gt; it is not exactly accurate to lump in the economic realities faced by all ethnic minorities in the US under one heading.\n\nTo be fair, the author doesn't appear to do that. Just the Submission Statement, which I suspect wasn't considering asians when it used the phrase POC.",
      "sentiment": 0.0258
    },
    {
      "id": "fssrn4s",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fssrn4s/",
      "user": "ARKenneKRA",
      "text": "I agree, that will skew this data .....\n\nBut it does stay true to the question of \"White's vs Everyone Else.....Who Won?\"",
      "sentiment": 0.8885
    },
    {
      "id": "fsss817",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsss817/",
      "user": "oberbernou",
      "text": "Even if you in a Benz, you still a n***** in a coupe.",
      "sentiment": 0.0
    },
    {
      "id": "fsst6vn",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsst6vn/",
      "user": "QuietZelda",
      "text": "Thank you for posting. Many of these types of posts and articles seem to leave out Asian Americans and Native Americans, which I'd like to see those included as well to provide a more comprehensive view. From a health economics perspective Native Americans experience some of the shortest lifespans and highest rates of alcoholism, with Asian Americans living even longer and having higher earnings than whites.",
      "sentiment": 0.8016
    },
    {
      "id": "fsst8s7",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsst8s7/",
      "user": "Whornz4",
      "text": "Data like this shows why we need affirmative action and other social policies to help close the gap. The SCOTUS may put a stop to affirmative action later this year though.",
      "sentiment": 0.4588
    },
    {
      "id": "fsstkw4",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsstkw4/",
      "user": "DrCarter11",
      "text": "I realize that my current area is probably not the greatest economic area or state. but those income numbers are asinine to me. I can count on one hand the number of people I know who make more than 50k with a BA. Shit out of the few people I still am in contact with who went to grad school, only one makes over 50k. And he works in petro engineering.  Is it just coastal areas /cali, new york, florida, etc/ that cause such high  income inflation or what?",
      "sentiment": -0.3257
    },
    {
      "id": "fssxofu",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fssxofu/",
      "user": "Yevad",
      "text": "Typical? I guess I don't know any typical people",
      "sentiment": 0.0
    },
    {
      "id": "fsszeca",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsszeca/",
      "user": "BestUdyrBR",
      "text": "Why single out Whites though? You could make it \"Asian's vs Everyone Else....Who Won?\" and point out the largest racial gap in America.",
      "sentiment": 0.6199
    },
    {
      "id": "fst36vk",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst36vk/",
      "user": "kspk",
      "text": "To that extent, I wonder if we could discern what, the Asians in the US, did differently in contrast with other races - including whites - that led to a different outcome?",
      "sentiment": 0.0
    },
    {
      "id": "fst3sl1",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst3sl1/",
      "user": "N8CCRG",
      "text": "In the article, it separates by whites, blacks, hispanics and other. It's not just whites vs non-whites.",
      "sentiment": 0.0
    },
    {
      "id": "fst3soy",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst3soy/",
      "user": "N8CCRG",
      "text": "In the article, it separates by whites, blacks, hispanics and other. It's not just whites vs non-whites.",
      "sentiment": 0.0
    },
    {
      "id": "fst3thx",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst3thx/",
      "user": "redditorium",
      "text": "The numbers are household income, so for at least some of the households in that category it is from more than one person.",
      "sentiment": 0.0
    },
    {
      "id": "fst55cc",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst55cc/",
      "user": "PrettyDecentSort",
      "text": "Worked hard, encouraged schooling, discouraged drugs, didn't have children out of wedlock...",
      "sentiment": -0.1531
    },
    {
      "id": "fst70uj",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst70uj/",
      "user": "Helicase21",
      "text": "Even that is oversimplifying things. \"Asian\" is an incredibly broad category and talking about \"Asian-Americans\" as a monolith when it comes to issues like this ignores important diversity.",
      "sentiment": 0.2323
    },
    {
      "id": "fst79t7",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst79t7/",
      "user": "startupdojo",
      "text": "As an immigrant kid who came here without any knowledge or experience of this stuff, it was obvious which kids (largely) focused on school and academic achievement and which kids (largely) did not.  It was obvious what sort of expectations their parents had, too.  \n\nAnd it's not just Asians that achieve success.  It is black Africans, too.  To quote: \n\n*By many measures, African immigrants are as far ahead of American whites in the educational achievement as whites are ahead of African-Americans.*   *That education translates into higher household income. Nigerian-Americans, for instance, have a median household income* [*well above*](http://factfinder.census.gov/faces/tableservices/jsf/pages/productview.xhtml?pid=ACS_10_SF4_B19013&amp;prodType=table) *the American average.* \n\n [https://www.bloomberg.com/opinion/articles/2015-10-13/it-isn-t-just-asian-immigrants-who-excel-in-the-u-s-](https://www.bloomberg.com/opinion/articles/2015-10-13/it-isn-t-just-asian-immigrants-who-excel-in-the-u-s-) \n\nWhile no doubt that all these groups face discrimination, it is not holding them back that much if they can out perform \"privileged\" white, native born Americans.",
      "sentiment": 0.9083
    },
    {
      "id": "fst7byx",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst7byx/",
      "user": "takatu_topi",
      "text": "There is a lot to unpack here.\n\nOver half of the human population is in Asia, and Asian-Americans are significantly more likely than white and black Americans to be immigrants, 2nd, or 3rd generation Americans. There is probably a good deal of self-selection, in which the more ambitious/capable/well educated people in China, Pakistan, India, ect. are much more likely than random members of the general population to immigrate to the US. It is perhaps less than politically-correct, but  find it likely cultural factors come in to play, at least to an extent.\n\nThis is something of an aside, but perhaps related: in 2011 students from non-English speaking African immigrant households performed better than English-speaking African American students on a standardized test: \n\nhttps://www.seattletimes.com/seattle-news/alarming-new-test-score-gap-discovered-in-seattle-schools/",
      "sentiment": 0.836
    },
    {
      "id": "fst817b",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fst817b/",
      "user": "takatu_topi",
      "text": "That's an excellent point. There are significant differences in terms of average incomes of different Asian groups in the US based on national origin. Indian Americans are the highest earners of all ethnic groups (of course, there are various ethnicities within India, but Indian Americans tend to be Gujarati and Punjabi). Burmese are near the lower end of the spectrum, but I'd imagine most Burmese in the US are refugees.\n\nhttps://en.wikipedia.org/wiki/List_of_ethnic_groups_in_the_United_States_by_household_income",
      "sentiment": -0.0129
    },
    {
      "id": "fsthmzs",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsthmzs/",
      "user": "thewiseswirl",
      "text": "This is my take as an immigrant (and Black): I have so much privilege. Don’t get me wrong. My origin country can be racist in its own way but my dad went to an integrated school while kids here were being walked to school by the military. There were no lynchings and in the 60s a set of cops picked him up - to drive him home because it was late and unsafe. He didn’t grow up with this constant fear and thus he didn’t pass that on to us. We were poor when we left AND when we came to America. Now I’m looked at as ‘one of the good ones’ by white people: well spoken, well educated, well traveled but I’m sure it would have turned out differently if we were from here. Call it self selection or something akin to starting the game while less mentally and emotionally exhausted but it’s a totally different experience.",
      "sentiment": -0.2289
    },
    {
      "id": "fsw3l3j",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsw3l3j/",
      "user": "kspk",
      "text": "First, thank you both for sharing your views.\n\nAgain to dive deeper, just to build my own understanding which stems from lack of personal experiences, should any socio economic data exclude those who are 1st or 2nd generation immigrants? How do we come up with a model that could potentially represent the on-ground reality for the US and clarify the causality for the data we have?",
      "sentiment": 0.3527
    },
    {
      "id": "fsw5g2n",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsw5g2n/",
      "user": "kspk",
      "text": "Thank you for your response. \n\nI am able to pickup a theme here based on the couple of responses I read. Recent generation immigrants have a disproportionate advantage. So to understand the disparity of economic stature of African American population in the us, should we exclude the immigrants and try to understand the socio economic causes, or should we include the immigrants and try to understand the factors that allow them to get ahead?\n\nAre there references of such studies or research that has gone into this?",
      "sentiment": 0.594
    },
    {
      "id": "fsx2zxl",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsx2zxl/",
      "user": "takatu_topi",
      "text": "I think a huge factor that is often overlooked is that most African Americans - I mean the decedents of people who were enslaved and brought from Africa until the 1800s - have experienced severe collective trauma. Think about the cultural and linguistic loss. Of course, some elements of their indigenous west/central/southern African cultures survived within broader African American, and general American cultures, but the vast majority of cultural elements - languages, religions, social structures - were forcibly removed. It is a cultural genocide with few parallels in global history. They were literally dehumanized and commodified. This collective trauma would be hard to overcome even in the best of circumstances, but added to that have been additional subsequent generations of discrimination and marginalization.",
      "sentiment": -0.5859
    },
    {
      "id": "fsx3hy5",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/fsx3hy5/",
      "user": "thewiseswirl",
      "text": "And when they finally got some wealth that could be passed down to other generations it was destroyed (Black Wall Street) and when they tried again they were blocked (redlining).",
      "sentiment": -0.2732
    },
    {
      "id": "ft3ag7t",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft3ag7t/",
      "user": "GoaterSquad",
      "text": "How did you immigrate if you were poor? Isnt immigration to the US especially expensive?",
      "sentiment": -0.5362
    },
    {
      "id": "ft4esqb",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4esqb/",
      "user": "thewiseswirl",
      "text": "So, the process took over ten years from the day my aunt requested it - when it started my dad was a single dad and when it ended he was married with two kids. You see that bill coming and find ways to handle it. We weren’t dirt poor but it was definitely barely making ends meet as his income was based on his sales (he was a traveling spice salesman, no high school degree, no car - just the bus and his legs) - I’m not entirely sure how he did it - but we always had food on the table and a whole lot of attention from our parents.\n\nBut you want to know about the actual moolah - it was a community effort really. Parents sold everything they had, my mom’s side gave what they could (dad’s side was immigrating as well) and that was enough for the flights. Upon arriving we stayed with our sponsor (my aunt) for a few months while we got our bearings but the 9 of us (my family and my other aunt’s family) left for our own place as soon as the adults and kids (everyone but me was a teenager or adult) got jobs. [There’s a bit to unpack in that last statement- our relationship with my aunt is solid and we’ll always owe her for it all but it was hustle mode from day one. Tiny example: we landed around 11:30pm and I was enrolled in school the next day (yup didn’t speak English).]*\n\nOur first place on our own was magical (though admittedly not everyone had a proper room and our fridge for a while was a small styrofoam box). The 9 of us functioned essentially as a unit - whoever got paid helped with the food that week, the other family cooked it, and countless other things. Eventually everyone got better paying jobs and we split up again. My grandmother on my mom’s side was also a huge help. Mind you, this woman today has like a $300 pension and back then didn’t make much more but man is she good at finances (context: second grade grade education, can barely read, remembers the time before money, is probably sharper than all of us put together, has zip lined with me recently). \n\n*Note: Because of the language issue and when I arrived I had to repeat kindergarten, however, I noticed very early on that the US was behind education wise. I was learning things that I had already learned in my home country. In a year I went from ESL to spelling bee champ to honors student.",
      "sentiment": 0.9828
    },
    {
      "id": "ft4pcn2",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4pcn2/",
      "user": "GoaterSquad",
      "text": "Why was your aunt in the us?",
      "sentiment": 0.0
    },
    {
      "id": "ft4qdon",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4qdon/",
      "user": "thewiseswirl",
      "text": "My dad heard of a ~~nursing training program~~ housekeeper program in the US and told her to apply.\n\nThey lived two different experiences. Her father was white and though largely absent she benefited enough that she was able to finish high school. My dad was smart enough to tutor kids but no one could pay for his schooling. They take good care of each other to this day though.\n\nEdit: got the program wrong. she came to clean houses then became a nurse.",
      "sentiment": 0.7184
    },
    {
      "id": "ft4r65r",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4r65r/",
      "user": "GoaterSquad",
      "text": "What was your original country?",
      "sentiment": 0.3182
    },
    {
      "id": "ft4t0yl",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4t0yl/",
      "user": "thewiseswirl",
      "text": "Had to edit the original post. My mom just clarified that she came to clean houses but up-skilled.\n\nCosta Rica (another bit of a privilege). It was a different world 30+ years ago but we still had the benefit of a rather calm country with a good education system.",
      "sentiment": 0.9481
    },
    {
      "id": "ft4tl8w",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4tl8w/",
      "user": "GoaterSquad",
      "text": "Did she immigrate legally?",
      "sentiment": 0.1027
    },
    {
      "id": "ft4ub0s",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/ft4ub0s/",
      "user": "thewiseswirl",
      "text": "Yup. Housekeeper program. Temporary visa type thing.",
      "sentiment": 0.0
    },
    {
      "id": "gvwp12",
      "url": "https://www.reddit.com/r/TrueReddit/comments/gvwp12/how_big_is_the_racial_wealth_gap/",
      "user": "DearBurt",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "fsrcbqt",
      "gvwp12"
    ],
    [
      "fsrcodz",
      "gvwp12"
    ],
    [
      "fsrf6r4",
      "gvwp12"
    ],
    [
      "fsrig33",
      "fsrcodz"
    ],
    [
      "fsrrlya",
      "fsrig33"
    ],
    [
      "fsrrnkf",
      "fsrf6r4"
    ],
    [
      "fsrzlxo",
      "gvwp12"
    ],
    [
      "fssa5qb",
      "fsrcodz"
    ],
    [
      "fssnd1n",
      "gvwp12"
    ],
    [
      "fssrlzj",
      "fssa5qb"
    ],
    [
      "fssrn4s",
      "fssa5qb"
    ],
    [
      "fsss817",
      "fssnd1n"
    ],
    [
      "fsst6vn",
      "gvwp12"
    ],
    [
      "fsst8s7",
      "gvwp12"
    ],
    [
      "fsstkw4",
      "gvwp12"
    ],
    [
      "fssxofu",
      "gvwp12"
    ],
    [
      "fsszeca",
      "fssrn4s"
    ],
    [
      "fst36vk",
      "fssa5qb"
    ],
    [
      "fst3sl1",
      "fssrn4s"
    ],
    [
      "fst3soy",
      "fsszeca"
    ],
    [
      "fst3thx",
      "fsstkw4"
    ],
    [
      "fst55cc",
      "fst36vk"
    ],
    [
      "fst70uj",
      "fssa5qb"
    ],
    [
      "fst79t7",
      "fst36vk"
    ],
    [
      "fst7byx",
      "fst36vk"
    ],
    [
      "fst817b",
      "fst70uj"
    ],
    [
      "fsthmzs",
      "fst7byx"
    ],
    [
      "fsw3l3j",
      "fsthmzs"
    ],
    [
      "fsw5g2n",
      "fst79t7"
    ],
    [
      "fsx2zxl",
      "fsthmzs"
    ],
    [
      "fsx3hy5",
      "fsx2zxl"
    ],
    [
      "ft3ag7t",
      "fsthmzs"
    ],
    [
      "ft4esqb",
      "ft3ag7t"
    ],
    [
      "ft4pcn2",
      "ft4esqb"
    ],
    [
      "ft4qdon",
      "ft4pcn2"
    ],
    [
      "ft4r65r",
      "ft4qdon"
    ],
    [
      "ft4t0yl",
      "ft4r65r"
    ],
    [
      "ft4tl8w",
      "ft4t0yl"
    ],
    [
      "ft4ub0s",
      "ft4tl8w"
    ]
  ]
}