{
  "nodes": [
    {
      "id": "fta5e0u",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fta5e0u/",
      "user": "pigoath",
      "text": "The boondocks is still relevant to this day.\n\nThis nigga always comes up out of the blue whenever this happens 😒",
      "sentiment": 0.0
    },
    {
      "id": "ftagvso",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftagvso/",
      "user": "squirrels33",
      "text": "Honestly, Al Sharpton is pretty tame compared to most of the woke activists these days.",
      "sentiment": 0.7351
    },
    {
      "id": "ftaindj",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftaindj/",
      "user": "Lacedaemon1313",
      "text": "Holy shit!!!",
      "sentiment": -0.6679
    },
    {
      "id": "ftaip6r",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftaip6r/",
      "user": "Complex-Captain",
      "text": "Wacktivists!",
      "sentiment": 0.0
    },
    {
      "id": "ftawj1d",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftawj1d/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "ftb359c",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb359c/",
      "user": "chadbarrett",
      "text": "Ummm he’s a pretty well known career black activist. He kind of plays both sides, he’s kind of loud when he’s on CNN  demanding unity, but among just blacks he can get a bit anti white occasionally. But really just your typical old dude career activist who’s running off their name. He also has some shady financial stuff and alliances with radicals\n\nI feel weird typing this because I never in my life sat down and explained who he us because I never would have guessed someone isn’t aware of one of the most famous and hated by the right, black civil rights activist alive today.",
      "sentiment": -0.7385
    },
    {
      "id": "ftb37j1",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb37j1/",
      "user": "lowrads",
      "text": "Just an opportunist.",
      "sentiment": 0.0516
    },
    {
      "id": "ftb4gm4",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb4gm4/",
      "user": "StandWithChrist",
      "text": "I was wondering why they always took shots at the guy, but looking back it's totally true!\n\nI keep thinking he died during his quiet periods, but when something occurs he's always there ready to lead the charge on w/e current event is the hottest.",
      "sentiment": 0.4179
    },
    {
      "id": "ftb4lgk",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb4lgk/",
      "user": "StandWithChrist",
      "text": "[https://imgflip.com/i/44c8pw](https://imgflip.com/i/44c8pw)",
      "sentiment": 0.0
    },
    {
      "id": "ftb4ppx",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb4ppx/",
      "user": "StandWithChrist",
      "text": "Perhaps, but we do better than a one-liner here at r/centrist.\n\nBring your basicness to a CNN or FOX-friendly sub.",
      "sentiment": 0.5927
    },
    {
      "id": "ftb6348",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb6348/",
      "user": "SexySEAL",
      "text": "&gt;he’s a pretty well known career black ~~activist~~ supremicist.\n\nFTFY",
      "sentiment": 0.6486
    },
    {
      "id": "ftb6a2i",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb6a2i/",
      "user": "Ghancc",
      "text": "Everyone in this thread so far is complaining about Al Sharpton.\n\nBut no mention of the \"March on Washington led by families of black people killed by police\"\n\nPersonally, I don't know much about him. Even if I learn more about him and grow to dislike him, this march sounds like a good idea to me.\n\nIf this idea was announced by someone else, would we be talking about that instead?",
      "sentiment": -0.7834
    },
    {
      "id": "ftb7b0t",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb7b0t/",
      "user": "chadbarrett",
      "text": "He’s not racist enough me. I just like to categorize him and general old man crazy.",
      "sentiment": 0.5139
    },
    {
      "id": "ftb7jd1",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb7jd1/",
      "user": "TheeSweeney",
      "text": "&gt;starting in the stations that have anomalies separate from the nation,\n\nSo then you do not agree with the protests, correct? \n\nDo you think what happened to George Floyd was an anomoly and not indicative of the relationship between the police and black Americans on the whole?",
      "sentiment": -0.522
    },
    {
      "id": "ftb7n55",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb7n55/",
      "user": "TheeSweeney",
      "text": "I think OP is trying to use Al Sharpton's past as a way to indirectly cast aspersions on the protests, because they're afraid of being seen as directly criticising the protests (which is what they would like to do). This is speculation, but I have seen similar behaviors before. \n\nIt's called \"concern trolling\" and is a way for someone to discredit an idea by pretending to actually genuinely care about it. \n\nFor example, if this person was a troll, then they don't really care about the optics of Al leading the march, they really just don't like the ideas behind the march, but understand that it would not be socially expedient for them to say those things out loud.",
      "sentiment": -0.4456
    },
    {
      "id": "ftb7oqn",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb7oqn/",
      "user": "DarkJester89",
      "text": "Starting with the worst, and moving to the rest. \n\nFirefighters don't start where there aren't any fires...",
      "sentiment": -0.6249
    },
    {
      "id": "ftb8bgm",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb8bgm/",
      "user": "DarkJester89",
      "text": "This is clearly aspersions on Al Sharpton, a clear antagonizer, proven by his racist history. \n\nThe protests are going to be tainted by any ill will that Sharpton brings as he starts talking, as proven by his racist history.\n\nI've encouraged protests and attended protests myself, that's a bit of a baiting comment, /u/TheeSweeney, probably to distract that...Al Sharpton is truly in fact a racist, as proven by his racist history. \n\nI could find more statements for resources if you'd like.",
      "sentiment": -0.926
    },
    {
      "id": "ftb8crd",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb8crd/",
      "user": "TheeSweeney",
      "text": "That wasn't an answer.\n\nDo you agree with the protests and their claim that the police as they are current organized are an inherently corrupt and racist institution?\n\nDo you think the behavior of that police officer was an anomoly? Is it not indicative of the relationship between police and black americans in general?\n\n&gt;Firefighters don't start where there aren't any fires...\n\nAre there \"no fires\" in most police departments? Are the killings being protested right now discrete instances that do not represent reality of most interactions between black americans and the police?",
      "sentiment": -0.885
    },
    {
      "id": "ftb8ngi",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb8ngi/",
      "user": "squirrels33",
      "text": "You’re not making sense.",
      "sentiment": 0.0
    },
    {
      "id": "ftb8qk5",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb8qk5/",
      "user": "TheeSweeney",
      "text": "Al sharptons history is irrelevant. You are attacking the person instead of their position.\n\n&gt;The protests are going to be tainted by any ill will that Sharpton brings as he starts talking, as proven by his racist history.\n\nShouldn't we be able to look past the individual to their arguments and positions? Is this post not exclusively an ad hominem attack?\n\n\n&gt;I've encouraged protests and attended protests myself,\n\nDo agree with the sentiment of *these* protests? Have you attended *these* protests?\n\n&gt;I could find more statements for resources if you'd like.\n\nAs I have said, Al's history doesn't matter. I am not claiming that what you said about him is innacurate, only that it serves no purpose other than to... well I don't know what.",
      "sentiment": -0.9496
    },
    {
      "id": "ftb9bpv",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb9bpv/",
      "user": "DarkJester89",
      "text": "I'm attacking his position because he's protested like this before, public speaking, and used his public voice to make disparging remarks about other racists. \n\nThat's how his comments have become so popularly known as him being a racist. I'll give it 14 days before he comes out with a racially divided statement. \n\nIt's like an arsonist leading the protests on home fire safety, his history to big to ignore, especially when it's so closely related to his position.",
      "sentiment": -0.7494
    },
    {
      "id": "ftb9kfd",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb9kfd/",
      "user": "StandWithChrist",
      "text": "Downvote me, then. It fuels me!",
      "sentiment": 0.0
    },
    {
      "id": "ftb9tx5",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftb9tx5/",
      "user": "DarkJester89",
      "text": "I don't believe that all police stations are, because statisitics don't justify that. \n\nI believe there's severe anomalies across police stations, yes, I don't believe the relationship amongst black Americans and police, across the nation, are as toxic. In certain cities, yes. \n\nThat's like asking, do you think all white Americans are racist? \n\nAre ALL or none men mysgoynstic against women. \n\nThe police lethal brutality (I couldn't find non lethal brutality) statistics don't prove that it's an all/most or even some AN that statisitics have been dropping (lethal brutality) for the past 6 years.",
      "sentiment": -0.891
    },
    {
      "id": "ftba19t",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftba19t/",
      "user": "TheeSweeney",
      "text": "&gt;I'll give it 14 days before he comes out with a racially divided statement.\n\nI don't think you'll find anyone that will disagree with you there, myself included. The guy is joining a protest movement about race. He will almost by definition say something that is racially divisive.\n\n&gt;It's like an arsonist leading the protests on home fire safety, his history to big to ignore, especially when it's so closely related to his position.\n\nYou're right, but is also does not necessarily mean that the arsonist is wrong. So back to the topic at hand:\n\nDo agree with the sentiment of *these* protests? Have you attended *these* protests?",
      "sentiment": -0.4956
    },
    {
      "id": "ftbarln",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbarln/",
      "user": "TheeSweeney",
      "text": "&gt;I don't believe that all police stations are, because statisitics don't justify that.\n\nThat was not the question. I am not talking about every single police station having instances of corruption. I am asking if you agree with the sentiment that the entire us police system as it it currently organized is an inherently corrupt and racist institution. Do you?\n\n&gt;I believe there's severe anomalies across police stations, yes, I don't believe the relationship amongst black Americans and police, across the nation, are as toxic.\n\nSo they are toxic, but not to the degree that they are in cities?\n\n&gt;That's like asking, do you think all white Americans are racist?\n\nNo, because again that is a question about the beliefs of individuals. It would be more accurate to compare it to asking if all white americans have benefitted directly or indirectly in some way from being part of the racial majority in the US. See how that is a bit of a more nuanced and complex question?\n\n&gt;Are ALL or none men mysgoynstic[sic] against women.\n\nNo, because again this is a question about the beliefs or actions of individuals. It would be more accurate to compare it to asking if all men in the western world exist in a patriarchal society and as such have benefitted directly or indirectly in some way from being part of that more powerful group.\n\nWhat do you think is the belief of the protestors? Could you state it in such a way that someone protesting would read it and say \"yes, that is what I believe\"?",
      "sentiment": 0.8442
    },
    {
      "id": "ftbav1l",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbav1l/",
      "user": "lowrads",
      "text": "[Oh, I was sure this was facebook.](https://www.fitnessmagazine.com/sites/fitnessmagazine.com/files/u863727/willy-wonka-you-must-be-new-here.gif)",
      "sentiment": 0.3182
    },
    {
      "id": "ftbaw5h",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbaw5h/",
      "user": "martingale18",
      "text": "Some of y’all in this thread have forgotten when Al Sharpton tweeted that the flooding in Texas a few years ago was “God’s rebuke” and it really shows.",
      "sentiment": -0.2263
    },
    {
      "id": "ftbcopj",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbcopj/",
      "user": "DarkJester89",
      "text": "I've already stated that I agree with the sentiments of the protests, and I've be overly cautious of any protests led by racist Mr. Sharpton. There 2 people in this country that I believe would start a civil war, and he is one of them.",
      "sentiment": -0.8625
    },
    {
      "id": "ftbd1vf",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbd1vf/",
      "user": "DarkJester89",
      "text": "Thanks for your input /u/TheeSweeney, \n\nI'd only ask where you get your statistics from so I can be on the same page with you. \n\nPolice Lethal Brutality- https://mappingpoliceviolence.org/nationaltrends\n\nPolice Non-Lethal Brutality-\nI have none currently that I can trust.\n\nYour other statements, I have read, but I'm not engaging, there doesn't seem to have any purpose to support any context other than diminish or insult the intention, I don't agree with your re-phrasing of things to try to do as such.",
      "sentiment": -0.7917
    },
    {
      "id": "ftbd5du",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbd5du/",
      "user": "squirrels33",
      "text": "Or you could just explain...?",
      "sentiment": 0.0
    },
    {
      "id": "ftbdoyo",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbdoyo/",
      "user": "DarkJester89",
      "text": "99% of this thread is about Al Sharpton and his racist remarks and how he's proven himself a racist in the past. Doing this charade of \"concern troll\" ooooowhhhh, look at the other hand, is just defending a racist and trying to discredit me in bringing up his racist past. People need to know about this distorted history that sharpton has. \n\nHe's going to pervert and dismantle the protest purpose harder than arsonists/looters would.",
      "sentiment": -0.9691
    },
    {
      "id": "ftbeeqm",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbeeqm/",
      "user": "DarkJester89",
      "text": " [https://www.youtube.com/watch?v=k3Zym-fkLCI&amp;feature=youtu.be](https://www.youtube.com/watch?v=k3Zym-fkLCI&amp;feature=youtu.be) \n\nSharpton/Gaetz exchange, in where Sharpton made racists remarks and then testifies to not remembering any of them. \n\n&amp;#x200B;\n\n[Whereas the Congress](https://www.congress.gov/bill/106th-congress/house-concurrent-resolution/270/text) strongly rejects the racist and incendiary actions of the          Reverend Al Sharpton; \n\nWhereas the Reverend Al Sharpton has referred to members of the Jewish faith as          \\`\\`bloodsucking \\[J\\]ews'', and \\`\\`Jew bastards''; \n\nWhereas the Reverend Al Sharpton has referred to members of the Jewish faith as          \\`\\`white interlopers'' and \\`\\`diamond merchants''; \n\nWhereas the Reverend Al Sharpton was found guilty of defamation by a jury in a          New York court arising from the false accusation that former Assistant District Attorney Steven Pagones, who is white, raped and assaulted a fifteen year-old black girl; \n\nWhereas, to this day, the Reverend Al Sharpton has refused to accept          responsibility and expresses no regret for defaming Mr. Pagones; \n\nWhereas the Reverend Al Sharpton's vicious verbal anti-Semitic attacks directed at members of the Jewish faith, and in particular, a Jewish landlord, arising from a simple landlord-tenant dispute with a black tenant, incited widespread violence, riots, and the murder of five innocent people; \n\nWhereas the Reverend Al Sharpton's fierce demagoguery incited violence, riots,          and murder in the Crown Heights section of Brooklyn, New York, following the accidental death of a black pedestrian child hit by the motorcade of Orthodox Rabbi Menachem Schneerson; \n\nWhereas the Reverend Al Sharpton led a protest in the Crown Heights neighborhood          and marched next to a protester with a sign that read, \\`\\`The White Man is the Devil''; \n\nWhereas the Reverend Al Sharpton has insulted members of the Jewish faith by          challenging Jews to violence and stating to Jews to \\`\\`pin down'' their yarmulkes; and \n\nWhereas the Reverend Al Sharpton has practiced the politics of racial division and made inflammatory remarks against whites by characterizing the death of Amadou Diallo as a \\`\\`racially motivated police \\`assassination''':          Now, therefore, be it \n\n&amp;#x200B;\n\nJust thought you should know.",
      "sentiment": -0.9966
    },
    {
      "id": "ftbg8pt",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbg8pt/",
      "user": "SexySEAL",
      "text": "He's very anti-white and antisemetic",
      "sentiment": 0.0
    },
    {
      "id": "ftbqimg",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbqimg/",
      "user": "chadbarrett",
      "text": "Is he? I always took it as the Jesus was white stuff and white men love to oppress.... it’s just too mild when it’s a punch up. He needs more teeth to get on the racist list imo.",
      "sentiment": 0.0516
    },
    {
      "id": "ftbub6j",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbub6j/",
      "user": "TheeSweeney",
      "text": "What do you believe is the sentiment of the protests?",
      "sentiment": -0.2263
    },
    {
      "id": "ftbuo6g",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbuo6g/",
      "user": "TheeSweeney",
      "text": "I am in no way defending Al Sharpton or his previous behavior, nor am I saying that any of your claims about him are false.\n\nThe person I am replying to asked  a question, about whether or not we would agree with what he has said if someone else said it. That is a reasonable and appropriate way to behave - separate the claim from the person making it.",
      "sentiment": -0.5122
    },
    {
      "id": "ftbv18t",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftbv18t/",
      "user": "TheeSweeney",
      "text": "I am asking if you agree with the sentiment that the entire us police system as it it currently organized is an inherently corrupt and racist institution. Do you?\n\n&gt;I believe there's severe anomalies across police stations, yes, I don't believe the relationship amongst black Americans and police, across the nation, are as toxic.\n\nSo they are toxic, but not to the degree that they are in cities?\n\nWhat do you think is the belief of the protestors? Could you state it in such a way that someone protesting would read it and say \"yes, that is what I believe\"?\n\nWhat about my rephrasing do you not agree with or think is unfair? Is my distinction between criticising and individual vs a system unreasonable?",
      "sentiment": -0.9213
    },
    {
      "id": "ftcv42i",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftcv42i/",
      "user": "Regular-Rain",
      "text": "George Floyd's death wasn't a tragedy. He was an incredible scumbag.",
      "sentiment": -0.7075
    },
    {
      "id": "ftd7rwz",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftd7rwz/",
      "user": "DarkJester89",
      "text": "&gt;\"concern trolling\" and is a way for someone to discredit an idea **by pretending to actually genuinely care about it.**\n\n&amp;#x200B;\n\nYou are trying to discredit me, to discredit the points made by using disparaging remarks about me. You use words like \"reasonable/appropriate\" like a weak defense that you are justly doing it, but it's just a bad faith argument. You've riddled this post with \"do you really care?\", which I've already stated that i've attended protests, in which you even challenged that..like \"did you REALLY go to these posts?\"..  Please leave me alone.",
      "sentiment": -0.1829
    },
    {
      "id": "ftd8qrh",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftd8qrh/",
      "user": "DarkJester89",
      "text": "You are acting in bad faith based on your perceived intention of discrediting and insulting people here. You twist responses, add words and use choice of questioning to paint people into corners. That's bad faith too. \n\n&gt;I don't believe the relationship amongst black Americans and police, across the nation, are as toxic.\n\nYou're painting this as \"ohh you said there are toxic\",.. No.. I said they aren't as toxic as you are painting them to be, you have a habit on this post to really add misplaced context. \n\nI've asked you to state where you are getting your statistics from, about 3 times now and you've yet to answer. \n\nIs that because you are fighting on a the viewpoints, without any statistical data to  support your cause? \n\n(See? that was me applying your twist-the-context/low jab blow line of questioning...where it's kind of insulting enough, just enough to suggest..hmm...will this get me called a bad faith actor, i hope no one notices?)",
      "sentiment": -0.87
    },
    {
      "id": "ftd93d8",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftd93d8/",
      "user": "DarkJester89",
      "text": "The sentiment here is that &gt;!you are arguing points of protests that you've yet to support statistics for, even after being asked several times for, thus indicating either you don't trust the statistics enough to post them, or you don't have any and are blindly supporting a cause without supporting it data for a nationwide movement. Keep in mind, I said you, not the protesters, I understand you have a tendency for context distortion!&lt;",
      "sentiment": -0.5149
    },
    {
      "id": "fteswzu",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fteswzu/",
      "user": "TheeSweeney",
      "text": "&gt;The sentiment here is that you are arguing points of protests that you've yet to support statistics for, even after being asked several times for, thus indicating either you don't trust the statistics enough to post them, or you don't have any and are blindly supporting a cause without supporting it data for a nationwide movement. Keep in mind, I said you, not the protesters, I understand you have a tendency for context distortion\n\nI'm not sure why you hid that behind a spoiler tag, but it certainly wasn't because it was an answer to my question.\n\nWhat do you think is the sentiment of the protests?",
      "sentiment": -0.2028
    },
    {
      "id": "fteti7z",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fteti7z/",
      "user": "TheeSweeney",
      "text": "&gt;You're painting this as \"ohh you said there are toxic\",.. No.. I said they aren't as toxic as you are painting them to be, you have a habit on this post to really add misplaced context.\n\nI don't want to paint this any way or put words in your mouth. I am asking for clarification precisely because I agree, someone could read what you wrote and interpret it in a bad faith way. I don't want to do that. That is why I am asking for clarification to make sure I understand your position.\n\nIs it fair to say that you believe there are some police stations (perhaps even many or most) that are completely free from \"toxicity\" in the form of institutional racism and corruption?\n\n&gt;I've asked you to state where you are getting your statistics from, about 3 times now and you've yet to answer.\n\nI haven't cited or referenced any statistics, so I'm unsure what you're asking for.\n\n&gt;Is that because you are fighting on a the viewpoints, without any statistical data to support your cause?\n\nI'm sorry if I come off like I'm fighting. I don't really have a stated cause in this thread. \n\nWhat do you believe my position is? What viewpoints have I stated?",
      "sentiment": 0.4644
    },
    {
      "id": "ftetuna",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftetuna/",
      "user": "TheeSweeney",
      "text": "As I said that was pure speculation. They asked why someone would bring up Al Sharpton as an individual and tie them inexorably to the protests. Troll concerning is one possilblity. That is not the only possibility. It may be the case that the person is simply unaware that they are making a bad/weak argument.\n\n&gt;which I've already stated that i've attended protests\n\nSaying \"I have attended protests\" and \"I have attended *these* protests\" are very different. I'm sure you do care about this. I am sure that you have been to political protests. Again, I am only asking you to clarify an ambiguous phrasing.",
      "sentiment": -0.4091
    },
    {
      "id": "fteujq7",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fteujq7/",
      "user": "DarkJester89",
      "text": "The longer your answers get, the less I see sincerity in your viewpoints.",
      "sentiment": 0.0
    },
    {
      "id": "ftevb3m",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftevb3m/",
      "user": "DarkJester89",
      "text": "The sentiment of racial discrimination in lethal/non-lethal police brutalities handling. \n\n&gt;Is it fair to say that you believe there are some police stations (perhaps even many or most) that are completely free from \"toxicity\" in the form of institutional racism and corruption?\n\nThis is the claim, because if you are implying that all stations are toxic, the burden is on youto  \"proving that every police station is toxic\", you can prove that as it's your question. You don't prove innocence in court, you prove guilt, that people did what you claiming. \n\nI've asked you for statistics to determine where the anomalies are, and 4 times now, you've not answered. It's quite frankly, a weak arguing technique to try to pin your arguing points and have someone prove them for you.",
      "sentiment": -0.9528
    },
    {
      "id": "ftevryr",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftevryr/",
      "user": "DarkJester89",
      "text": "&gt;I'm sorry if I come off like I'm fighting. I don't really have a stated cause in this thread.\n\nI don't think you have a cause, like your first post on this thread, just trying to discredit someone by asking very close-ended questions, specifically worded that you've repost later in a very long thread.\n\n&amp;#x200B;\n\n&gt;What do you believe my position is? What viewpoints have I stated?\n\nSeeing that you are determined that police stations ALL or none, are toxic, that you discredit anyone referencing Al Sharpton (politely defending him by discrediting any mention of criticism towards him, and that you have no statistics to base any reasonable argument on, so I'd say no position, just disagreeing and fluff arguing, as stated above.",
      "sentiment": -0.8813
    },
    {
      "id": "fteysjd",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fteysjd/",
      "user": "TheeSweeney",
      "text": "&gt; because if you are implying that all stations are toxic, the burden is on youto \"proving that every police station is toxic\", you can prove that as it's your question.\n\nI'm not.\n\n&gt;I've asked you for statistics to determine where the anomalies are, and 4 times now, you've not answered. It's quite frankly, a weak arguing technique to try to pin your arguing points and have someone prove them for you.\n\nI sincerely don't know what you're talking about. What claims have I made that you would like me to provide statistics for?",
      "sentiment": -0.7553
    },
    {
      "id": "fteyuk9",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fteyuk9/",
      "user": "TheeSweeney",
      "text": "So no, you have not attended *these* protests. \n\nGot it.",
      "sentiment": 0.1695
    },
    {
      "id": "ftez9jj",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftez9jj/",
      "user": "TheeSweeney",
      "text": "Did I state your opinion fairly and accurately?\n\n&gt;Seeing that you are determined that police stations ALL or none, are toxic,\n\nThat's a false dichotomy. I do not believe either of those things to be true.\n\n&gt;so I'd say no position\n\nOk well that is not true. My position is this, that Al Sharpton joining the protests has no bearing on the protests validity. I think the main topic of discussion should be the ideas being put forth by the protesters in general, and not tied to the specific history of one person.\n\nDo you disagree with that position?",
      "sentiment": -0.7894
    },
    {
      "id": "ftf00qa",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftf00qa/",
      "user": "DarkJester89",
      "text": "If you asking me if I think that police stations AREN'T toxic, you are implying that they are.\n\nThe last protest Sharpton joined, people were killed, and he even urges for \"offing the pigs\", :18 [implying to kill cops.](https://www.youtube.com/watch?v=XpZ0RwtvZmk&amp;feature=emb_title)\n\nAl Sharpton is going to be an instigator and then use the destruction from that as a means of blame by artificially inflating the numbers by pitting people against each other even more.\n\nIt's pointless to discuss with you anything, because you'll instigate and then play possum when you are confronted on it. Bad faith acting.",
      "sentiment": -0.9545
    },
    {
      "id": "ftf05zb",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftf05zb/",
      "user": "DarkJester89",
      "text": "&gt;These protests\n\nYes, specifically enclosed protests in a fairly dense-populated city, announced just hours prior, that's hours away from my location, no I wasn't able to *these* protests.",
      "sentiment": -0.4939
    },
    {
      "id": "ftgu526",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftgu526/",
      "user": "TheeSweeney",
      "text": "To be clear (because you said both \"Yes\" and \"no\" in your comment) you have NOT attended these specific protests. \n\nHowever you HAVE attended protests that were similarly organized?\n\n(I think you may have forgotten a word or two, but I believe I understand the sentiment of your comment. I'm simply asking for clarification, to avoid and miscommunication.)",
      "sentiment": -0.3612
    },
    {
      "id": "ftgun41",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftgun41/",
      "user": "TheeSweeney",
      "text": "don't mean to imply that they all are at all! I'm not trying to imply anything, only draw a distinction between your beliefs and those of the protestors in general. \n\nThe protestor's postion is that the police as an institution are bad and all police stations hsould be shut down and rebuilt from the ground up.\n\nYou said you agreed with the sentiment of the protests, but I don't think you agreed with this specific position. It seems like you do agree that there are problems with some police stations that need to be reformed. That is a different position from the protestors.\n\nYou also appear to believe that Al Sharpton joining the protests will lead to more violence. This is very possible and I do not deny it. However, I was asking if you thought his joining the protests has any bearing on their validity. I think we should focus on discussing the goals of the protests. It is a much more substantive conversations to focus on whether or not police stations should be defunded or how they can be reformed instead of making ad hominem attack against Sharpton.\n\nSo do you agree that a more instructive line of discussion is the topics raised by the protests, and not a single person's history?",
      "sentiment": -0.9343
    },
    {
      "id": "fth54dr",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fth54dr/",
      "user": "DarkJester89",
      "text": "*These* protests with him haven't occured yet though (in august), so what purpose does it matter if I attended a protest that hasn't occured yet? \n\nI don't know how many times I have to state that I've attended protest, or why you keep repeating this if I've stated the answer already.",
      "sentiment": -0.5859
    },
    {
      "id": "fth7p8z",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fth7p8z/",
      "user": "DarkJester89",
      "text": "Are you stating that protesters truly believe that ALL police stations and ALL police stations are toxic and all need to be banished? \n\nAre you implying that protesters aren't applying reasonable logic and that these actions are occuring in EVERY police station, and EVERY station needs to get shut down?\n\n&gt;You said you agreed with the sentiment of the protests, but I don't think you agreed with this specific position.\n\nI've stated that I agree with the sentiment, and that I dont agree with ALL police stations.\n\nStatistics don't support it. \n\nI've asked you to prove that all/most are toxic, and you've yet to post statistics, this is the fifth time now and you haven't.\n\n1. Statistics don't prove ALL/Most are toxic\n\n2. You don't haven't statistics to even verify the toxicity level\n\nI'm not attacking Sharpton personally, his vewpoints are dangerous towards both the marches AND what the marches are against. He's publicized death wishes against polices and stated \"I don't do marches\", so it's a double standard for him to lead one now. \n\nYou're trying to distract that a racist is leading an anti-racist protest, but I think both of those are DANGEROUS. I extend my 14 day-trial period of him antagonizing to end of august as he won't start until then.",
      "sentiment": -0.9851
    },
    {
      "id": "fth9dmd",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fth9dmd/",
      "user": "TheeSweeney",
      "text": "The protests (which I have been to myself, living in Brooklyn) are against the institution of police as it exists now. The protestors generally believe that the entire system is bad, and so being part of that system also makes you bad. They do jot believe thag every single individual person or station has broken the law or is toxic. It is the *job itself* and how it is practiced in the US that they are protesting against.\n\nDoes that distinction make sense?\n\nWith that in mind, would you say you agree that as a system, the police in the US is toxic and corrupt? Not, that every station is, or that each cop is, but that the way the entire police and carceral state is set up is bad.\n\nI don't think you believe that, hence, I do not think you agree with these protests.\n\nAlso, as I said earlier, he is joining a movement based on race that obviously the entire country does not agree with. As such, no one will disagree with you that he wills ay something racially divisive in the enar future.",
      "sentiment": -0.9727
    },
    {
      "id": "fth9lis",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fth9lis/",
      "user": "TheeSweeney",
      "text": "I'm sorry if I wasn't being clear.\n\nHave you attended the protests going on right now against police brutality, including protests that were not led by Sharpton?\n\nI understand that you have attended a protest a some point in your life. What protest was it? What were you protesting? When was it?",
      "sentiment": -0.9437
    },
    {
      "id": "fthfhg9",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fthfhg9/",
      "user": "DarkJester89",
      "text": "You cant say, the system is corrupt, people part of it are bad but that doesn't mean EVERY person. \n\nListen, sixth time now I'm asking you to provide statistics to see where the toxicity is. \n\nI'm stamping this as..\"I don't have any\", because it's pointless to discuss the toxicity of a system if you aren't going to realistically determine where the toxcity is even at.",
      "sentiment": -0.3071
    },
    {
      "id": "fthfv29",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fthfv29/",
      "user": "DarkJester89",
      "text": "Bad faith acting, I've stated I've attended protests against police brutality recently, you are nit picking and avoiding questions while trying to discredit people criticizing the people leading the protests.\n\nBad faith acting arguement.\n\nIs the entire system toxic and everyone in it, or just certain cities/stations/departments?\n\nWhat statistics are you using to base that answer on?",
      "sentiment": -0.9074
    },
    {
      "id": "ftii8p4",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftii8p4/",
      "user": "TheeSweeney",
      "text": "So then yes, you have attended the BLM led protests against police brutality.\n\nGreat. Power to you. Not sure why it was like pulling teeth to get you to say that.\n\nI'm not arguing that, the protests are arguing that. If you don't agree, then you don't agree with the protests.",
      "sentiment": -0.5891
    },
    {
      "id": "ftiiwrw",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftiiwrw/",
      "user": "TheeSweeney",
      "text": "&gt; You can't say, the system is corrupt, people part of it are bad but that doesn't mean every person. \n\nYes you can.\n\nI wasn't making the argument about toxicity myself before, only saying that it was the position of the protests. Protests that you claim to support, but only in a narrow window of how you define their positions, a window which you won't share with us. \n\nSo what does it mean when people say that all cops are bastards (ACAB) or jn this case, the American police state is \"toxic\"?\n\nIf it were an individual thing, you'd give them the benefit of the doubt, but it isn't; it's an institutional thing. the job itself is a bastard, therefore by carrying out the job, they are bastards. To take it to an extreme: there were no good members of the gestapo because there was no way to carry out the directives of the gestapo and to be a good person. it is the same with the american police state. [Police do not exist to protect and serve, according to the US supreme court itself](https://www.nytimes.com/2005/06/28/politics/justices-rule-police-do-not-have-a-constitutional-duty-to-protect.html), but to dominate, control, and terrorize in order to maintain the interests of state and capital.\n\nWho are the good cops then? The ones who either quit or are fired for refusing to do the job.\n\nWhile the following list focuses on the US as a model police state, ALL cops in ALL countries are derivative from very similar violent traditions of modern policing, rooted in old totalitarian regimes, genocides, and slavery, if not the mere maintenance of authoritarian power structures through terrorism.\n\n- [police shoot people twice as often as previously thought](https://news.vice.com/en_us/article/xwvv3a/shot-by-cops). Keep in mind that this was self-reported, so we have no way of knowing if these numbers speak to the actual number of shootings in the US. Many of these people are completely unarmed. Police kill far, far more people than terrorists in the US and have killed over a hundred people more than mass shooters did in 2019 that we are aware of. Mass shooters are easily tracked. Police killings are not. [1](https://www.theroot.com/here-s-how-many-people-police-killed-in-2019-we-think-1841183889) [2](https://www.fbi.gov/file-repository/active-shooter-incidents-in-the-us-2019-042820.pdf/view)\n\n- Oh, and cops also killed more people in 2019 than school shooters did [in all of US history](https://en.wikipedia.org/wiki/List_of_school_shootings_in_the_United_States_by_death_toll).\n\n- [And if they don't shoot you, they might just airstrike your block and burn your children alive.](And if they don't shoot you, they might just airstrike your block and burn your children alive.)\n\n- [They also shoot one dog every hour, every day](https://archive.is/UtPiG). At the absolute least.\n\n- Once you're in jail, be prepared to sit there for weeks/months/years. [It's so bad that people constantly plead guilty just so they can get out.](https://www.nbcnews.com/news/us-news/innocent-man-pleaded-guilty-drug-charge-get-out-jail-it-n1067321) It's so bad and so common, in fact, that [over a third of all exonerations come after an individual has pleaded guilty](https://www.law.umich.edu/special/exoneration/Documents/Exonerations%20in%202018.pdf). \n\n- And getting arrested is easy - tens of thousands of people yearly, in fact, thanks to lowest bidder garbage that police departments use in order to test for illicit substances. Field drug tests are about as reliable as lie detector tests or horoscopes. They just don't work. [They just don't.](https://www.propublica.org/article/common-roadside-drug-test-routinely-produces-false-positives)\n\n- Think you're safe if you just follow directions? [Yeah, no](http://nymag.com/intelligencer/2017/12/graphic-video-shows-police-killing-of-unarmed-man-in-arizona.html). And if they don't just outright kill you, they can make their instructions [so arcane and hard to follow](https://www.youtube.com/watch?v=OflGwyWcft8) that they'll kill you for not following them, and they'll usually get away with it. He got away with it, [by the way](https://www.independent.co.uk/news/world/americas/arizona-police-shooting-killed-man-crawling-floor-killed-a8100326.html).\n\n- [They'll prosecute you for even knowing about crimes cops have committed.](https://boingboing.net/2019/02/26/list-of-thousands-of-criminal.html)\n\n- Think you're safe in your home? lmao nah. Not even your 7 year old is safe from getting her brains blown out. check out [this horrifying megapost on no-knock raids.](https://archive.is/quFI4)\n\n- [Being a taxi driver is literally more dangerous than being a cop.](https://thinkprogress.org/how-dangerous-is-it-to-be-a-cop-heres-what-the-data-says-c07f6a58d8fc/)\n\n- [Cops are more of a danger to themselves than anyone else is to them](https://www.usatoday.com/story/news/2018/04/11/officers-firefighters-suicides-study/503735002/)\n\n- [They've admitted to stealing as much -or recently more- than burglars through \"asset forfeiture,\" and the rate of their thefts has been climbing yearly.](https://www.washingtonpost.com/news/wonk/wp/2015/11/23/cops-took-more-stuff-from-people-than-burglars-did-last-year/) Keep in mind, these numbers only articulate what's been reported. It's probable that they've stolen far more.\n\n- [Police are literally allowed to rape people on the job in 35 states](https://www.buzzfeednews.com/article/albertsamaha/this-teenager-accused-two-on-duty-cops-of-rape-she-had-no), as they have the power to determine whether or not you consented to sex with them while in their custody.\n\n- [Up to 50% of the people police murder are disabled](https://www.theguardian.com/society/2016/mar/29/media-must-report-police-violence-towards-disabled-people)\n\n- [The police are being trained to kill as if they're an occupying army and we're an insurgency.](https://www.youtube.com/watch?v=ETf7NJOMS6Y) this is an inevitability, as the military-industrial complex needs to keep expanding into new markets.\n\n- Eugenics was still alive and well in the prison-industrial complex up until very recently, and could very well be continuing, as it was [forcibly sterilizing inmates as late as 2010](https://www.theguardian.com/commentisfree/2013/nov/08/california-female-prisoner-sterilization). I honestly don't see a reason to believe it's stopped.\n\n- The [US surveillance state is massive](https://qz.com/1670686/the-us-has-a-lot-in-common-with-chinas-surveillance-state/) (and while this post primarily focuses on the US, [other countries are just as bad](https://www.theverge.com/2016/11/23/13718768/uk-surveillance-laws-explained-investigatory-powers-bill)), though much of our surveillance is privatized. [This doesn't stop the police from partnering with private companies, however](https://archive.is/bL5fT). This will only get worse as time goes on. Also, we can't forget about the Patriot Act and [Snowden's PRISM leaks](https://en.wikipedia.org/wiki/PRISM_(surveillance_program).\n\n- The police, as an institution, are so completely steeped in violence, that [up to 40% of them commit acts of domestic violence and other forms of domestic abuse](http://womenandpolicing.com/violencefs.asp). Most citizens can't own firearms if found guilty of domestic violence, and these guys are expected to handle military-grade equipment.\n\n- [You can't even really defend yourself from a cop, and if a cop murders you for no reason, he's almost certainly going to get away with it.](https://www.vox.com/2014/8/13/5994305/michael-brown-case-investigation-legal-police-kill-force-murder)\n\n- [Police exist to control and terrorize us](https://www.thedailybeast.com/the-day-ferguson-cops-were-caught-in-a-bloody-lie), not serve and protect us. That's only their function if you happen to be rich and powerful.\n\n- also this: [lol](https://abcnews.go.com/US/court-oks-barring-high-iqs-cops/story?id=95836)\n\n- [The police as they are now haven't even existed for 200 years as an institution](https://libcom.org/history/origins-police-david-whitehouse), and the modern police force was founded to control crowds and catch slaves, [not to \"serve and protect\"](https://libcom.org/history/stop-kidding-yourself-police-were-created-control-working-class-poor-people-sam-mitrani) -- unless you mean serving and protecting  \"the 1%.\" They have a long history of controlling the working class by intimidating, harassing, assaulting, and even ]murdering strikers during labor disputes.](https://en.wikipedia.org/wiki/List_of_worker_deaths_in_United_States_labor_disputes) This isn't a bug; it's a feature.\n\n- The justice system also loves to intimidate and outright [assassinate civil rights leaders.](https://en.wikipedia.org/wiki/Fred_Hampton)",
      "sentiment": -0.9995
    },
    {
      "id": "ftil397",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftil397/",
      "user": "DarkJester89",
      "text": "Pulling teeth to what? Admit that I went to recent protests about this, I told you that before you asked. I had to ask you six times and you still didn't provide statistics",
      "sentiment": -0.0258
    },
    {
      "id": "ftilfbk",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftilfbk/",
      "user": "DarkJester89",
      "text": "So you are going to copy/paste sources like \"vice news\" about data that's not even significants compariative to the situation\n\nWhy the eff would I need to compare \"cops killed more students that school shootings\" from a source like \"Vice News\"\n\nI'm asking about brutality cases and discrimination cases, pulled from police databases, that I can compare on a state level criteria, to see what states are the worst. \n\nI get it, you hate the police, but all that data you provide is totally pointless in resolving the problem because you've still yet to identify WHERE the problems are.",
      "sentiment": -0.8737
    },
    {
      "id": "ftim69b",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftim69b/",
      "user": "DarkJester89",
      "text": "&gt;a window which you won't share with us.\n\nI've been open about all questions you've asked, you denied a question 6 times until you copy/pasted these data points.\n\n&gt;Police do not exist to protect and serve, according to the US supreme court itself, but to dominate, control, and terrorize in order to maintain the interests of state and capital.\n\nThe article you linked, was a paywall, so you'd have to give a new source for that. \nhttps://www.nytimes.com/2005/06/28/politics/justices-rule-police-do-not-have-a-constitutional-duty-to-protect.html\n\nI'd say 80% of the other links are too, the stats, inflating \"cops are bad\", but nothing to really pinpoint where the problem stations are.",
      "sentiment": -0.945
    },
    {
      "id": "ftjccvf",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftjccvf/",
      "user": "TheeSweeney",
      "text": "&gt;I've been open about all questions you've asked, you denied a question 6 times until you copy/pasted these data points.\n\nCopy pasted... from my own comment in another thread.\n\nAlso this is amazing, you ask for evidence for a claim I didn't make in this thread. I was asking you questions and instead of answering them you assigned a position to me and then insisted I provide statistics. I ignore this and try to get you to give a straight answer you some simple questions, and you dance aroung just repeatedly asking me for stats and data. I finally squeeze half of an answer out of you and then move on to provide some evidence and your response is...\n\n\"I don't have to respond to this because I don't think you wrote it?\" \n\nThis is one of the worst arguments you have ever made. I'm disappointed in you.\n\n&gt;The article you linked, was a paywall, so you'd have to give a new source for that.\n\nIt's about a Supreme Court Case, so no problem, you can read about it here\n\nhttps://en.wikipedia.org/wiki/Warren_v._District_of_Columbia\n\nOr here is an article summarizing it and other similar cases\n\n&gt;“Neither the Constitution, nor state law, impose a general duty upon police officers or other governmental officials to protect individual persons from harm — even when they know the harm will occur,” said Darren L. Hutchinson, a professor and associate dean at the University of Florida School of Law. “Police can watch someone attack you, refuse to intervene and not violate the Constitution.”\n\nhttps://mises.org/power-market/police-have-no-duty-protect-you-federal-court-affirms-yet-again\n\n&gt;I'd say 80% of the other links are too, the stats, inflating \"cops are bad\", but nothing to really pinpoint where the problem stations are.\n\nRight, because as I have said many times, the problem is not with individual police stations, it is with the institutions. \n\nYou by definition can't \"pinpoint\" an institutional problem.\n\nDo you understand that distinction?",
      "sentiment": -0.9545
    },
    {
      "id": "ftjckfh",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftjckfh/",
      "user": "TheeSweeney",
      "text": "&gt;Why the eff would I need to compare \"cops killed more students that school shootings\" \n\nA lot of annoying liberals focus on school shootings as a source of signifigant violence in the US. The police are a much greater source of violence, that is the point.\n\n&gt;I get it, you hate the police, but all that data you provide is totally pointless in resolving the problem because you've still yet to identify WHERE the problems are.\n\nI've said this a few times now, it's an institutional problem, so the *entire institution* is the problem. This idea was explored in my last comment. \n\nDo you understand what an it means for there to be institutional problems?",
      "sentiment": -0.9728
    },
    {
      "id": "ftjcp6f",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftjcp6f/",
      "user": "TheeSweeney",
      "text": "Is there a difference between someone saying \"I have attended a protest\" and \"I have attended these protests\" in a conversation about a specific set of protests?",
      "sentiment": -0.5859
    },
    {
      "id": "ftjgdgy",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftjgdgy/",
      "user": "DarkJester89",
      "text": "I asked for statistics, you gave me opinion pieces of \"cops kill dogs more than they kill whites\"...\n\nStatistics is.. state break down, brutality cases, biographical data, incident reports, cases reported, brutality cases, before custody, after custody? \n\nI don't think you wrote it, because one paywall articles are even the basics of the rules of this group and I never took you to blatantly reference a wiki. At least do the due diligence of getting the court summary report. \n\nIf you can't do a statistics report to identify...by state, and the by city, and then by jurisdictional area.  If you cant find the fata, just say that, and I'll continue doing my own search for it, otherwise, these tabloid articles are just fluff for \"cop man bad\", and not really interpreting any real data",
      "sentiment": -0.9725
    },
    {
      "id": "ftjgqmo",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftjgqmo/",
      "user": "DarkJester89",
      "text": "Institutional problem implies problems everywhere, you've yet to provide data to proof that. \n\nI'd agree bad shit happens in major cities with cops, but I wouldn't be able prove to someone else without data.\n\nI wouldn't be able to relay to you the foundations on HOW it's a problem. That's what I'm asking, it's not that I don't believe you, but I can't support you without data, if challenged on it\n\nEdit: on mobile.. geez rewording..",
      "sentiment": -0.8883
    },
    {
      "id": "ftjh7y0",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftjh7y0/",
      "user": "DarkJester89",
      "text": "You made it specific, \n\nI thought \"these\", were directed to the ones ran by Sharpton (racist), which I said no too.. (because they haven't occured yet). \n\nI specified I've attended recent protests, so unless you are really trying to paint out of context, my intention was a police brutality protest as it's on a post about police brutality.",
      "sentiment": -0.9524
    },
    {
      "id": "ftkvacl",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftkvacl/",
      "user": "TheeSweeney",
      "text": "Actually that isn't what it means when something is an institutional problem.\n\nCould you share any definitions, thunk pieces, essays, or anything at all really where someone says that if there is an institutional problem that means every sijngle person/part of that institution is discretely contributing to the issue?",
      "sentiment": -0.4939
    },
    {
      "id": "ftkvfmx",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftkvfmx/",
      "user": "TheeSweeney",
      "text": "You specified \"recent*only only after pressed.\n\nAre there not other protests going on?\n\nIf someone attended a counter-protest, could they not have expressed this using the exsct same words that you did?\n\nI'm trying to eliminate any ambiguity. That's it. I've seen users on here use ambiguous wording to hide behind.",
      "sentiment": -0.1012
    },
    {
      "id": "ftkxg09",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftkxg09/",
      "user": "DarkJester89",
      "text": "I'm pretty sure you are assuming everyone, i mean everyone, are hiding behind words, like you do, \n\nI've acknowledged the problems, stated my own data on lethal police brutality and been following this story. You're just acting in bad faith if you are assuming users are acting in ill intentions. Between the two of us, you're arguments for the cause are weaker because you don't even have data to support the intent of the purpose of the protest.\n\n7 times now, I've had to ask for it.",
      "sentiment": -0.8519
    },
    {
      "id": "ftkzb6v",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftkzb6v/",
      "user": "DarkJester89",
      "text": "[You said it](https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftgun41?utm_source=share&amp;utm_medium=web2x) \n\n&gt;The protestors generally believe that the entire system is bad, and so being part of that system also makes you bad. \n\n&gt;They do not believe that every single individual person or station has broken the law or is toxic. \n\n&gt;The protestor's position is that the police as an institution are bad and all police stations should be shut down and rebuilt from the ground up.\n\nYou're starting to back track again, So how does being part of a system makes you bad, but not toxic?\n\n&gt;every police station should be shut down.\n\nYou (or protesters) have yet to provide any statistics on why ALL police stations are bad. A few tabloid articles in a few dense populated cities are not source data for that proof. \n\nI agree the problem exists, but you have not done the due diligence to respect the problem enough to prove where the problems are, just casting a wide net, and hoping no one challenges on data, because you don't have any.",
      "sentiment": -0.9595
    },
    {
      "id": "ftl12yb",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftl12yb/",
      "user": "DarkJester89",
      "text": "Oh goodness, it just dawned on me.\n\nIs it because the data isn't going to support that\n\n&gt; the entire system is bad, and so being part of that system also makes you bad.\n\n&gt; all police stations should be shut down and rebuilt from the ground up.\n\nAre you purposely NOT posting data because it's not going to support the claim?",
      "sentiment": -0.8184
    },
    {
      "id": "ftn0vdy",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn0vdy/",
      "user": "TheeSweeney",
      "text": "Again, you seem to misunderstand the difference between something being an individual problem and a systemic problem.\n\nLet's use the Gestapo as an example. If we can agree that the Gestapo is bad, then being someone who perpetuates its mission is also bad. It doesn't matter if Hans is a good family man, has never killed any jews, and his job as a gestapo officer is limited to a small Austrian hamlet that is relatively separate from the greater conflict of WWII.\n\nI don't have to prove that every single gestapo officer was bad or evil as an individual to say that the system they perpetuates was bad/evil.\n\nDoes that make sense?\n\nI'm also unclear why you now seem to put yourself at odds to the protestors. Didn't you say you attended these protests and agree with their message? Do you think I have inaccurately portrayed their message, and you agree with it stated a different way?",
      "sentiment": -0.9328
    },
    {
      "id": "ftn0xfl",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn0xfl/",
      "user": "TheeSweeney",
      "text": "Please do not split the conversation up into two threads.",
      "sentiment": 0.3182
    },
    {
      "id": "ftn17p8",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn17p8/",
      "user": "TheeSweeney",
      "text": "What argument have I made in this thread that requires evidence?\n\nYou've finally just said that you attended these protests, so you agree with their message - that the police are bad and need systemic reform. There's nothing else to discuss here, we agree!",
      "sentiment": -0.443
    },
    {
      "id": "ftn20fi",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn20fi/",
      "user": "TheeSweeney",
      "text": "There were many statistics in there, it seems your consciously choosing to ignore them. For example how 40% of police officers admit to engaging in domestic violence. Does the job attract abusers? Is the way its designed making people abusers? I don't know, but maybe reforming the system is a good start. But you agree with that! You said you went tk the protests and agree with their position. Having also been to the protests myself, I can tell you with absolute certainty that my fellow protestors in the street would unreservedly agree with all that I've posted. \n\nYou asked for the information behind the pay wall (a nyt paywall. I live in nyc. I have an nyt subscription. Not sure why this means I didn't write the comment), and I provided it.\n\nEven so, that's a terrible argument to make - \"I don't have to respond to this because I'm pretty sure you didn't write this comment originally.\" That's an absurd position. What's to stop you from saying \"you didn't do these studies yourself, so I don't have to trust them.\" c'mon...\n\nSince you only mentioned that piece, and I have now provided additional links to the same information, I assume you then agree with everything stated and posted in the comment.",
      "sentiment": 0.4031
    },
    {
      "id": "ftn3juc",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn3juc/",
      "user": "DarkJester89",
      "text": "I can't agree with someone that wouldn't solidly position themselves behind a cause while trying to justify it without evidence. \n\nYou won't commit to a viewpoint and you won't commit your belief is, only what protesters believe. I dont even know why you are arguing the point if you don't believe it yourself.",
      "sentiment": -0.831
    },
    {
      "id": "ftn4mat",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn4mat/",
      "user": "DarkJester89",
      "text": "Listen, you dance around conversations.\n\nYou won't put up any solid evidence supporting your..... my apoligies.. the protesters arguements, because gosh forbid if you ever commit yourself to a viewpoint, (hence you'd have to defend it yourself, which you won't).\n\nYour references were shoddy at best, mostly describing dense populated city police, or..still dense populated suburbs AROUND the same cities, while referencing paywall articles (frowned upon in this group). \n\nYou posted nothing of value to describe why the system is bad or the bad people that aren't toxic that are a part of it.\n\nJust very instigating towards individual situations that happen over and over in the high populated cities. \n\nI can't agree with you because I really don't know what your viewpoints are, you kept deflecting it to \"the protesters beliefs\". \n\nIf I asked you what the most toxic police station was in the US, you wouldn't be able to answer, because you collect opinion pieces and call them news articles or study articles that do no real intention to report anything. \n\nIf I'm putting myself at odds by disagreeing with you, its because I'd say that I'm claiming that you are grossly misinformed, lacking accurate information to support ...whatever it is you are claiming. You, not the protesters. \n\nYou keep them at arm's reach when beneficial, but will separate from them when it suits you.",
      "sentiment": -0.466
    },
    {
      "id": "ftn4uvh",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn4uvh/",
      "user": "DarkJester89",
      "text": "I can support my claims on police lethal brutality and racial discrimination from those cases, and..pretty reasonable describe across which states are bad and which ones have zero cases. \n\nIf you aren't going to state your own viewpoints and defend them properly, then don't preach to other people or try to criticize about them attending protests.",
      "sentiment": -0.8519
    },
    {
      "id": "ftn5pge",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn5pge/",
      "user": "DarkJester89",
      "text": "40% of what poll?  of one station, of all stations, of a certain type of officer? What year frame was this? Who was running the DOJ?\n\n&amp;#x200B;\n\nAttract abusers, are you claiming that the police station doesn't do an accurate background check of checking for criminal backgrounds in terms of domestic violence and sexual assault abusers.\n\n&amp;#x200B;\n\nThe paywall rule is in plain view for everyone. \n\n4. If you make a link with an article that has to be payed to be read then you must summarize the key points. \n\nThey weren't studies, they were just hype article collection, typical ones of \"I hate cops\", \"Cops are bad\", equivalent of the 1st and 2nd page searches of google results.  \n\nNo biographical collection of real data that can show breakdowns of states compared against each other. City police are a bad, you just haven't proven on a comparison of how bad they are.",
      "sentiment": -0.9864
    },
    {
      "id": "ftn67by",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftn67by/",
      "user": "DarkJester89",
      "text": "Ben Shapiro did a speech about institutional racism, and he made the claim that making claims that \"it's everywhere\", but not doing diligence to get informed on \"where everywhere is\", or a starting point on the worst areas, it's pointless because its a faceless problem. How can you say it's everywhere, if you can't even prove how strong it is in the places that you know it's at?\n\nI'd stand by you if you could inform me on that, but you don't even seem dedicated enough to the protest to say the viewpoints are your own, you just keep saying \"there viewpoints\", \"the protesters think\", which I'd ask, do you even share these viewpoints?",
      "sentiment": -0.9174
    },
    {
      "id": "fto8d0t",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fto8d0t/",
      "user": "TheeSweeney",
      "text": "&gt;do you even share these viewpoints?\n\nOf course! And so do you, since you said you went ot the protests and support their message. What part of what I have said is not supported by the protestors?",
      "sentiment": 0.3999
    },
    {
      "id": "fto8ila",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fto8ila/",
      "user": "TheeSweeney",
      "text": "http://womenandpolicing.com/violencefs.asp\n\n1 Johnson, L.B. (1991). On the front lines: Police stress and family well-being. Hearing before the Select Committee on Children, Youth, and Families House of Representatives: 102 Congress First Session May 20 (p. 32-48). Washington DC: US Government Printing Office.\n\n2 Neidig, P.H., Russell, H.E. &amp; Seng, A.F. (1992). Interspousal aggression in law enforcement families: A preliminary investigation. Police Studies, Vol. 15 (1), p. 30-38.\n\n\nPlease do not split up your comments in one thread. Try to keep them all to a single chain.",
      "sentiment": -0.4019
    },
    {
      "id": "fto8kal",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fto8kal/",
      "user": "TheeSweeney",
      "text": "You're replying to my comments twice and splitting up the conversation. You've done that twice in this thread.\n\nPlease do not split the conversation up into multiple threads.",
      "sentiment": 0.3182
    },
    {
      "id": "fto8y3m",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fto8y3m/",
      "user": "TheeSweeney",
      "text": "Since you did not directly address it, I assume you now understand the difference between an institutional and individual problem, right?\n\n&gt;I can't agree with you because I really don't know what your viewpoints are, you kept deflecting it to \"the protesters beliefs\".\n\nI don't need you to agree with me. I haven't even really stated a position. \n\nI'll say I do support the message of the protestors, and have gone to these protests as a result. You have also said you agree with the protestors and have gone to the protests as well. \n\nSo we agree! The police as an institution are bad and need reform.\n\n&gt;I can't agree with you because I really don't know what your viewpoints are, you kept deflecting it to \"the protesters beliefs\".\n\nI agree 100% with the position of the protestors that the police are bad as an institution and needs to be rebuilt from the ground up. You agree with me, since you have also attended these protests, and this is their primary goal.\n\n&gt;If I asked you what the most toxic police station was in the US,\n\nIt's tough, but a good contender might be the one in chicago that operated a CIA-esque blacksite that they used to illegally interrogate witnesses. https://www.theguardian.com/us-news/2015/feb/24/chicago-police-detain-americans-black-site\n\nBut you're right, since the problem is institutional, it's tough to pick a \"most toxic.\"",
      "sentiment": -0.3945
    },
    {
      "id": "fto920b",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fto920b/",
      "user": "TheeSweeney",
      "text": "I 100% agree with the positions of the protestors.\n\nSpecifically, I 100% believe that the police as an institution are bad and need reform from the ground up.\n\nYou have said you also agree with the position of the protestors. So if we agree, why are you being so antagonistic?\n\nDo you not agree with the protestors or is how I have stated their position inacurate?",
      "sentiment": -0.4014
    },
    {
      "id": "ftpbpyc",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftpbpyc/",
      "user": "DarkJester89",
      "text": "https://golawenforcement.com/articles/need-know-police-background-check-common-disqualifiers/\n\nDomestic violence, (interspousal aggression) is sought for in a background check in the hiring process. \n\nI'm not sure what your claim on \"splitting up\" comments, unless you are drastically trying to control the conversation....again.",
      "sentiment": -0.8054
    },
    {
      "id": "ftpbwht",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftpbwht/",
      "user": "DarkJester89",
      "text": "Oh, so for the 8th time of you not posting data to support the protesters claim is me \"splitting the conversation up.\n\nJust so it's clear for everyone, you are diverting it because you are refusing to answer with statistics, and not just random news articles.",
      "sentiment": 0.2449
    },
    {
      "id": "ftpcnpu",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftpcnpu/",
      "user": "DarkJester89",
      "text": "&gt;understand the difference between an institutional and individual problem.\n\nYou haven't stated a position because you know you'd have to defend it and you won't. \n\nMy viewpoint isn't that the institution is bad, I think the protesters wouldn't say the system is bad, if they are, they are just umbrella waving it like you are...but NOT supporting any evidence on how the system is corrupt everywhere, and how everyone a part of is it part.\n\nThey could probably do like what you just did.. This place is terrible, that station is toxic... Thats what I'm looking for, fix THOSE stations. dismantle, replace...etc...   but the stations that obviously aren'te violating thies \"toxic\" criteria, ....you're just swooping them guilty by association, and that's wrong.  \n\nIf you can't prove where the toxic stations are, frequency, level, criterias of toxicity, don't just blanket target the whole system. \n\nNo, I dont agree that police are bad....as a whole... I dont think...all..stations need to be replaced... because you haven't proved it.\n\nIt's pretty dirty that you do this \"you agree (thatallcopsarebadbecauseyouwentothis), so we totally agree, wink wink\"   \n\n&gt;it's tough to pick a \"most toxic.\"\n\nYeah, it's tough to pick something when you have literally zero data to look at and pick one.",
      "sentiment": -0.509
    },
    {
      "id": "ftpcw5z",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftpcw5z/",
      "user": "DarkJester89",
      "text": "I agree with the educated protester who can actually see the following points.\n\n- identifying the hostile stations\n- reestablishing base lines for data reporting\n- that not all stations are toxic \n- that you arent guilty by association for just being a police officer.\n\nYour viewpoint is an extremist viewpoint, you aren't a protester, you're just a cop hater.",
      "sentiment": -0.1451
    },
    {
      "id": "ftq9szh",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftq9szh/",
      "user": "TheeSweeney",
      "text": "That a reasonable position, just not the one that these protests have.\n\nMy viewpoints are those of BLM. It would seem you disagree with the movement.",
      "sentiment": -0.5423
    },
    {
      "id": "ftqapv1",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqapv1/",
      "user": "TheeSweeney",
      "text": "What part of the protestors rhetoric makes you confident they wouldn't call the system bad?\n\nIf anything, it's clearly the exact opposite. The entire conversation is around systemic issues in the police, just like we're having right now, in this thread.\n\nThink of my gestapo example. If a member of the gestapo stationed in a small hamlet, separate from the war effort and have no interaction with the allied forces, jews, or any enemy. All they do is hang around and file paperwork from a  field office, are they complicit in the actions of the larger gestapo as a group?",
      "sentiment": -0.7236
    },
    {
      "id": "ftqatw3",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqatw3/",
      "user": "TheeSweeney",
      "text": "I have addressed your call for stats elsewhere in this thread.\n\nPlease refrain from splitting up this conversation into multiple threads.",
      "sentiment": 0.3182
    },
    {
      "id": "ftqb386",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqb386/",
      "user": "TheeSweeney",
      "text": "My position is that becoming a cop is whag make you a doemstix abuser, bit that domestic abusers are more likely to become cops.\n\nResponding to the same comment twice with two separate critiques is splitting up the conversation.\n\nPlease refrain from splitting up your replies into multiple threads.",
      "sentiment": -0.7096
    },
    {
      "id": "ftqfuur",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqfuur/",
      "user": "DarkJester89",
      "text": "Mass spamming splitting up threads isn't me splitting up threads. You keep referencing new vantage points from data you cherry picked but doesn't stablize the argument that it's in fact institutionalized.",
      "sentiment": 0.1568
    },
    {
      "id": "ftqfxyc",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqfxyc/",
      "user": "DarkJester89",
      "text": "You provided no stats, just angry-written news articles from city police. \n\nCome back when you have actual data not harvested from a news article/company.",
      "sentiment": -0.296
    },
    {
      "id": "ftqg5cl",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqg5cl/",
      "user": "DarkJester89",
      "text": "They are saying the system is bad, but you can't support any evidence to  say..how its bad, where its bad, at the frequency..what states are the worst contender?  What type of station is it across the nation?\n\nToo many questions with not enough answers makes it seem like blind obedience to a cause that can't be justified or supported with factual evidence.",
      "sentiment": -0.9688
    },
    {
      "id": "ftqq7zq",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqq7zq/",
      "user": "TheeSweeney",
      "text": "You acknowledge I have at least attempted to post things elsewhere ein this thread.\n\nThank you for recognizing that. \n\nPlease respond to that comment and refrain from splitting this up j to multiple threads.",
      "sentiment": 0.5859
    },
    {
      "id": "ftqqcqu",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqqcqu/",
      "user": "TheeSweeney",
      "text": "&gt;They are saying the system is bad\n\nYes exactly that is my point. Thank you for recognizing that these protests are happening against systemic issues in the police.",
      "sentiment": -0.0516
    },
    {
      "id": "ftqqfha",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqqfha/",
      "user": "TheeSweeney",
      "text": "So is the gestapo officer I described complicit, or not?",
      "sentiment": 0.0
    },
    {
      "id": "ftqxf7f",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqxf7f/",
      "user": "DarkJester89",
      "text": "I'm acknowledging you are an instigator who's posting bad guage information that doesn't support any form of what the protesting is.\n\nI guess a \"police man bad\" protest is justicely supported with your \"police man bad\" articles, implying that BLM isn't protesting a cause to support the anger with data and facts, but just anger and hoping people don't ask them about the info.",
      "sentiment": -0.8524
    },
    {
      "id": "ftqxy0t",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqxy0t/",
      "user": "DarkJester89",
      "text": "I didn't say the police was bad, that the system, like you quoted. Man, you certainly insert words to carve and distort intentions.\n\nSo now that I got your point out, (finally..it took like 20 threads to nail you down to your OWN viewpoint)\n\nSystematic issues in the police, I'm calling you to prove that problem.\n\nTry not to use \"police-blue-man-bad\" articles this time. With a purpose as important as this one, you are doing it a disservice if you want to claim its a problem, but not be able to support it.",
      "sentiment": 0.4019
    },
    {
      "id": "ftqyf1e",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftqyf1e/",
      "user": "DarkJester89",
      "text": " I'm confident that you have no idea have to explain that scenario, you have no basis on what the real sources of info are on, and just copying popular arguing viewpoints. This is the 3rd time I've seen this example. Original, not really..creative for copy/pasting it though.",
      "sentiment": 0.2263
    },
    {
      "id": "ftrmz3p",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftrmz3p/",
      "user": "TheeSweeney",
      "text": "It's the third time you've seen it because it is illustrative of the point.\n\nPurely in the hypothetical I laid out, is that officer complicit in the crimes of the gestapo?\n\nIf you say yes, then we can move on to a discussion on whether or not the police state in the us is as obviously bad as the gestapo. But we can't have that discussion if we don't first agree on what it means for there to be a systemic issue. You can then say \"the police in the US are not the same because X\" but do you at least understand the concept of how an institution can be bad without every single component part being individually bad?",
      "sentiment": -0.9316
    },
    {
      "id": "ftrn64n",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftrn64n/",
      "user": "TheeSweeney",
      "text": "&gt; I didn't say the police was bad, that the system, like you quoted.\n\nI'm confused by this sentence. I never said you believe the system is bad. I am not putting words in your mouth.\n\nThis is the position of the protestors, as you stated.\n\nI don't want to have an argument about systemic issues with the police. My only point in this thread was that you did not seem to understand the position of the protestors, or the distinction between a systemic issue and every individual actively being part of the problem.",
      "sentiment": -0.8632
    },
    {
      "id": "ftrn860",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/ftrn860/",
      "user": "TheeSweeney",
      "text": "&gt;Please respond to that comment and refrain from splitting this up into multiple threads.",
      "sentiment": 0.0
    },
    {
      "id": "fulcqwv",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fulcqwv/",
      "user": "DarkJester89",
      "text": "Here we go, back to deflecting to the protesters. \n\nYou keep doing this \"don't you agree, you think this\" and then like a spartan, when challenged.\n\n\"Protester wall!\", You don't want an arguement about systemic issues because by the looks of it, there's no strong data source to support it. \n\nI'm not saying it doesn't exist, but you/protesters have given us NO foundation to help, just point at the sky and say \"It's bad\" with no answer to.\n\n\"where is it bad\"\n\n\"How bad is it\"",
      "sentiment": -0.965
    },
    {
      "id": "fuld0tt",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuld0tt/",
      "user": "DarkJester89",
      "text": "The more you talk, the more it seems like you try to corner someone into a conversation that you need total control of. \n\nIt's lazy arguing, just using popular segways to explain a viewpoint you can't even justify with facts. What state is in the most need of renovation? \n\nWhich state has zero/least amounts of incidents? \n\n&gt;The system is bad/toxic, so if you are a part of it, you are bad too.\n\nImagine just being placed guilty by association, even if you have been doing your job well and no incidents, gosh forbid you want to punish thousands of innocent cops, because you hate the ones in your city.",
      "sentiment": -0.9245
    },
    {
      "id": "fum2nqn",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fum2nqn/",
      "user": "Springbok_RSA",
      "text": "Woketivists?",
      "sentiment": 0.0
    },
    {
      "id": "fuobpkq",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuobpkq/",
      "user": "TheeSweeney",
      "text": "My viewpoint is this, that people participating in a bad/evil/unjust system are complicit even if they do not individually participate in the organizations crimes. \n\n\nDo you believe that a gestapo member working in a small hamlet in Austria with no connection to the front is guilty by association? \n\nIf you say \"yes\", then we can have a discussion on whether or not this applies to the situation here in the US. It's very possible that it doesn't at all. However if we can agree that it is possible for someone to be guilty by association, the we have nothing to discuss. \n\nI'm not sure why you refuse to answer direct questions after rbeing asked multiple times.",
      "sentiment": -0.6968
    },
    {
      "id": "fuobw75",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuobw75/",
      "user": "TheeSweeney",
      "text": "What does it mean for there to be systemic issues? I'm not sure we are talking about the same thing.\n\nWait, not now it's \"you/protestors\" vs \"us\". But I thought you went to the BLM protests? Didnt you say you agree with the sentiment of the protestors?",
      "sentiment": 0.2404
    },
    {
      "id": "fupahez",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupahez/",
      "user": "DarkJester89",
      "text": "&gt; that people participating in a bad/evil/unjust system are complicit even if they do not individually participate in the organizations crimes.\n\nI dont agree with this, but I'm confident you'll rephrase it and twist it out of context.\n\nI'm not tracking your example so I don't understand. Some henchman that's totally clueless \"with no connection\" to the front, yeah he's totally as guilty as the people doing whatever crimes the guy is totally clueless about. \n\nBe realistic. These direct questions are so loaded, it's going to be arrested for a DUI.",
      "sentiment": -0.9231
    },
    {
      "id": "fupay1v",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupay1v/",
      "user": "DarkJester89",
      "text": "I dont think you have any sense of location in this conversation anymore. \n\nYou can't justify your viewpoints of a systematic institution.\n\nYou think that if you disagree 1% against those viewpoints, you are 100% against the viewpoint. \n\nYou can't even argue the topics yourself, so you are just using popular stereotypical arguments and incessantly rephrasing/contorting the argument.\n\nBlaming innocent people for the actions of the what's relatively the few across a hundreds of police stations is just a weak \"i hate cops but want it to see reasonable\".\n\nI don't know why you are trying to classify the protests as BLM now, (adding words to try to discredit again).  It's pointless to argue with you, you aren't arguing in good faith. You never do.",
      "sentiment": -0.7069
    },
    {
      "id": "fupj8t0",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupj8t0/",
      "user": "TheeSweeney",
      "text": "&gt;You can't justify your viewpoints of a systematic institution.\n\nIf someone participates in an organization or institution that is systemically racist/corrupt/toxic, then they are complicit in that even if they are as an individual person not racist/corrupt/toxic.\n\nDo you understand how I'm an defining systemic issues? How do you define it? \n\n&gt; It's pointless to argue with you, you aren't arguing in good faith. You never do.\n\nSays the guy who is avoiding answering any direct questions.\n\nWhat does it mean for an institution to have systemic problems?",
      "sentiment": -0.6329
    },
    {
      "id": "fupk1gs",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupk1gs/",
      "user": "TheeSweeney",
      "text": "&gt;I dont agree with this, but I'm confident you'll rephrase it and twist it out of context.\n\n\n\nWhy would I twist your words? My entire point was that you do not belive that, but the protestors do, therefore you do not completely support the protestors. \n\nI also sincerely doubt that anyone who thinks police reform would go to these protests, but I'll take your word for it.\n\n&gt;I'm not tracking your example so I don't understand. Some henchman that's totally clueless \"with no connection\" to the front, yeah he's totally as guilty as the people doing whatever crimes the guy is totally clueless about.\n\nIs this a sarcastic answer or a genuine answer? Because if it is honest, then we've actually made some progress because I would agree with you. That person, even though they may be ignorant to the greater goings on within their organization, still works to allow the organization to continue existing and is therefore in some way complicit.\n\nI just want to be clear, do you agree or was that sarcasm? Tone is difficult to detect over text and I don't want to ascribe beliefs to you that you do not hat.\n\nIf my analogy is unclear, I'd be happy to clarify it or lay out another, similar example.\n\n&gt;Be realistic. These direct questions are so loaded, it's going to be arrested for a DUI.\n\nIs my question completely unrelated to the concept of an institution being systemically bad? \n\nRemember, just because you agree that the gestapo guy is complicit, does not necessary mean you have to believe that is what is happening here. This is not a trap \"gotcha\" question. It's an analogy I am using to explore how someone can be individually innocent but still \"bad\" if they are part of a greater more evil system.\n\nAgain, agree with this does not mean that you necessarily have to believe that the US police system is *also* evil or just as evil/bad/toxic/whatever as the gestapo. Not at all! It is simply exploring how a person can be part of and complicit in the actions of the organizations they are a part of.\n\nMaybe you don't agree, and you think Hans bears no responsibility of guilt for the crimes of other gestapo agents that he did not know about. Then you would be consistent in your application of logic. This is not a completely absurd position to have, and there is certainly an argument to be made.",
      "sentiment": -0.9626
    },
    {
      "id": "fupk7yz",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupk7yz/",
      "user": "DarkJester89",
      "text": "[systemic-](https://www.vocabulary.com/dictionary/systemic) something that's systemic affects all parts of something.\n\nSystematic racism, for example, isn't saying that it's not one, two, a few police being racist, but that all cops are. That's systematic, that it applies everywhere in the system, but imlying this problem is systematic in the justice system. \n\nThe clerks, the accountants, the trainers, the front desk staff, the payroll, the HR, they are all racist/part of the racist problem. \n\nI'm asking you to prove this racism/discrimination, with a little bit more than \"this station/that station\". City cops, by far are bad, (usually that goes because city crimes are, [well just more violent](https://www.security.org/resources/most-dangerous-cities/).",
      "sentiment": -0.95
    },
    {
      "id": "fupl2tm",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupl2tm/",
      "user": "TheeSweeney",
      "text": "&gt;Systematic[sic] racism, for example, isn't saying that it's not one, two, a few police being racist, but that all cops are.\n\nNo, not quite. It's saying that the system is racist and, as your definition said, systemic problems affect all parts of something. That does not mean that every single cop is individually racist, it means the system is racist itself is. An single person might not believe racist things, but if their work perpetuates a system that is racist, then they are complicit.\n\nIf a carpenter isn't racist but sells a wooden cross to a KKK member knowing full well who they are, is the carpenter absolved of guilt when that is burnt on someone's lawn?\n\n&gt;The clerks, the accountants, the trainers, the front desk staff, the payroll, the HR, they are all racist/part of the racist problem.\n\nNo, not \"they are all racist\", only \"they are all part of the racist problem\".\n\nDo you understand how a single person could be no racist themselves, but actively participate in a racist system? \n\nLet's take the clerk. A cop who is an out and out racist beats the shit out of and arrests a completely innocent black person. The clerk knows none of the details of this interaction, all they do is take the paperwork filled out by the cop (filled with lies about feeling like their life was in danger), put a stamp on it, and enter it into the system.\n\nDid assist in the execution of a racist act? Are they completely removed from the racism of the cop, because from their position they did nothing overtly racist?\n\n&gt;I'm asking you to prove this racism/discrimination, with a little bit more than \"this station/that station\".\n\nIs it possible for someone to participate in a racist system without themselves being racist?",
      "sentiment": -0.9973
    },
    {
      "id": "fupl6sz",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fupl6sz/",
      "user": "DarkJester89",
      "text": "&gt;This is not a trap \"gotcha\" question. \n\nAll of your statements and questions are this. \n\n&gt;you'll rephrase it and twist it out of context.\n\nThis is a habit that you criticize others for doing that you try to get conversations into a death grip and the focus on such a misguide question that you'll try to discredit anyone who doesn't engage in your bad faith arguments. \n\n&gt;acknowledging that police corruption/brutality/racism/etc is system is a core concept of these protests.\n\nI acknowledge some police stations have problems, you've yet to prove that the entire system or a majority of police stations do. \n\n&gt;Hans bears no responsibility of guilt for the crimes of other gestapo agents that he did not know about.\n\nListen to that... imagine if you and I worked together, as cops, and you were snorting coke in the evidence room and banging hookers on the street, I didn't know about this, your partner of 4 years, the person I'm supposed to trust, having this dark crime.\n\nAre you HONESTLY saying, that I, unknowingly of YOUR crimes, should be AS GUILTY are YOU, the crack-snorting, hooker banging criminal while on cop time?",
      "sentiment": -0.9651
    },
    {
      "id": "fuplwp0",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuplwp0/",
      "user": "DarkJester89",
      "text": "&gt; If a carpenter isn't racist but sells a wooden cross to a KKK member knowing full well who they are, is the carpenter absolved of guilt when that is burnt on someone's lawn?\n\nIs the car dealer guilty of murder when a car they sell is driven by a drunk driver and kills a pregnant woman and her unborn child?\n\n&gt;The clerk knows none of the details of this interaction.\n\nI'm starting to see a trend that you have yet to prove. \n\nIf they didn't know about it, then how are you going to hold them accountable. How is that going to look, start arresting people for crimes they didn't even know they were a part of. \n\n\"Well, they didn't know about it, so they are guilty by association.\"\n\nYou should stop watch whatever streaming service it is, because that's theatrical.",
      "sentiment": -0.9654
    },
    {
      "id": "futoey0",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/futoey0/",
      "user": "TheeSweeney",
      "text": "&gt;I acknowledge some police stations have problems, you've yet to prove that the entire system or a majority of police stations do.\n\nI am not trying to prove that point, only that you believe exactly what you said above, which is not what the protestors believe. That's it. \n\n&gt;Are you HONESTLY saying, that I, unknowingly of YOUR crimes, should be AS GUILTY as YOU, the crack-snorting, hooker banging criminal while on cop time, because I didn't know about it?\n\nNo, because again, you are making this an individual problem and not an institutional problem.\n\nBut I guess this is your answer, that you do not think Hans is culpable and there could be some good members of the gestapo. Is that an accurate represenatation of you response to my hypothetical?\n\nYou keep answering in a sarcastic tone, so I just want to be sure I'm not twisting your words or misrepresenting your permission.\n\nIs it fair to say that you do not think every member of the gestapo was complicit in the crimes of the greater organization?",
      "sentiment": 0.8662
    },
    {
      "id": "futq0r7",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/futq0r7/",
      "user": "TheeSweeney",
      "text": "&gt;Is the car dealer guilty of murder when a car they sell is driven by a drunk driver and kills a pregnant woman and her unborn child?\n\nTo match my analogy, the car dealer would have to sell the car to someone that is actively drunk, since I said the carpenter was well aware what the cross was going to be used for. In that case yes, absolutely, a car dealer who sells a car to someone that they know is drunk or will get drunk before driving is complicit in a manslaughter that results.",
      "sentiment": -0.926
    },
    {
      "id": "futrt0e",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/futrt0e/",
      "user": "DarkJester89",
      "text": "Stretching that point of view again, really square pegging that round opinion. So everyone knows so that makes everyone complicit and supporting of racism, but not you, nor the protesters can provide any statistical data to support that? \n\nI assume at the very small section of data collection of the justice in policing act, that the data collection is place would be pretty on point. \n\nLethal police brutality is abundant, which I could support, racism is everywhere and anywhere there is a cop... Much bigger burden to prove, one that you've yet to do.",
      "sentiment": 0.1025
    },
    {
      "id": "futs7fk",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/futs7fk/",
      "user": "TheeSweeney",
      "text": "&gt;So everyone knows so that makes everyone complicit and supporting of racism, but not you, nor the protesters can provide any statistical data to support that?\n\nWoah there, you're taking an analogy and applying it literally backwards onto reality. \n\nDo you agree that the car dealer selling a car to a drunk is complicit in the resulting manslaughter? \n\nWhat is the difference between a problem being individual and systemic?",
      "sentiment": 0.2707
    },
    {
      "id": "futx76a",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/futx76a/",
      "user": "DarkJester89",
      "text": "&gt; protestors believe. \n\nI really don't think you should try to be a Moses Savior for these protesters if you can't even valid with data what their protests are. \n\nAn institutional problem is a series of same classification of problems, happening everywhere. If it's happening everywhere, where is everywhere, a few articles of enclosed cases? \n\nI've purposely ignored the gestapo hans case, for one, I'm shocked you're reference a Nazi situation in a matter of racism, (an extreme viewpoint at that, but hey, media is using it with success right?)\n\nTheres no implication of sarcasm, other than you are trying to be a voice for protesters in defining what they are standing for, but at face, you can't even support that with data, while trying to discredit anyone who disagrees. \n\nI'm not sure why you are worried about twisting/misrepresenting it now, kind of too late/deep in it now to cover those tracks.\n\nIs it fair to say that you do not think every member of the gestapo was complicit in the crimes of the greater organization?\nThat depends on \"member\" and \"complicit\", complicit being, are you trying to change them all with murder, even though one person did it?\n\nToo many elements to consider, and not enough knowledge because (i dont know if this was intentional), you explained, what appears to be half of a story for the gestapo case. Explain it in full, or send a link. I really don't trust your point of view explanation, (in that you explain things that you want people to see, while dismissing often key points and hoping no one notices).\n\nI'll counter-example.\n\nRepresentatives of CHAZ may be considered for treason. Do you believe that all members of the organization, including the ones that were within boundaries that did not know of the new border limits, should be charged for treason, regardless of intention of overthrowing the government in that 16 block radius?   \n\nI'll use this example.",
      "sentiment": -0.9896
    },
    {
      "id": "futy5b4",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/futy5b4/",
      "user": "DarkJester89",
      "text": "It being on reality would apply that you have facts that can prove it, which you don't...or ...well haven't provided.\n\nSelling to a drunk man, intentionally knowing, do you know the likihood of a car dealer either \n\n1. knowing if and how someone is drunk\n\n2. selling said car if they are drunk, you realize they have checks on mental capacity, the same way if you buy a house/ get a tattoo, the chances are unlikely. \n\nSo unless you are implying that everyone can pick up on personality traits/viewpoints/political opinions by... some kind of mind reading in public to assume that the population is totally aware and made of up.\n\n1. People who are racist\n\nOr \n\n2. People who know everyone else is racist.\n\nI'd classify that as a top shelf racial extremist viewpoint. \n\nAs a follow up to that, like car dealerships doing competency checks, what's your related competency check for racism?",
      "sentiment": -0.9434
    },
    {
      "id": "fuun03b",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuun03b/",
      "user": "TheeSweeney",
      "text": "What? I'm a bit lost here.\n\nIt's a hypothetical situation. In this hypothetical, the person is clearly and obviously drunk, like liquor bottle in hand. Is the car dealer complicit?\n\nCan someone be part of a racist system, without themselves being a racist? Is it possible for systems to be racist without every individual within them being personally racist?",
      "sentiment": -0.9356
    },
    {
      "id": "fuunu10",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuunu10/",
      "user": "TheeSweeney",
      "text": "I'm not sure you'd find many people that would agree with your definition of a \"systemic problem\", I certainly don't. Do you have any examples of institutions that fit your definition of having systemic issues?\n\nIs there any way in which you would define the terms \"complicit\" or \"member\" so that you would agree with the position \"all members of a systemically bad/toxic institution are complicit in the institutions crimes\"? Feel free to adjust the situation in any way you see fit such that your answer would be \"yes\".\n\nIf you believe that participation in CHAZ is treasonous, then yes, all members of the organization within the boundaries could be charged with treason. Though this is a bit of a different thing, since again, this is a specific situation and you haven't made the argument that it is a systemic issue.",
      "sentiment": 0.8593
    },
    {
      "id": "fuuvdbm",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuuvdbm/",
      "user": "DarkJester89",
      "text": "The tax system is, full of loopholes that were purposelly put in place to pocket the rich. The problem is all the problems are legally just, but obviously put in as loopholes.\n\nSystematic problems are... every agency has the same problem, it's systematic, it's a pattern.  I don't agree trying to complicit these unknowing bystanders, it seems vengeful, no matter how you try to twist it.\n\nCHAZ isn't a systematic issue, until the similiar CHAZ, CHOP, FART, POOP groups occur everywhere, that's when I group prove that hey..maybe this is a systematic problem now.\n\nCity police seem corrupt, sure, a couple of the smaller city/towns,... maybe a village or two... all of them to be shut down? no\n\njustice in policing act could have done so much more, (data collection/reporting), follow up for interactions like ...a survey or followup, did you feel discriminated against, and why, and that gets sent up. \n\nI was disappointed in seeing it.\n\nAnother systematic problem is jesus...term limits and the reaction from congress. Congress hopped/skipped and cartwheeled into that justice act but damn, the heroes act has to wait until august... really? Too much red tape, we literally painted ourselves into a corner.",
      "sentiment": -0.9428
    },
    {
      "id": "fuuvoay",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuuvoay/",
      "user": "DarkJester89",
      "text": "another one would be immigration, i dont think it's wrong, i think CHAZ folks should be renounced citizenship, and wait 6 months before returning to ensure they didn't contract any foreign diseases. \n\nThe immigration system has too much red tape and could do with some overhauls, fuck closing it and rebuilding it.  It needs to be totally built new, from scratch because. Its terrible.",
      "sentiment": -0.3498
    },
    {
      "id": "fuv5vzl",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuv5vzl/",
      "user": "TheeSweeney",
      "text": "&gt;The tax system is, full of loopholes that were purposelly put in place to pocket the rich. The problem is all the problems are legally just, but obviously put in as loopholes.\n\nI 100% agree.\n\n&gt;Systematic problems are... every agency has the same problem, it's systematic, it's a pattern. I don't agree trying to complicit these unknowing bystanders, it seems vengeful, no matter how you try to twist it.\n\nThat's a fair take.\n\n&gt;CHAZ isn't a systematic issue, until the similiar[sic] CHAZ, CHOP, FART, POOP groups occur everywhere, that's when I group prove that hey..maybe this is a systematic problem now.\n\nMaybe it is. I bet there is an argument to be made there.\n\n&gt;justice in policing act could have done so much more, (data collection/reporting), follow up for interactions like ...a survey or followup, did you feel discriminated against, and why, and that gets sent up.\n\n&gt;I was disappointed in seeing it.\n\n\n\nI agree completely.",
      "sentiment": -0.8916
    },
    {
      "id": "fuv5yhb",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/fuv5yhb/",
      "user": "TheeSweeney",
      "text": "&gt;The immigration system has too much red tape and could do with some overhauls, fuck closing it and rebuilding it. It needs to be totally built new, from scratch because. Its terrible.\n\nI completely agree.",
      "sentiment": -0.5868
    },
    {
      "id": "g0y96aa",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/g0y96aa/",
      "user": "kswizzieq1",
      "text": "I know this post is hella old and I just stumbled upon it but omg this cracks me up. \n\nBro everybody knows Rev. Al Sharpton is a piece of shit, even he knows it. [He’s said it himself that he’s an attention seeker.](https://www.google.com/amp/s/www.washingtonpost.com/lifestyle/magazine/al-sharpton-says-hes-not-an-ambulance-chaser-im-the-ambulance/2018/10/08/0417b81a-b059-11e8-a20b-5f4f84429666_story.html%3foutputType=amp) And yeah he’s not very tact when it comes to speaking, but he has consistently been on the side of black Americans even when he- unfortunately- is at the expense of others.\n\nAlso bro these things are so old! It’s been 20 years, some of my beliefs have done 180s in just the past month, I can imagine 20 years will give a bit of reflection. \n\nAl Sharpton will never apologize in public because he’s a narcissist, but that doesn’t mean he holds genuine hate in his heart for certain people. \n\n[Al Sharpton doesn’t really hate Jews. ](https://www.stljewishlight.com/news/world/al-sharpton-gathers-black-leaders-for-meeting-with-ny-rabbi-in-wake-of-monsey-attack/article_a8993ec6-6f89-5ca5-8e0b-cf606d70d827.html) \n\nAnd also while it sucks that Al Sharpton was in the FBI, he said he did it to keep mobs out of his neighborhood,,, now do I believe that? Eh, could be true, it’s probably not, he probably just liked the money and lucrativeness, but whatever.\n\nI’m not trying to defend Al Sharpton, but I am saying sometimes it’s not all or nothing. We’re human that’s just not how it works. What he’s doing right now is objectively good and we can’t change the past so we’re trying to make a better future, no matter who’s in charge.\n\nEDIT: Link.",
      "sentiment": 0.5102
    },
    {
      "id": "gye49e",
      "url": "https://www.reddit.com/r/centrist/comments/gye49e/al_sharpton_announces_new_march_on_washington_led/",
      "user": "DarkJester89",
      "text": "[Source:](https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwi73dvp-u_pAhUej3IEHdyeDvUQ0PADegQIAhAH&amp;url=https%3A%2F%2Fwww.cnn.com%2F2020%2F06%2F04%2Fpolitics%2Fal-sharpton-geroge-floyd-march-on-washington%2Findex.html&amp;usg=AOvVaw084N4tXTT-YoIuQbAx3MQG)\n\nI agree that George Floyd losing his life was a horrible tragedy\n\nI agree that police reform should be administered, starting in the stations that have anomalies separate from the nation, goodness gracious folks... \n\nThey couldn't have picked a WORSE person to lead \"equality/fairness\" protests fighting racism than Al Sharpton.\n\n[\"White folks was in the caves while we was building empires,\"](https://books.google.com/books?id=gSXLSDHXACcC&amp;pg=PA23&amp;lpg=PA23&amp;dq=come+and+tell+you+%E2%80%98Well+my+mother+and+father+blood+go+back+to+the+Mayflower,%E2%80%99+you+better+hold+you+pocket&amp;source=bl&amp;ots=TtwISc7kEx&amp;sig=Qkk2Aihpn-oebeBxRVO-R-oaL1U&amp;hl=en&amp;sa=X&amp;ei=RCk6UrLdN-jIyAH2uoCwBw#v=onepage&amp;q=come%20and%20tell%20you%20%E2%80%98Well%20my%20mother%20and%20father%20blood%20go%20back%20to%20the%20Mayflower%2C%E2%80%99%20you%20better%20hold%20you%20pocket&amp;f=false)\n\n[On one occasion in 1992, he derided moderate black politicians close to the Democratic Party as \"cocktail sip Negroes\" or \"yellow niggers.\"](https://books.google.com/books?id=FrVSDwAAQBAJ&amp;pg=PT86&amp;lpg=PT86&amp;dq=he+derided+moderate+black+politicians+close+to+the+Democratic+Party+as+%22cocktail+sip+Negroes%22&amp;source=bl&amp;ots=mj49IMa5F2&amp;sig=ACfU3U2zvXFwmlg9esIN2qkAFHqS_MLZhw&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwj45Lel_O_pAhWCl3IEHRDJAtQQ6AEwAXoECAwQAQ#v=onepage&amp;q=he%20derided%20moderate%20black%20politicians%20close%20to%20the%20Democratic%20Party%20as%20%22cocktail%20sip%20Negroes%22&amp;f=false)\n\n Sharpton is alleged to have secretly recorded conversations with black activists in the 1980s regarding Joanne Chesimard ([Assata Shakur](https://en.wikipedia.org/wiki/Assata_Shakur)) and other underground black militants.   Veteran activist Ahmed Obafemi told the [*New York Daily News*](https://en.wikipedia.org/wiki/New_York_Daily_News) that he had [long suspected Sharpton of taping him with the bugged briefcase.](https://www.nydailynews.com/new-york/activist-recalls-1983-meeting-sharpton-bugged-briefcase-article-1.1754857)\n\nThere are other remarks as well..\n\nHis actions, both as an activist and in political activities led to a [bill introduced](https://www.congress.gov/bill/106th-congress/house-concurrent-resolution/270/related-bills) against him:\n\nThat the Congress--             \n\n(1) condemns the practices of the Reverend Al Sharpton,  which seek to divide Americans on the basis of race, ethnicity, and religion;             \n\n(2) expresses its outrage over the violence that has resulted due to the Reverend Al Sharpton's incendiary words and actions; and             \n\n(3) fervently urges elected officials and public servants, who have condoned and legitimized the Reverend Al Sharpton's incendiary words and actions, to publicly denounce and condemn          such racist and anti-Semitic views.\n\n&amp;#x200B;\n\nI thought it would end peacefully or constructively, but Al Sharpton leading this, I think it's going to be for the worse.",
      "sentiment": -0.9578
    }
  ],
  "edges": [
    [
      "fta5e0u",
      "gye49e"
    ],
    [
      "ftagvso",
      "gye49e"
    ],
    [
      "ftaindj",
      "gye49e"
    ],
    [
      "ftaip6r",
      "ftagvso"
    ],
    [
      "ftawj1d",
      "gye49e"
    ],
    [
      "ftb359c",
      "ftawj1d"
    ],
    [
      "ftb37j1",
      "ftawj1d"
    ],
    [
      "ftb4gm4",
      "fta5e0u"
    ],
    [
      "ftb4lgk",
      "ftagvso"
    ],
    [
      "ftb4ppx",
      "ftb37j1"
    ],
    [
      "ftb6348",
      "ftb359c"
    ],
    [
      "ftb6a2i",
      "gye49e"
    ],
    [
      "ftb7b0t",
      "ftb6348"
    ],
    [
      "ftb7jd1",
      "gye49e"
    ],
    [
      "ftb7n55",
      "ftb6a2i"
    ],
    [
      "ftb7oqn",
      "ftb7jd1"
    ],
    [
      "ftb8bgm",
      "ftb7n55"
    ],
    [
      "ftb8crd",
      "ftb7oqn"
    ],
    [
      "ftb8ngi",
      "ftb4lgk"
    ],
    [
      "ftb8qk5",
      "ftb8bgm"
    ],
    [
      "ftb9bpv",
      "ftb8qk5"
    ],
    [
      "ftb9kfd",
      "ftb8ngi"
    ],
    [
      "ftb9tx5",
      "ftb8crd"
    ],
    [
      "ftba19t",
      "ftb9bpv"
    ],
    [
      "ftbarln",
      "ftb9tx5"
    ],
    [
      "ftbav1l",
      "ftb4ppx"
    ],
    [
      "ftbaw5h",
      "gye49e"
    ],
    [
      "ftbcopj",
      "ftba19t"
    ],
    [
      "ftbd1vf",
      "ftbarln"
    ],
    [
      "ftbd5du",
      "ftb9kfd"
    ],
    [
      "ftbdoyo",
      "ftb7n55"
    ],
    [
      "ftbeeqm",
      "ftb6a2i"
    ],
    [
      "ftbg8pt",
      "ftb7b0t"
    ],
    [
      "ftbqimg",
      "ftbg8pt"
    ],
    [
      "ftbub6j",
      "ftbcopj"
    ],
    [
      "ftbuo6g",
      "ftbdoyo"
    ],
    [
      "ftbv18t",
      "ftbd1vf"
    ],
    [
      "ftcv42i",
      "gye49e"
    ],
    [
      "ftd7rwz",
      "ftbuo6g"
    ],
    [
      "ftd8qrh",
      "ftbv18t"
    ],
    [
      "ftd93d8",
      "ftbub6j"
    ],
    [
      "fteswzu",
      "ftd93d8"
    ],
    [
      "fteti7z",
      "ftd8qrh"
    ],
    [
      "ftetuna",
      "ftd7rwz"
    ],
    [
      "fteujq7",
      "ftetuna"
    ],
    [
      "ftevb3m",
      "fteswzu"
    ],
    [
      "ftevryr",
      "fteti7z"
    ],
    [
      "fteysjd",
      "ftevb3m"
    ],
    [
      "fteyuk9",
      "fteujq7"
    ],
    [
      "ftez9jj",
      "ftevryr"
    ],
    [
      "ftf00qa",
      "ftez9jj"
    ],
    [
      "ftf05zb",
      "fteyuk9"
    ],
    [
      "ftgu526",
      "ftf05zb"
    ],
    [
      "ftgun41",
      "ftf00qa"
    ],
    [
      "fth54dr",
      "ftgu526"
    ],
    [
      "fth7p8z",
      "ftgun41"
    ],
    [
      "fth9dmd",
      "fth7p8z"
    ],
    [
      "fth9lis",
      "fth54dr"
    ],
    [
      "fthfhg9",
      "fth9dmd"
    ],
    [
      "fthfv29",
      "fth9lis"
    ],
    [
      "ftii8p4",
      "fthfv29"
    ],
    [
      "ftiiwrw",
      "fthfhg9"
    ],
    [
      "ftil397",
      "ftii8p4"
    ],
    [
      "ftilfbk",
      "ftiiwrw"
    ],
    [
      "ftim69b",
      "ftiiwrw"
    ],
    [
      "ftjccvf",
      "ftim69b"
    ],
    [
      "ftjckfh",
      "ftilfbk"
    ],
    [
      "ftjcp6f",
      "ftil397"
    ],
    [
      "ftjgdgy",
      "ftjccvf"
    ],
    [
      "ftjgqmo",
      "ftjckfh"
    ],
    [
      "ftjh7y0",
      "ftjcp6f"
    ],
    [
      "ftkvacl",
      "ftjgqmo"
    ],
    [
      "ftkvfmx",
      "ftjh7y0"
    ],
    [
      "ftkxg09",
      "ftkvfmx"
    ],
    [
      "ftkzb6v",
      "ftkvacl"
    ],
    [
      "ftl12yb",
      "ftkzb6v"
    ],
    [
      "ftn0vdy",
      "ftkzb6v"
    ],
    [
      "ftn0xfl",
      "ftl12yb"
    ],
    [
      "ftn17p8",
      "ftkxg09"
    ],
    [
      "ftn20fi",
      "ftjgdgy"
    ],
    [
      "ftn3juc",
      "ftn17p8"
    ],
    [
      "ftn4mat",
      "ftn0vdy"
    ],
    [
      "ftn4uvh",
      "ftn0xfl"
    ],
    [
      "ftn5pge",
      "ftn20fi"
    ],
    [
      "ftn67by",
      "ftn20fi"
    ],
    [
      "fto8d0t",
      "ftn67by"
    ],
    [
      "fto8ila",
      "ftn5pge"
    ],
    [
      "fto8kal",
      "ftn4uvh"
    ],
    [
      "fto8y3m",
      "ftn4mat"
    ],
    [
      "fto920b",
      "ftn3juc"
    ],
    [
      "ftpbpyc",
      "fto8ila"
    ],
    [
      "ftpbwht",
      "fto8kal"
    ],
    [
      "ftpcnpu",
      "fto8y3m"
    ],
    [
      "ftpcw5z",
      "fto920b"
    ],
    [
      "ftq9szh",
      "ftpcw5z"
    ],
    [
      "ftqapv1",
      "ftpcnpu"
    ],
    [
      "ftqatw3",
      "ftpbwht"
    ],
    [
      "ftqb386",
      "ftpbpyc"
    ],
    [
      "ftqfuur",
      "ftqb386"
    ],
    [
      "ftqfxyc",
      "ftqatw3"
    ],
    [
      "ftqg5cl",
      "ftqapv1"
    ],
    [
      "ftqq7zq",
      "ftqfxyc"
    ],
    [
      "ftqqcqu",
      "ftqg5cl"
    ],
    [
      "ftqqfha",
      "ftqg5cl"
    ],
    [
      "ftqxf7f",
      "ftqq7zq"
    ],
    [
      "ftqxy0t",
      "ftqqcqu"
    ],
    [
      "ftqyf1e",
      "ftqqfha"
    ],
    [
      "ftrmz3p",
      "ftqyf1e"
    ],
    [
      "ftrn64n",
      "ftqxy0t"
    ],
    [
      "ftrn860",
      "ftqxf7f"
    ],
    [
      "fulcqwv",
      "ftrn64n"
    ],
    [
      "fuld0tt",
      "ftrmz3p"
    ],
    [
      "fum2nqn",
      "ftaip6r"
    ],
    [
      "fuobpkq",
      "fuld0tt"
    ],
    [
      "fuobw75",
      "fulcqwv"
    ],
    [
      "fupahez",
      "fuobpkq"
    ],
    [
      "fupay1v",
      "fuobw75"
    ],
    [
      "fupj8t0",
      "fupay1v"
    ],
    [
      "fupk1gs",
      "fupahez"
    ],
    [
      "fupk7yz",
      "fupj8t0"
    ],
    [
      "fupl2tm",
      "fupk7yz"
    ],
    [
      "fupl6sz",
      "fupk1gs"
    ],
    [
      "fuplwp0",
      "fupl2tm"
    ],
    [
      "futoey0",
      "fupl6sz"
    ],
    [
      "futq0r7",
      "fuplwp0"
    ],
    [
      "futrt0e",
      "futq0r7"
    ],
    [
      "futs7fk",
      "futrt0e"
    ],
    [
      "futx76a",
      "futoey0"
    ],
    [
      "futy5b4",
      "futs7fk"
    ],
    [
      "fuun03b",
      "futy5b4"
    ],
    [
      "fuunu10",
      "futx76a"
    ],
    [
      "fuuvdbm",
      "fuunu10"
    ],
    [
      "fuuvoay",
      "fuunu10"
    ],
    [
      "fuv5vzl",
      "fuuvdbm"
    ],
    [
      "fuv5yhb",
      "fuuvoay"
    ],
    [
      "g0y96aa",
      "gye49e"
    ]
  ]
}