{
  "nodes": [
    {
      "id": "gqywvbn",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqywvbn/",
      "user": "EvanElevenRoden",
      "text": "Women make up 51% of the population in the US and control 51% of the wealth. That's not an imbalance.\n\nThe wage gap is a better example of gender imbalance, because it still remains, even after accounting for maternity leave, time taken off, and career choice.\n\nhttps://www.epi.org/publication/what-is-the-gender-pay-gap-and-is-it-real/",
      "sentiment": 0.7096
    },
    {
      "id": "gqyymg8",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqyymg8/",
      "user": "BiggyCheese1998",
      "text": "How can you fix the fact that women are less likely to negotiate contracts and are less likely to ask for a raise?",
      "sentiment": 0.0
    },
    {
      "id": "gqz1z2l",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz1z2l/",
      "user": "Alargeteste",
      "text": "Why assume that a difference has to be \"fixed\"?",
      "sentiment": 0.0
    },
    {
      "id": "gqz2pys",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz2pys/",
      "user": "Alargeteste",
      "text": "&gt;it still remains\n\nIt's a difference, not a gap. There is no reason for arbitrary groups (such as sex or race) of people to make the same income, or control the same wealth, whether in aggregate, or per capita.\n\n&gt;That's not an imbalance. \n\nI never claimed it's an \"imbalance\". I said that it's *not* a gap.\n\n&gt;even after accounting for maternity leave, time taken off, and career choice. \n\nThat's not how this works. You don't start with a total, then pick variables that you can measure, and then say that, when you fail to account for the difference between totals, there's a problem.\n\nDifference in outcomes between arbitrary groups are not evidence of a problem or systemic disproportionate discrimination between those groups.\n\nWhat is an \"imbalance\" is that women control more wealth than they earn. According to you, women control exactly the share of wealth proportional to their fraction of the population. Yet, also according to you, women receive only 80% as much income as their fraction of the population \"deserves\" (I disagree with this deserving-ness. It's not a gap, just a difference.) But, if we take both of your ideas, and combine them, we see that women control \\~51% of the wealth after earning just 40% of the income. I would much rather control 1.275% of the wealth per 1% of the income I earn (women) vs controlling .82% of the wealth per 1% of the income I earn (men). Wealth is all that matters (economically). Income is just the primary way to increase wealth. I would rather increase wealth without any income than have a huge income and while not increasing wealth, just like any rational agent.",
      "sentiment": 0.9884
    },
    {
      "id": "gqz4mvv",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz4mvv/",
      "user": "BiggyCheese1998",
      "text": "I should’ve wrote “how can you adjust for..” I don’t think something needs fixing unless there is some underlying systemic oppression. A problem when assessing a gender pay gap is 1. Women are less likely to negotiate pay and 2. Women are less likely to work overtime. They’re several other things that are very difficult to adjust for. If it can be shown that women get paid less for doing the exact same work as men, than that is a problem that needs to be fixed.",
      "sentiment": -0.8399
    },
    {
      "id": "gqz4qy8",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz4qy8/",
      "user": "altaccountsixyaboi",
      "text": "What imbalance? Seems totally and exactly balanced (actually, I'm kinda surprised it matches so well with population, considering the wage gap).",
      "sentiment": 0.5185
    },
    {
      "id": "gqz4tlu",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz4tlu/",
      "user": "EvanElevenRoden",
      "text": "Read the studies to find out!",
      "sentiment": 0.0
    },
    {
      "id": "gqz55u6",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz55u6/",
      "user": "BiggyCheese1998",
      "text": "I have read many and it’s still not obvious. I’m assuming it’s something you’ve read quite a lot about. Any studies that you would recommend?",
      "sentiment": 0.3612
    },
    {
      "id": "gqz5o4g",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz5o4g/",
      "user": "EvanElevenRoden",
      "text": "This is a recent matching study, which you might find helpful, although I did link a study above.\n\nhttps://link.springer.com/article/10.1007/s00148-019-00743-8",
      "sentiment": 0.4215
    },
    {
      "id": "gqz9u21",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqz9u21/",
      "user": "cancerforbodingdog",
      "text": "This article shows that there is no gap between the sexes, so I don't know what you're on about.",
      "sentiment": -0.296
    },
    {
      "id": "gqzagkz",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzagkz/",
      "user": "BiggyCheese1998",
      "text": "I did read the first one. My only problem with the study is it’s failure to address discrimination in a prescriptive way. I’ll read the second one you linked.",
      "sentiment": -0.7184
    },
    {
      "id": "gqzdnao",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzdnao/",
      "user": "Alargeteste",
      "text": "Which article? There is a wealth difference between the sexes (in America): women own more than men.\n\nThere is a large income difference between the sexes (in America): men earn more than women, per capita, and in aggregate.\n\nThere is no *gap* anywhere just because there's a *difference*. A gap implies injustice, and something that *should* be filled. There might or might not be a gender pay *gap*, but a mere gender pay *difference* isn't evidence of it.",
      "sentiment": -0.3919
    },
    {
      "id": "gqzejoh",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzejoh/",
      "user": "cancerforbodingdog",
      "text": "There's no significant difference. The article says women own 51% of the wealth.",
      "sentiment": 0.3834
    },
    {
      "id": "gqzepod",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzepod/",
      "user": "Alargeteste",
      "text": "&gt;imbalance\n\nI said nothing of imbalance. I spoke of gaps and differences. There is nothing to do with balance here.",
      "sentiment": 0.0
    },
    {
      "id": "gqzfcn4",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzfcn4/",
      "user": "Alargeteste",
      "text": "&gt;I should’ve wrote “how can you adjust for..”\n\nBut why adjust for a difference that exists? Why not just let differences exist? Do we need to adjust for the fact that I don't have a billionaire daddy, a 200 IQ, etc? People are not the same, and that's perfectly fine. I expect smarter people to end up wealthier than dumber people. This isn't something that should be \"adjusted for\".\n\n&gt;A problem when assessing a gender pay gap \n\nIt's not a problem. You're begging the question.\n\nThere is no gap.\n\nThere is a difference.\n\nDespite the difference, women control *more* wealth than men!\n\n&gt;They’re several other things that are very difficult to adjust for. \n\nYou don't need to adjust for anything. Arbitrary groups of people can earn different incomes and have different wealths and all kinds of different outcomes! It's totally fine! Remember, you're on the political 'side' that supposedly champions diversity!\n\n&gt;If it can be shown that women get paid less for doing the exact same work as men, than that is a problem that needs to be fixed. \n\nWell, pretty much everyone agrees about this. We outlawed this in the 1960s. We signed a bullshit Equal Pay Act at the end of Obama's term to sucker women into voting for Democrats. Nobody gets paid less for doing the exact same work as anyone else. It doesn't matter if it's men/women or any other arbitrary category: it matters at the individual level. And guess what? If there's even remotely vigorous market competition, anyone who pays people less than they're worth gets fucked by someone even *slightly* less bigoted: I could crush so many industries by just hiring women or blacks or whatever class you think is discriminated against, because my labor cost would be cheaper than the disproportionately male, white, or whatever class you think is discriminated in favor of. Not only would I pay less than my competitors for equal (or superior) output, all the previously discriminated-against labor that would flock to my companies would be getting raises relative to their prior employment arrangements! But, no need to worry about this, since the 60s, you could always sue someone for paying people differently for the same work. I'm pretty sure it doesn't even have to involve sex (it's not gender), race, or any \"protected class\". If you think this is happening with men vs women, go win some massive class-action lawsuits! Hire all the amazing female workers at a discount while simultaneously giving them raises, and crush the competition! Don't write bullshit articles about a pay \"gap\"! Capitalize on it!",
      "sentiment": 0.9891
    },
    {
      "id": "gqzfnre",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzfnre/",
      "user": "Alargeteste",
      "text": "There's a very significant difference. Women earn something like 75%-80% of the income, and essentially all wealth is born from saved/invested income.\n\nIf there weren't a significant difference, women would own something like 40% of the wealth, because women earn something like 40% of the income, and income (minus expenses) is wealth.",
      "sentiment": 0.9485
    },
    {
      "id": "gqzfqoj",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzfqoj/",
      "user": "cancerforbodingdog",
      "text": "&gt; Women earn something like 75%-80% of the income\n\nWhat?",
      "sentiment": 0.3612
    },
    {
      "id": "gqzjsh7",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzjsh7/",
      "user": "cresquin",
      "text": "Perhaps you’ve heard of the “gender pay gap” wherein if you add up all income earned by men and compare it to all income earned by women the women’s total is ~75% of the men’s. \n\nIf the wealth gap were equal, you’d expect the wealth totals to show a similar gap. The missing gap showis that women have a disproportionate amount of wealth given the income gap.",
      "sentiment": 0.7906
    },
    {
      "id": "gqzjsmr",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzjsmr/",
      "user": "altaccountsixyaboi",
      "text": "There's no gap or difference. Women control as much wealth as men.",
      "sentiment": 0.25
    },
    {
      "id": "gqzkaru",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzkaru/",
      "user": "Alargeteste",
      "text": "Women control much more wealth than their share of the national income would lead a rational person to predict/expect.",
      "sentiment": 0.6901
    },
    {
      "id": "gqzkucn",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzkucn/",
      "user": "Alargeteste",
      "text": "&gt; Women earn something like 75%-80% of the income men do \n\nThis is a plain fact. Do you think women (in America) earn 100% the income men do?",
      "sentiment": 0.3612
    },
    {
      "id": "gqzl2c5",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzl2c5/",
      "user": "Alargeteste",
      "text": "None of these differences are gaps. The word gap implies something missing or a difference that should be \"filled\". There is no reason men/women or any arbitrary groups should have perfectly (or even statistically) equal outcomes, so mere observations of differences of outcomes are not gaps, nor are they evidence of gaps. Men and women have different masses, different strengths, different variances in intelligence, different incidences of many diseases, different responses to drugs, and so on. None of these differences are gaps that ought be \"filled\". They're just difference in outcomes between arbitrary groups of people.",
      "sentiment": 0.765
    },
    {
      "id": "gqzmijm",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzmijm/",
      "user": "cancerforbodingdog",
      "text": "Sorry, I misread what you wrote.",
      "sentiment": -0.34
    },
    {
      "id": "gqzn0ga",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzn0ga/",
      "user": "EvanElevenRoden",
      "text": "As someone that spends spends hours every week reading literature on natural science topics, I'd never want to see a prescriptivist recommendation to address anything, in any study. A researcher's job is only to identify something and test it, then offer a reasonable analysis in comparison to the existing literature. Researchers are highly discouraged from offering a solution, unless that solution is also the topic of the study (eg. \"Evaluating the Outcomes of X to address Y\")",
      "sentiment": 0.4376
    },
    {
      "id": "gqzp4cx",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzp4cx/",
      "user": "cresquin",
      "text": "Dude, notice how I wasn’t replying to you? It’s because I agree and was explaining the interesting issue you’ve brought up in more concise language that normies are used to hearing.",
      "sentiment": 0.6369
    },
    {
      "id": "gqzr8m6",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gqzr8m6/",
      "user": "BiggyCheese1998",
      "text": "I read a fair amount of literature as well and you’re correct that prescriptive/normative claims have no place in a study. My problem is with ambiguous topics like discrimination within a work force and it being prescribed to wage discrepancies without any outstanding evidence. It can be a very dangerous game to play that can favor any agenda as it speculates on ambiguity. Ascribing narratives is perfectly reasonable within an opinion piece but not within scientific research. The first link has a section on “what role do “unobservables” like discrimination and productivity play in the wage gap” in which there is much more ambiguity and attempts to prescribe reasoning to the “unexplained portions” of the gender gap. Within that portion they cite a study where the unexplained portion of the gender gap has decreased from 1980 to 1989. What this gap is and how it can be defined is completely subjective with no absolute consensus. There are much more linear things that can be examined regarding the gender pay gap that get us closer to the “truth”. My problem with the paper you first linked is that it toes the line of ambiguity in that section. It does a good job of compiling papers from other researchers but it also speculates on non sequiturs given that there isn’t any concrete descriptive claims made that conform to the overall consensus regarding the gender pay gap.",
      "sentiment": 0.5571
    },
    {
      "id": "gr0hxp3",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gr0hxp3/",
      "user": "SadChoppaHours",
      "text": "but aren't there more women in the country? also, 51% is not really a difference",
      "sentiment": 0.0
    },
    {
      "id": "gr17eaf",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gr17eaf/",
      "user": "madsjchic",
      "text": "What am I reading here. What....flame is being stoked???",
      "sentiment": 0.0
    },
    {
      "id": "gr1az58",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gr1az58/",
      "user": "Alargeteste",
      "text": "&gt;What am I reading here.\n\nThe simple truth.",
      "sentiment": 0.3182
    },
    {
      "id": "gr1b5z2",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gr1b5z2/",
      "user": "Alargeteste",
      "text": "ok. The only interesting difference is that, despite earning \\~40% of the income, women control around 51% of the wealth, while men earn \\~60% of the income, and only control around 49% of the wealth. Income saved/invested is pretty much the only source of wealth.",
      "sentiment": 0.9382
    },
    {
      "id": "gr1nl0k",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gr1nl0k/",
      "user": "SadChoppaHours",
      "text": "ok so what's the point? or is this j speculation?",
      "sentiment": 0.3736
    },
    {
      "id": "gr1qdnx",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gr1qdnx/",
      "user": "Alargeteste",
      "text": "These are facts. Why are you asking if this is \"j speculation\"?",
      "sentiment": 0.0
    },
    {
      "id": "gym560k",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/gym560k/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "h0gi2py",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/h0gi2py/",
      "user": "Kore624",
      "text": "Feminism is countering this phenomena by encouraging women to be more assertive and outspoken in the workplace and change their vocabulary. (Like saying “thanks for waiting” instead of “sorry I’m late”)",
      "sentiment": 0.7096
    },
    {
      "id": "m58eh0",
      "url": "https://www.reddit.com/r/UnpopularFact/comments/m58eh0/when_we_talk_about_gaps_its_interesting_that_the/",
      "user": "Alargeteste",
      "text": "Gap implies something that should be filled. These are just differences, not gaps. Not every arbitrary group should own the same wealth or earn the same income as every other arbitrary group.\n\n[Women control the majority of wealth.](https://www.fa-mag.com/news/women-need-to-lead-in-finances--consultant-says-54850.html) The sexual wealth *difference* (it's not a gap) favors women. Only the income *difference* favors men. Of course, people with an agenda will focus on the wealth difference between white and black households, presumably because it's bigger than the income difference, and focus on the income difference between individual men and women, because it fits the narrative that women are oppressed minorities, when, in reality, they control the majority of wealth, have equal rights to men, and enjoy quite a few privileges, and are the numerical majority, just about everywhere but China.",
      "sentiment": 0.8182
    }
  ],
  "edges": [
    [
      "gqywvbn",
      "m58eh0"
    ],
    [
      "gqyymg8",
      "gqywvbn"
    ],
    [
      "gqz1z2l",
      "gqyymg8"
    ],
    [
      "gqz2pys",
      "gqywvbn"
    ],
    [
      "gqz4mvv",
      "gqz1z2l"
    ],
    [
      "gqz4qy8",
      "m58eh0"
    ],
    [
      "gqz4tlu",
      "gqyymg8"
    ],
    [
      "gqz55u6",
      "gqz4tlu"
    ],
    [
      "gqz5o4g",
      "gqz55u6"
    ],
    [
      "gqz9u21",
      "m58eh0"
    ],
    [
      "gqzagkz",
      "gqz5o4g"
    ],
    [
      "gqzdnao",
      "gqz9u21"
    ],
    [
      "gqzejoh",
      "gqzdnao"
    ],
    [
      "gqzepod",
      "gqz4qy8"
    ],
    [
      "gqzfcn4",
      "gqz4mvv"
    ],
    [
      "gqzfnre",
      "gqzejoh"
    ],
    [
      "gqzfqoj",
      "gqzfnre"
    ],
    [
      "gqzjsh7",
      "gqzfqoj"
    ],
    [
      "gqzjsmr",
      "gqzepod"
    ],
    [
      "gqzkaru",
      "gqzjsmr"
    ],
    [
      "gqzkucn",
      "gqzfqoj"
    ],
    [
      "gqzl2c5",
      "gqzjsh7"
    ],
    [
      "gqzmijm",
      "gqzkucn"
    ],
    [
      "gqzn0ga",
      "gqzagkz"
    ],
    [
      "gqzp4cx",
      "gqzl2c5"
    ],
    [
      "gqzr8m6",
      "gqzn0ga"
    ],
    [
      "gr0hxp3",
      "m58eh0"
    ],
    [
      "gr17eaf",
      "m58eh0"
    ],
    [
      "gr1az58",
      "gr17eaf"
    ],
    [
      "gr1b5z2",
      "gr0hxp3"
    ],
    [
      "gr1nl0k",
      "gr1b5z2"
    ],
    [
      "gr1qdnx",
      "gr1nl0k"
    ],
    [
      "gym560k",
      "gqywvbn"
    ],
    [
      "h0gi2py",
      "gqyymg8"
    ]
  ]
}