{
  "nodes": [
    {
      "id": "gcq0arh",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/gcq0arh/",
      "user": "AutoModerator",
      "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
      "sentiment": -0.6537
    },
    {
      "id": "gcq19np",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/gcq19np/",
      "user": "designateddroner2",
      "text": "As we drag the car out of the ditch (again), we're likely to continue finding just how many things are broken or damaged...and it won't be a short list.",
      "sentiment": -0.6124
    },
    {
      "id": "gcq1tk3",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/gcq1tk3/",
      "user": "LanceBarney",
      "text": "Not just that. The economic wealth gap as a whole. The richest of the rich are seeing historic growth in their wealth at the same time as the working people see a massive decline. This crosses racial lines.",
      "sentiment": 0.9432
    },
    {
      "id": "gcq4rgv",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/gcq4rgv/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "gcq63q1",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/gcq63q1/",
      "user": "yaosio",
      "text": "It's not a challenge for Biden, he believes the working class must be subservient to the oligarchy. The only challenge for Biden is ensuring the working class gets poorer while the oligarchy gets richer, which really isn't a challenge at all.",
      "sentiment": 0.3802
    },
    {
      "id": "gcqe3nx",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/gcqe3nx/",
      "user": "Roger3",
      "text": "This is correct.\n\nPeople will want to disagree, but actions speak louder than words:\n\nAs a Senator/Vice President he co-wrote and co-sponsored the following bills:\n\n* A bill that created mandatory minimums, further impoverishing and immiserating those who lack the wealth to get charges dropped.\n* A bill that applied those mandatory minimums solely to the mere possession of cheaper crack, and not more expensive cocaine, the same drug. Directly targeting Black communities for decimation of their working population and felonizing them, shutting them permanently out of good work\n* a bill that reintroduced the death penalty, overwhelmingly applied to the poor. \n* a bill that introduced *sixty* new death penalty statutes. \n* a bill that made bankruptcy for the poor almost impossible, preventing the communities he destroyed from recovering, even if they somehow overcome the atrociously bigoted felonization. \n* multiple bills destroying Social Security that thankfully never passed. \n* countless bills enriching the wealthy, but never, not once, correcting the productivity/wages disparity that has kept wages flat, to the point that the current median wage is only $33k/y instead of $250k/y as it should be if wages matched productivity gains like they should. \n\nHe targeted Black communities specifically and poor rural communities got caught up in the net with the opium crisis, impoverishing millions more. \n\nBiden is not your friend and he is the architect of the conditions that gave us Trump in the first place.",
      "sentiment": -0.9864
    },
    {
      "id": "jwh0qy",
      "url": "https://www.reddit.com/r/politics/comments/jwh0qy/bidens_big_challenge_a_growing_racial_wealth_gap/",
      "user": "Duke_Nasty",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "gcq0arh",
      "jwh0qy"
    ],
    [
      "gcq19np",
      "jwh0qy"
    ],
    [
      "gcq1tk3",
      "jwh0qy"
    ],
    [
      "gcq4rgv",
      "jwh0qy"
    ],
    [
      "gcq63q1",
      "jwh0qy"
    ],
    [
      "gcqe3nx",
      "gcq63q1"
    ]
  ]
}