{
  "nodes": [
    {
      "id": "gyp76vj",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyp76vj/",
      "user": "NativeMasshole",
      "text": "I was just listening to an NPR report yesterday which was saying the same thing about investing in rail infrastructure, it would grow the economy somewhere around $20b over the lifetime of the project.",
      "sentiment": 0.0
    },
    {
      "id": "gyqayn6",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyqayn6/",
      "user": "Undying4n42k1",
      "text": "These claims always ignore unintended consequences. Until we can figure out why black dads are walking out, there won't be equality.",
      "sentiment": -0.3612
    },
    {
      "id": "gyqlseq",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyqlseq/",
      "user": "pillbinge",
      "text": "Let’s say this is false and it’s actually $50,000,000,000.\n\nWho gives a fuck? Economies have grown for a while now and people are making less. It’s almost tempting to think we shouldn’t grow our economies at all because then maybe people closer to the bottom would do better. Black families’ disparity keeps growing while the company itself is growing.",
      "sentiment": 0.2023
    },
    {
      "id": "gyqtrc5",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyqtrc5/",
      "user": "marcjwrz",
      "text": "Well in this case, the economic growth would actually be low income folks making more money, not just rich people making more.",
      "sentiment": -0.0834
    },
    {
      "id": "gyquymp",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyquymp/",
      "user": "pillbinge",
      "text": "For a bit, little by very little. Then it would leave those communities. Disparity is increasing; the scales are tipped. We know that stability makes an economy stronger already. What something from MSN or any other thing will argue is that more is better but doesn’t really tackle the system as it is.",
      "sentiment": 0.2707
    },
    {
      "id": "gyr9d2l",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyr9d2l/",
      "user": "corinini",
      "text": "They aren't walking out.  A CDC study showed they actually spend more active time with their kids than white fathers.  They are less likely to be married but they are still there for their kids.",
      "sentiment": 0.2492
    },
    {
      "id": "gyshq92",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyshq92/",
      "user": "Undying4n42k1",
      "text": "I have issue with that study, because poor fathers will score higher, due to not being able to afford a nanny or non-working parent. I think the most important duty of a father, especially in the context of potential criminality of the child, is teaching moral lessons, because it takes a logical, non-emotional mind to do it. Mothers aren't naturally as good at that, because their neurons are closer together (meaning their emotions linger longer). Fathers are best suited for this, which makes their involvement in this way more important. Other activities, like bathing and feeding the child, will skew the data in irrelevant ways. You're right to be skeptical of marriage as a measure, but living arrangement is very important; split custody is also split discipline, which is likely bad for the child.",
      "sentiment": -0.2664
    },
    {
      "id": "gytvxnb",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gytvxnb/",
      "user": "corinini",
      "text": "So you are sexist as well as racist.\n\nI think my favorite part of this response is how quickly you moved the goal posts from your first comment where you accused them of walking out on their children's lives.  Now you're saying it doesn't matter whether they stayed in or not because they aren't doing the \"right\" things.  Meanwhile, the study actually controlled for a lot of the things you are discussing, but you wouldn't know that because you prefer to rely on your own made up pseudo-science.",
      "sentiment": -0.1499
    },
    {
      "id": "gyue71d",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyue71d/",
      "user": "Undying4n42k1",
      "text": "False. I'm not racist (never said anything to indicate that), nor sexist (men and women are different to compliment each other, I just didn't mention the positive traits of mothers, because we weren't talking about that), and no goal posts were moved. The data you presented was about the fathers that are present, ignoring the ones that are not (likely because we're not in dispute over those numbers), so the focus shifted.\n\nThe data you presented is implying that present white fathers are more often not as valuable as present black fathers. I explained that the data you presented has too much irrelevancy to show that. What matters is imparted moral wisdom (often through discipline, but I dislike that word, because it implies negativity, which is counterproductive); time spent bathing and feeding children is ancillary. Living arrangement is a more accurate way of determining imparted moral wisdom, because \"time spent\" lumps in split custody. Split custody leads to split discipline, which is often bad.",
      "sentiment": -0.7992
    },
    {
      "id": "gyun1zh",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyun1zh/",
      "user": "corinini",
      "text": "The data I am talking about showed that black parents are physically more present with their children, the exact opposite of \"walking away\" that you initially implied.  That's moving the goal posts.  It did not \"ignore fathers that aren't present\" it literally studied outcomes for who is present and for who isn't present.  Both are in the data set.\n\nYou made up a bunch of shit to invalidate that in a way that requires ignoring the actual findings of the study.  The study specifically mentions unmarried couples cohabitating but you wouldn't know that because you didn't even bother to look at the data before making up a bunch of irrelevant nonsense based on your own prejudicial views about gender and what is and isn't \"important\" to kids - despite the fact that the study also measured outcomes for children and found that these things had meaningful impacts on kid's lived.",
      "sentiment": -0.8141
    },
    {
      "id": "gyutmkx",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyutmkx/",
      "user": "Undying4n42k1",
      "text": "I did look at the data. It's filled with irrelevant measures. However, I did not see the part where it states that it reflected positive outcomes for children. That was not in the data, only stated in text. What's interesting, though, is that they state that no one measure was an indicator of positive outcomes. That's a sign that they missed the mark. These measures are ancillary, as I stated.\n\nThat being said, I apologize for using imprecise language. More black dads are not living with their kids, which you want to claim is not walking out, but it has the same effect, and often the same blame. I'm focused on the effect on children, and who's to blame for it. That ain't bigoted. Caring about black children isn't bigoted. Also, you failed to address how my views are \"prejudicial\" about gender. Statistics are not about prejudging individuals, but they are about judging groups. That's not prejudice, it's just judging.",
      "sentiment": -0.8569
    },
    {
      "id": "gyuw1bb",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyuw1bb/",
      "user": "corinini",
      "text": "You didn't provide a single \"statistic\" just your own personal opinion.  Saying the word \"statistics\" does not mean you have provided them or that they even exist to back up your point.\n\n\"Filled with irrelevant measures\" - I'm sure your personal opinion is more valuable than the CDC... Give me a break.\n\nUnlike you, the CDC provided specific citations for how they come to the conclusion that these things impact children in a positive way.  They didn't just type \"statistics\" and call it a day.",
      "sentiment": 0.8516
    },
    {
      "id": "gyuws4k",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyuws4k/",
      "user": "Undying4n42k1",
      "text": "That's true. I didn't bother citing sources. However, it's not my opinion. I learned this stuff, but I don't care to spoonfeed it to you. You didn't bother linking that CDC study, but I found it anyway. Go look up studies on men and women's brain differences, instead of just insulting me.",
      "sentiment": -0.5817
    },
    {
      "id": "gyuy4ja",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/gyuy4ja/",
      "user": "corinini",
      "text": "There isn't a single academic peer reviewed study that makes the conclusions you make about the benefits of doing different activities with one parent or another based on the brain chemistry of the parent.  Or that mothers aren't as good at teaching morals because of brain chemistry.  You literally pulled that out of your ass.\n\nAnd the CDC cites multiple different Academic reports concluding that these specific measures that they researched do in fact affect outcomes in children.  You claim that they cite irrelevant data that skews the results, but again - no evidence, just your feelings.",
      "sentiment": -0.6063
    },
    {
      "id": "h0qhwpd",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/h0qhwpd/",
      "user": "BerrySundae",
      "text": "Honestly, ignoring every other bullshit claim made here, I would LOVE an explanation as to how to takes a \"logical, non emotional mind\" to teach moral lessons. Morals are not logical. The vast majority of decent morals are based on empathy.\n\nA father can certainly teach those, but not from a place of cold calculation. You're only contributing to the mass male trauma of being told \"you don't have real emotions\".",
      "sentiment": -0.2461
    },
    {
      "id": "h0qlfz8",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/h0qlfz8/",
      "user": "Undying4n42k1",
      "text": "I was mostly talking about the consistency of moral lessons, and being informational. A parent's emotions can get in the way of consistency and informing, leading a child to be confused, and then rebel to test boundaries. I wasn't even thinking about consistent moral lessons derived from empathy, or about empathy, but those can be insufficient, too.\n\nTeaching empathy, alone, can lead to a child that accepts being exploited, if they even accept the lesson, at all.\n\nTeaching with empathy, alone, can lead to the child rejecting moral lessons, because empathy isn't informational, so the child may not recognize the lessons as applicable to the world they see. This leads to an irrational urge to rebel.\n\nEmpathy isn't important at all. What's important is knowing how the world works, and how to get the most out of it. That means being a good person with other good people, but being more self-interested when dealing with antagonistic people. Both are needed for a child to be their best. Benefiting society is spillover.\n\nThe world is objectively a certain way. A parent needs to teach their child how it is, not how they want it to be, or how to behave in such an ideal world.",
      "sentiment": 0.7635
    },
    {
      "id": "h0qotlv",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/h0qotlv/",
      "user": "BerrySundae",
      "text": "What you have just described is actually only adjacent to morality. But let's deal with that.\n\nYour inability to separate showing empathy with being unrealistic and/or \"uninformative\" is telling. Lack of self-respect and practice setting healthy boundaries is what causes exploitation. Those are extremely likely with a child insecurely attached to their parents.\n\nAlso, the world is actually not at all \"a certain way\". That's not how perception fundamentally works. Beyond that, teaching proper empathy *requires* acknowledging that the world is not roses and rainbows. You do not teach someone to have compassion by convincing them everyone is kind and upstanding. You do not teach someone grace in conflict without preparing them for conflicts. You do not teach someone to be humble without acknowledging there are complete assholes in the world. And you do not teach someone to take care of themselves by preparing them to be a walking doormat with no life skills or sense of self-preservation. You do not teach empathy by acting solely off emotion.\n\nIf your ideals involve benefitting yourself first, and others when convenient, then that is what you teach I suppose. Though I could see how that would lead to forgetting what morality means.\n\nBut I got my answer. You're about 50 miles off base with too many things you appear completely confident of your opinion about for me to attempt getting anywhere. I regret that you have had such negative interactions with the women in your life that you've decided they are incapable of being realistic, informative, level-headed, \"logical\", or consistent. Have a nice day.",
      "sentiment": -0.2402
    },
    {
      "id": "h0r8zpx",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/h0r8zpx/",
      "user": "Undying4n42k1",
      "text": "I did not explain morality. I explained how to teach it.\n\nI did not say empathy is necessarily devoid of realism. I said it could be.\n\nWhat I did say was that empathy is unnecessary for teaching morality. You said \"then that is what you teach, I suppose\", which sounds like you're ok with that. I also think your balance of pragmatism and empathy is ok.\n\nHowever, I still don't know if you're consistent in being informative. I've seen too many parents, especially women, use yelling and punishment instead of being informative. No view of morality can be taught that way. The problem was their emotion. That is why lacking emotion is so important for teaching morality.\n\nYou claim morality can be lost without empathy. That could happen. However, people that ditch empathy, even when only performative, don't delude themselves into thinking they are moral. Emotional people, however, do.",
      "sentiment": -0.4086
    },
    {
      "id": "ng3wy1",
      "url": "https://www.reddit.com/r/MassachusettsPolitics/comments/ng3wy1/closing_racial_wealth_gap_could_grow_the/",
      "user": "Votings_Good_Folks",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "gyp76vj",
      "ng3wy1"
    ],
    [
      "gyqayn6",
      "ng3wy1"
    ],
    [
      "gyqlseq",
      "ng3wy1"
    ],
    [
      "gyqtrc5",
      "gyqlseq"
    ],
    [
      "gyquymp",
      "gyqtrc5"
    ],
    [
      "gyr9d2l",
      "gyqayn6"
    ],
    [
      "gyshq92",
      "gyr9d2l"
    ],
    [
      "gytvxnb",
      "gyshq92"
    ],
    [
      "gyue71d",
      "gytvxnb"
    ],
    [
      "gyun1zh",
      "gyue71d"
    ],
    [
      "gyutmkx",
      "gyun1zh"
    ],
    [
      "gyuw1bb",
      "gyutmkx"
    ],
    [
      "gyuws4k",
      "gyuw1bb"
    ],
    [
      "gyuy4ja",
      "gyuws4k"
    ],
    [
      "h0qhwpd",
      "gyshq92"
    ],
    [
      "h0qlfz8",
      "h0qhwpd"
    ],
    [
      "h0qotlv",
      "h0qlfz8"
    ],
    [
      "h0r8zpx",
      "h0qotlv"
    ]
  ]
}