{
  "nodes": [
    {
      "id": "fwfa9se",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfa9se/",
      "user": "caramelfrap",
      "text": "I really really like this idea and wish it got more traction. For those too lazy to read it basically institutes a program where every baby thats born in the US gets a bond that matures when they turn 18 and the amount paid out depends on the parents income through the kids life. \n\nThe problem today is that capital is extremely important in getting your adult life started and many minority children don’t have access to capital from their parents. If you want to go to school, you need capital to pay tuition (loans are just an expensive way of raising capital), if you want to start a small business you need capital to buy assets, if you want to just live on your own in a safe environment and find a job after graduating you need capital to pay your security deposit on an apartment. A lot of young adults are kind of just thrown to the wolves at 18/21, a few grand could go a long long way to help them reach some stability in their life. \n\nObviously there’d need to be protections on the money so the program cant be gutted, and rules so that the money can only be spent on certain things (this is mainly so it can get bipartisan support). Implementation wise I think what would be fair is start giving current rising 18 year olds a small amount (maybe like 500-1000) and slowly sliding it up every year so that in 18 years the program reaches full payment status. I also think that the amount richer kids receive and the amount poorer kids receive should be similar. While its not the most efficient distribution of resources, its the policy that would get the most support from Americans which is extremely important.",
      "sentiment": 0.9839
    },
    {
      "id": "fwfcg08",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfcg08/",
      "user": "diogenesofthemidwest",
      "text": "That's just redistribution of wealth with extra steps.",
      "sentiment": 0.4939
    },
    {
      "id": "fwfdkfp",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfdkfp/",
      "user": "caramelfrap",
      "text": "Every governmental program is a redistribution of wealth/resources in some form or another. A firefighting department is a redistribution of wealth from salaries and wages of one group to another. Arguing the merits of each policy is important. Baby bonds is an investment from one group of people to another to help a generation of Americans succeed in their lives.",
      "sentiment": 0.8625
    },
    {
      "id": "fwfdsfd",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfdsfd/",
      "user": "LaughableChimp",
      "text": "Give 18 year olds a boat load of money on their 18th birthday? I guarantee you most of that money will be gone by the end of the week. If not, certainly by the end of the month.",
      "sentiment": -0.0093
    },
    {
      "id": "fwfeb6t",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfeb6t/",
      "user": "diogenesofthemidwest",
      "text": "Why the bond thing then? At that point, just try and propose cutting kids a check at 18 based on their parents income? \n\nOh yeah, because it's unpalatable without the word baby and the smokescreen of the bond market.",
      "sentiment": 0.264
    },
    {
      "id": "fwfee8h",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfee8h/",
      "user": "caramelfrap",
      "text": "We could institute stipulations on what the money could be spent on. College tuition, housing, grocery, business startup costs. Will there money be spent on stupid things? Yeah probably. But there’s no way any program can be perfectly efficient in its goal. Another solution could be to have the bond mature partially at 18 (maybe 30-40%) and the remaining amount pay out over the next 5 years so it wouldn’t be all spent at once. \n\nRemember, we gave 1200 to every American just a few months ago. Some spent it on dumb stuff but there wasn’t any criticism over how people would spend the money.",
      "sentiment": 0.7227
    },
    {
      "id": "fwfesyq",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfesyq/",
      "user": "caramelfrap",
      "text": "Its a “bond” because the money would be collectively invested to create returns so government doesn’t have to contribute as much year to year. It’d be a government 529 esque program.",
      "sentiment": 0.2732
    },
    {
      "id": "fwfgen4",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfgen4/",
      "user": "LaughableChimp",
      "text": "The problem is that most not some of that money will imo end up be spent on stupid things. This is a naive 18 year old who'd just became an adult with not much responsibilities, I just don't see how we'll get a scenario where the kid just doesn't blow most of that money in celebration of turning into an adult and enjoying some of the benefits that come with that. I could even see this turn into a cultural thing where kids all over the US eagerly wait for their 18th birthday just so that they'll be given a couple grand all to themselves that they could then blow on whatever they want.\n\nSome people even argue that these kids aren't even smart enough to be held liable for life changing decisions they made at that age in regards to university, yet they think these kids are somehow going to be financially responsible enough with this money at the same age?\n\nThe 1200 dollars a few months ago is not even remotely comparable. Millions of people lost their jobs, they had no income and had bills to pay. Most of that money was probably spent responsibly towards paying their bills. \n\nAs for the proposed solutions,\n\nI like the idea that we could restrict what this money is spent on. I may have concerns about whether this can be properly observed and regulated however.\n\nThe bond maturing partially idea I don't see working. The less the money the person gets at one time the more likely he is going to blow it on some stupid stuff rather than invest it responsibly. I think you're actually more likely to spend more of your money responsibly if you get bequeathed a large sum straight away than being given parts of it throughout time. To take an extreme example, are you more likely to invest your money if you're given 5000 in one shot or 500 every year for 10 years? I think the former.",
      "sentiment": -0.5883
    },
    {
      "id": "fwfgluq",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfgluq/",
      "user": "diogenesofthemidwest",
      "text": "Here's an idea, why doesn't the government keep the money, lower the deficit with it? That's the same in the end to the budget as giving a child a treasury bond, except it cuts out all the extra administrative cost. Then they cut them a check at 18.",
      "sentiment": -0.6124
    },
    {
      "id": "fwfk0y7",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfk0y7/",
      "user": "Boronthemoron",
      "text": "At least the stripper and sex worker industry will boom...",
      "sentiment": 0.0
    },
    {
      "id": "fwfkbpo",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfkbpo/",
      "user": "plummbob",
      "text": "Bonds won't fix  [this.](https://opportunityinsights.org/wp-content/uploads/2018/10/atlas_summary.pdf)\n\n&amp;#x200B;\n\n \n\nWhere you grow up is alot more important than a short-term cash injection when you turn 18",
      "sentiment": 0.2716
    },
    {
      "id": "fwfl3la",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfl3la/",
      "user": "zahrul3",
      "text": "&gt; A firefighting department is a redistribution of wealth from salaries and wages of one group to another\n\nI'd argue your first point is sort of right (as in, not wrong) but the point of firefighting being a redistribution of wealth isn't exactly correct, as they provide an essential service that no one would provide, not even with money\n\nEDIT: Read the history of the Great Chicago Fire",
      "sentiment": 0.8035
    },
    {
      "id": "fwfljbo",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfljbo/",
      "user": "zahrul3",
      "text": "&gt; For those too lazy to read it basically institutes a program where every baby thats born in the US gets a bond that matures when they turn 18 and the amount paid out depends on the parents income through the kids life.\n\nSo basically like a \"piggy bank\" that sets aside a certain amount of the parent's income (not much, monthly) for the child's future education (college/trade school/etc.)\n\nI mean, plenty of parents are already doing that sort of thing but unfortunately, there are as many parents who give zero shits about their own children's future despite being able to afford to, in theory",
      "sentiment": -0.7622
    },
    {
      "id": "fwfmwqy",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfmwqy/",
      "user": "Martin_Samuelson",
      "text": "You’re right, it’s just less efficient redistribution. But it might be the only thing that works politically, which of course is another way of saying it might be the only thing that convinces stupid people.",
      "sentiment": -0.4208
    },
    {
      "id": "fwfmwvf",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfmwvf/",
      "user": "intothelist",
      "text": "Well no this money wouldn't come from the parents and therefore not depend on them having an income or existing.",
      "sentiment": -0.0258
    },
    {
      "id": "fwfnaxv",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfnaxv/",
      "user": "Martin_Samuelson",
      "text": "Split it into weekly payments spread out over a few years.",
      "sentiment": 0.0
    },
    {
      "id": "fwfnemt",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfnemt/",
      "user": "Wheream_I",
      "text": "Holy crap what? 44% of black men who grew up in Watts were incarcerated during the 2010 census, but only 6% of black men who grew up in Compton were incarcerated during the 2010 census. And only 4% of Hispanic men who grew up in Watts were incarcerated during the same census. \n\nThat’s... *what the hell*?\n\nDoes this have anything to do with the Watts riots maybe? There weren’t Compton riots.",
      "sentiment": -0.962
    },
    {
      "id": "fwfungp",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfungp/",
      "user": "Mikeavelli",
      "text": "&gt;the amount paid out depends on the parents income through the kids life.\n\nThis is supposed to close the wealth gap?",
      "sentiment": 0.4939
    },
    {
      "id": "fwfw3og",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwfw3og/",
      "user": "caramelfrap",
      "text": "Its supposed to be inversly correlated. IE kids that came from less get more",
      "sentiment": 0.0
    },
    {
      "id": "fwg07vv",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwg07vv/",
      "user": "EarthandEverything",
      "text": "Sounds like a great idea.  What 2% of the federal budget do you plan to cut to pay for this?",
      "sentiment": 0.6249
    },
    {
      "id": "fwg0azn",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwg0azn/",
      "user": "EarthandEverything",
      "text": "Money is fungible.",
      "sentiment": 0.0
    },
    {
      "id": "fwgiff4",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwgiff4/",
      "user": "Meglomaniac",
      "text": "Fatherless households, financial incentives from the welfare trap (let’s go ubi), and a poor culture that doesn’t encourage hard work, education, or a long term outlook.",
      "sentiment": -0.0516
    },
    {
      "id": "fwgtbb7",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwgtbb7/",
      "user": "undeadalex",
      "text": "Well yes. I mean that's literally what capitalism is. Oh you were commenting on this program. Gotcha",
      "sentiment": 0.5859
    },
    {
      "id": "fwh2sl4",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwh2sl4/",
      "user": "beastrabban",
      "text": "I have no idea how this wouldn't be seen as punishment for being wealthy.  I'm all for wealthy people receiving the same treatment as everyone else but I don't think it's a good idea to punish people for having money.\n\nAlso, the statistics in the article are HIGHLY questionable.",
      "sentiment": -0.7422
    },
    {
      "id": "fwh3kfn",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwh3kfn/",
      "user": "noveler7",
      "text": "I swear she just read [my comment yesterday](https://www.reddit.com/r/Economics/comments/hhlxty/fed_reveals_bond_purchases_including_att/fwbspzv/?context=3) and wrote an article.",
      "sentiment": -0.0516
    },
    {
      "id": "fwh3t8v",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwh3t8v/",
      "user": "QueefyConQueso",
      "text": "It’s...a lot more complicated than that.  \n\nThere are nuggets of truth in some of what your saying, but taking them out of context for Twitter level consumption is dangerous.  And why I don’t like Twitter, these issues are complex and deserve long form conversation to come to terms with. \n\nTake for instance your comment on Fatherless house holds.  The US has finally realized that yes, just about every metric available shows children of multi-parent homes enjoy privilege and success above their single parent counterparts in the aggregate (My parents split when I was young and I found success, but it was an uphill battle).\n\nMuch of that angst against that truth had to do with the concept of a “nuclear family” being touted by, and for the consumption of the Christian right and ideals.  This caused a knee jerk reaction from the left who saw it as demonization of single mothers (and make no mistake, the way the conversation was formatted it was just that). \n\nRegardless of the intent of either side of that argument the data, which is what matters, proved that children of single parents (female or male) tend to find it harder to gain traction. \n\nBreak the racial demographics down, and ask why the spikes in single mothers in some minority communities?  \n\nAgain it’s complex, and I can’t do it justice here, but to highlight one aspect of many:  A community is disenfranchised from strong institutions and fair employment.  They engage in sometimes less than legal commerce to make ends meet, and also do not feel they can rely on those institutions for conflict resolution.  So they have to resolve conflicts the old fashioned way.  Your damned self.  This always escalates.\n\nThis brings them in contact with the wrong side of the law, and thus begins another cycle of responses and disenfranchisement.  A lot of fathers either in jail or unemployable and in the extreme, dead. A lot of fatherless households.  Some of this is coming to a head right now! \n\nAll of this is interconnected in complex ways that feed off each other.  Yes a child in a fatherless household is at a disadvantage.  For various reasons.  But you have to ask *why* these spikes occurred in various points in time and places and peoples.  \n\nWhere I break from many is I don’t see it as purely a problem of re-enfranchisement.  Some of the problems were caused by it, but it existed for so long as to create some...less than positive sub-cultural behavior that normalized in certain areas.  \n\nAnd this isn’t “both sides maaaan”.  There are no sides.  That’s just being used as an intellectually regressive bailout so people don’t have to mentally engage in discussion or empathize with people that don’t fit into ideological box someone else built for them.  (Increasingly at least, I have seen the both sides thing abused the other way to be sure).\n\nIt’s understanding, the best you can-people.  You are hard pressed to go to a community and ask a parent to emphasize the value in education when that system has not worked for them for generations.  But you also have to be willing to admit that the children are not getting the extracurricular reenforcement at home (what was the point before really) and do something about it when you do fix that education system, and do it in a way that is respectful and not patronizing as hell.  \n\nI’m probably in a minority in that though.",
      "sentiment": 0.9945
    },
    {
      "id": "fwh4aos",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwh4aos/",
      "user": "curiously_clueless",
      "text": "For those that downvoted this guy and feel he 'did not contribute to the discussion' I'd like to know why.",
      "sentiment": 0.3612
    },
    {
      "id": "fwhbopq",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwhbopq/",
      "user": "Meglomaniac",
      "text": "You wrote a whole lot of words to say fucking nothing of substance. Way to waste my time.",
      "sentiment": -0.4215
    },
    {
      "id": "fwhpe1h",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwhpe1h/",
      "user": "diogenesofthemidwest",
      "text": "Don't you feel the slightest bit of shame advocating public policy on the basis of fooling \"stupid people\"?",
      "sentiment": -0.8481
    },
    {
      "id": "fwi2fpr",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwi2fpr/",
      "user": "Martin_Samuelson",
      "text": "Yes, but it’s better than letting the other side convince the stupid people of their terrible ideas.",
      "sentiment": -0.3716
    },
    {
      "id": "fwrvqcv",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fwrvqcv/",
      "user": "KidsInTheSandbox",
      "text": "&gt; There weren’t Compton riots.\n\nLA riots affected Compton.",
      "sentiment": -0.802
    },
    {
      "id": "fy2vru8",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2vru8/",
      "user": "UCBalum20",
      "text": "They picked one of the best neighborhoods in Compton and used its incarcerations rate. And they used the worst neighborhood in Watts.",
      "sentiment": 0.0258
    },
    {
      "id": "fy2w0mf",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2w0mf/",
      "user": "UCBalum20",
      "text": "Military but also tax Wall Street.",
      "sentiment": 0.0
    },
    {
      "id": "fy2wcp2",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2wcp2/",
      "user": "studdbeefpile",
      "text": "&gt;Military \n\nAh. then I've assumed you're read deeply into what military spending and made a close analysis of what is and isn't important. 2% of federal spending is about 100 billion dollars, or 1/7th of the military budget.  What do you plan to cut?",
      "sentiment": -0.4003
    },
    {
      "id": "fy2y7xt",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2y7xt/",
      "user": "UCBalum20",
      "text": "Would baby bonds be 2% of the federal budget?",
      "sentiment": 0.0
    },
    {
      "id": "fy2yg9p",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2yg9p/",
      "user": "Wheream_I",
      "text": "If they said “In Compton” and “in Watts” I’m sure they looked at the entire city, not just specific neighborhoods",
      "sentiment": 0.3182
    },
    {
      "id": "fy2yxl0",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2yxl0/",
      "user": "studdbeefpile",
      "text": "thanks for letting me know you didn't bother reading the article, because that's the third sentence.",
      "sentiment": 0.6412
    },
    {
      "id": "fy2z2b6",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2z2b6/",
      "user": "UCBalum20",
      "text": "If you look at the map, they zeroed in to a specific neighborhood in watts and in Compton",
      "sentiment": 0.0
    },
    {
      "id": "fy2zin0",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2zin0/",
      "user": "UCBalum20",
      "text": "Actually the military budget is closer to $950 billion. Cut 10% and reallocate it baby bonds.",
      "sentiment": -0.2732
    },
    {
      "id": "fy2zqwi",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy2zqwi/",
      "user": "studdbeefpile",
      "text": "No, the DOD budget is around [700 billion](https://www.americanprogress.org/issues/security/reports/2020/05/06/484620/pentagons-fiscal-year-2021-budget-meets-u-s-national-security-needs/).  But let's pretend that it's not, what 100 billion do you want to cut?",
      "sentiment": -0.4215
    },
    {
      "id": "fy30te3",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy30te3/",
      "user": "UCBalum20",
      "text": "I don’t know. I’m not a budget analyst. I’m sure the professionals can find 10% to cut.",
      "sentiment": 0.0516
    },
    {
      "id": "fy31x7m",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy31x7m/",
      "user": "studdbeefpile",
      "text": "ah.  so in other words, you know absolutely nothing about the military budget or even how big it is, but are sure they have 100 billion dollars they don't need.  \n\nWell who can argue with that sort of absolute ignorance?",
      "sentiment": -0.7236
    },
    {
      "id": "fy32rjn",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy32rjn/",
      "user": "UCBalum20",
      "text": "The true ignorance is you believing they need all the nearly 1 trillion dollars  budget",
      "sentiment": 0.0772
    },
    {
      "id": "fy33r20",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/fy33r20/",
      "user": "studdbeefpile",
      "text": "by that logic, we should slash social security and medicare/caid.  their budgets are even larger!",
      "sentiment": 0.1511
    },
    {
      "id": "hibs7v",
      "url": "https://www.reddit.com/r/Economics/comments/hibs7v/a_cheap_raceneutral_way_to_close_the_racial/",
      "user": "Naurgul",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "fwfa9se",
      "hibs7v"
    ],
    [
      "fwfcg08",
      "hibs7v"
    ],
    [
      "fwfdkfp",
      "fwfcg08"
    ],
    [
      "fwfdsfd",
      "fwfa9se"
    ],
    [
      "fwfeb6t",
      "fwfdkfp"
    ],
    [
      "fwfee8h",
      "fwfdsfd"
    ],
    [
      "fwfesyq",
      "fwfeb6t"
    ],
    [
      "fwfgen4",
      "fwfee8h"
    ],
    [
      "fwfgluq",
      "fwfesyq"
    ],
    [
      "fwfk0y7",
      "fwfgen4"
    ],
    [
      "fwfkbpo",
      "hibs7v"
    ],
    [
      "fwfl3la",
      "fwfdkfp"
    ],
    [
      "fwfljbo",
      "fwfa9se"
    ],
    [
      "fwfmwqy",
      "fwfgluq"
    ],
    [
      "fwfmwvf",
      "fwfljbo"
    ],
    [
      "fwfnaxv",
      "fwfdsfd"
    ],
    [
      "fwfnemt",
      "fwfkbpo"
    ],
    [
      "fwfungp",
      "fwfa9se"
    ],
    [
      "fwfw3og",
      "fwfungp"
    ],
    [
      "fwg07vv",
      "hibs7v"
    ],
    [
      "fwg0azn",
      "fwfee8h"
    ],
    [
      "fwgiff4",
      "fwfkbpo"
    ],
    [
      "fwgtbb7",
      "fwfcg08"
    ],
    [
      "fwh2sl4",
      "hibs7v"
    ],
    [
      "fwh3kfn",
      "fwfa9se"
    ],
    [
      "fwh3t8v",
      "fwgiff4"
    ],
    [
      "fwh4aos",
      "fwfa9se"
    ],
    [
      "fwhbopq",
      "fwh3t8v"
    ],
    [
      "fwhpe1h",
      "fwfmwqy"
    ],
    [
      "fwi2fpr",
      "fwhpe1h"
    ],
    [
      "fwrvqcv",
      "fwfnemt"
    ],
    [
      "fy2vru8",
      "fwfnemt"
    ],
    [
      "fy2w0mf",
      "fwg07vv"
    ],
    [
      "fy2wcp2",
      "fy2w0mf"
    ],
    [
      "fy2y7xt",
      "fy2wcp2"
    ],
    [
      "fy2yg9p",
      "fy2vru8"
    ],
    [
      "fy2yxl0",
      "fy2y7xt"
    ],
    [
      "fy2z2b6",
      "fy2yg9p"
    ],
    [
      "fy2zin0",
      "fy2yxl0"
    ],
    [
      "fy2zqwi",
      "fy2zin0"
    ],
    [
      "fy30te3",
      "fy2zqwi"
    ],
    [
      "fy31x7m",
      "fy30te3"
    ],
    [
      "fy32rjn",
      "fy31x7m"
    ],
    [
      "fy33r20",
      "fy32rjn"
    ]
  ]
}