{
  "nodes": [
    {
      "id": "g2osuuu",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2osuuu/",
      "user": "MyFriend_BobSacamano",
      "text": "Sometimes things done with the best intentions create terrible results",
      "sentiment": 0.4939
    },
    {
      "id": "g2ot0bd",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ot0bd/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2ovybr",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ovybr/",
      "user": "KerPop42",
      "text": "Sometimes good intentions today are poisoned by bad intentions in the system they use :(",
      "sentiment": -0.7717
    },
    {
      "id": "g2oyxq1",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2oyxq1/",
      "user": "eliminating_coasts",
      "text": "Are they able to estimate what portion of the wealth gap is due to this era/set of policies?",
      "sentiment": 0.4939
    },
    {
      "id": "g2ozkuy",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ozkuy/",
      "user": "orbital667",
      "text": "I’m so tired of this disingenuous take.  If ideologues didn’t make it their life goal to undermine well intentioned programs by twisting them with hatred then those outcomes would be less.  It wasn’t an unintended outcome, this outcome was intended by a group of people hell bent on proving a point.",
      "sentiment": -0.92
    },
    {
      "id": "g2ozwr2",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ozwr2/",
      "user": "KerPop42",
      "text": "Yeah, you’re right that the US government in the 1950s was probably not free from racism.\n\nWhat I more meant to say was that even a program with good intentions can’t avoid harming disadvantaged groups if it uses a structure put in place with the intention to harm those groups",
      "sentiment": -0.7437
    },
    {
      "id": "g2p0kbh",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2p0kbh/",
      "user": "orbital667",
      "text": "Agreed.",
      "sentiment": 0.2732
    },
    {
      "id": "g2p849q",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2p849q/",
      "user": "beareatingblueberry",
      "text": "It wasn’t done with the best intentions, or by accident. Segregation was built into the new deal, because otherwise it couldn’t have passed the more or less openly racist US congress.",
      "sentiment": -0.3862
    },
    {
      "id": "g2p8a1t",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2p8a1t/",
      "user": "beareatingblueberry",
      "text": "It wasn’t done with the best of intentions. Segregation wasn’t built into new deal programs by accident, that was part of the plan and the political strategy for getting it passed.",
      "sentiment": 0.2732
    },
    {
      "id": "g2p8l5s",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2p8l5s/",
      "user": "1CEninja",
      "text": "The new deal had a TON of unforseen consequences. It was a very \"this depression is bad, let's try some stuff to fix it\" sort of move.\n\nA lot of government bloat was created during that time period unfortunately.",
      "sentiment": -0.8632
    },
    {
      "id": "g2pdan0",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pdan0/",
      "user": "lost_in_life_34",
      "text": "so they should have kept things where you had a small percentage of property owners and most people being perpetual renters?",
      "sentiment": 0.0
    },
    {
      "id": "g2pdno5",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pdno5/",
      "user": "lost_in_life_34",
      "text": "I'm all for equality and the choice of people to buy homes where they want, but the fact is many people WANT to buy homes in places where others of similar background live. it's not even about race, many places with immigrant populations you have white people wanting to live around other white people with similar backgrounds",
      "sentiment": 0.4018
    },
    {
      "id": "g2ph3oq",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ph3oq/",
      "user": "dantheman91",
      "text": "Since redlining was stopped, have they seen this gap close? This is certainly bad, but just one of many bad things that's happened. I'm curious how much impact this has long term, compared to other things, such as the overwhelming single parent households etc.",
      "sentiment": -0.5859
    },
    {
      "id": "g2pik6h",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pik6h/",
      "user": "hatorad3",
      "text": "But that was an effect of an existing culture of racism, not the policy itself.  There was no section in the HOLC definition that said “except for black people”.  It was perversion of the spirit of these programs at the point of implementation that resulted in ghettoization of black people in the US.",
      "sentiment": -0.8847
    },
    {
      "id": "g2pl5v3",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pl5v3/",
      "user": "forrest38",
      "text": "Yes, but when the Civil Rights Act made this kind of de-facto segregation illegal, the funding for these programs were pulled. White flight was encouraged and the localization of tax dollars ensured that money did not from flow the White communities to Black communities.\n\nThere are plenty of people who claim that the modern day racial wealth gap is not at all a result of direct policy meant to keep it as wide as possible. Only direct policy (e.g. the estate tax, health care, Federal Civil Rights investigations) can narrow it.",
      "sentiment": 0.8316
    },
    {
      "id": "g2psjih",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2psjih/",
      "user": "Flaeor",
      "text": "Please tell me when redlining stopped.",
      "sentiment": 0.1027
    },
    {
      "id": "g2ptr5p",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ptr5p/",
      "user": "Goobadin",
      "text": "1968 with the Fair Housing Act",
      "sentiment": 0.3182
    },
    {
      "id": "g2pvllc",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pvllc/",
      "user": "Tyrant_King",
      "text": "No. The impacts are still felt today. \n\n\nhttps://www.washingtonpost.com/news/wonk/wp/2018/03/28/redlining-was-banned-50-years-ago-its-still-hurting-minorities-today/",
      "sentiment": 0.0
    },
    {
      "id": "g2pwe8j",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pwe8j/",
      "user": "Goobadin",
      "text": "No. This paper merely shows that cities where The Home Owners Loan Corporation made appraisals, had and have, more racially segregated areas.\n\nWhile these appraisals probably contributed to a wealth gap; it is also important to note: they were created because of *an existing wealth gap*. Poor neighborhoods were poor neighborhoods before the maps were published. These neighborhoods were redlined because they were already in bad shape -- they stayed that way in part because of the policies -- and any attempt to fix them is decried as gentrification.",
      "sentiment": -0.128
    },
    {
      "id": "g2pwl13",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pwl13/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2pxa2h",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pxa2h/",
      "user": "obiwantakobi",
      "text": "In other words, on top of government institutional racism, POC have faced private economic and social racism as well.",
      "sentiment": -0.743
    },
    {
      "id": "g2pzmvs",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2pzmvs/",
      "user": "rczhang",
      "text": "Extreme oversimplification when continued credit discrimination led to passing the CRA in 1977. Further, consider that even when things are illegal, they still happen.",
      "sentiment": -0.1298
    },
    {
      "id": "g2qhjm7",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qhjm7/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2qifxi",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qifxi/",
      "user": "xxsolojxx",
      "text": "Means there are other reasons for the outcome but shhhhh, that doesn't fit the narrative. White man bad.",
      "sentiment": -0.8134
    },
    {
      "id": "g2qijov",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qijov/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2qkrcj",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qkrcj/",
      "user": "Naggins",
      "text": "That's because the attempts to \"fix\" them often aren't attempts to solve problems in the areas for its residents. The attempts to \"fix\" them often involve inviting private capital and equity into neighbourhoods, sale and demolition of social housing projects for buy-to-let housing units and shopping centres, and are driven by people more interested in wringing more money out of the area code than the well being of its residents.",
      "sentiment": 0.4768
    },
    {
      "id": "g2ql1d0",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ql1d0/",
      "user": "Naggins",
      "text": "You accelerate a car over the crest of a hill, take your foot off the gas, and the car keeps accelerating downhill and you crash into a tree. \n\nTry telling your insurance provider \"it was the hill's fault\".",
      "sentiment": -0.6597
    },
    {
      "id": "g2qlvmc",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qlvmc/",
      "user": "Jolly-Syrup4644",
      "text": "What has this analogy got to do with the price of milk ?",
      "sentiment": 0.0
    },
    {
      "id": "g2qrkqo",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qrkqo/",
      "user": "Goobadin",
      "text": "So again -- these areas are sorely under-developed, offer few jobs, and have decaying housing stock suppress home prices. But, any outside money attempting to revitalize is evil? So how do you increase the economic outlook of a neighborhood without outside investment?\n\nThe common argument in America against it all:\n\n&gt;\" \\[...\\] while gentrification naturally brings some improvements to a city, including more people and money, *it also frequently kills some cultural traditions and diversity, the precise characteristics that make cities so dynamic and desirable in  the first place. \"*\n\nThe whole thought process is this:  the FHA policy for redlining starting in the 1930's made these neighborhoods poor by causing all the white people to leave -- this segregation led to underdeveloped areas with low property values, leading to poor school districts, leading to poor economic outcomes, leading to higher levels of crime... etc etc. (repeat until today)....\n\nBut if you desegregate those communities by encouraging white people to move back, increasing property values, leading to better schools, better economic conditions, and less crime as a result (... undoing the downward cycle) . It's bad? Because it's not solely a black community anymore?\n\n&amp;#x200B;\n\nYou can't have a neighborhood where EVERYONE is poor, and expect it to get better. Money has to come into the community.",
      "sentiment": -0.9453
    },
    {
      "id": "g2qsoo0",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qsoo0/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2qw8dp",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2qw8dp/",
      "user": "Naggins",
      "text": "It's quite clear that you don't understand gentrification as a process. \n\nFirst, gentrification and desegregation are different things. This should be blatantly obvious to anyone who isn't carelessly conflating class and ethnicity. \n\nSecond, investment can come from publically funded initiatives aimed at improving facilities and services available to communities, and empowering and enabling members of those communities to play a part in the social and economic improvement and maintenance of their community. Property speculation is not he only means of \"enriching\" an area. \n\nThird, you seem to be more concerned with improving an area code than a community. A community is comprised of its members, not hectares of land. You are describing essentially an increase in land and property value. That does not benefit the residents of poorer communities which are already disproportionately more likely to be renters. It benefits property speculators, generally individuals and pension funds that are not members of the communities. \n\nFourth, you seem to think that gentrification just stops at some reasonable point where it's *just* desegregated enough, rather than continuing to drive working class people of all ethnicities out of the area, generally into increasingly underserviced and socioeconomically deprived geographic areas. \n\nIt's hardly an era defining economic treatise, but How To Kill a City is an interesting beginner's level description of what gentrification is, how it works, and who it benefits. I think you'd benefit a lot from reading it.",
      "sentiment": 0.8644
    },
    {
      "id": "g2r2tlw",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2r2tlw/",
      "user": "Goobadin",
      "text": "My quote, earlier, was taken from an article summarizing Moskowitz's argument in his book. Further,\n\n&gt; Believing that hipsters can *reverse the consequences of late-stage  capitalism* is a more attractive thought for city planners in  cash-strapped cities than realizing that many American cities are, for  now, screwed thanks to postindustrial decline and growing inequality.  Gentrification may provide a new tax base, but it also reshapes what  cities are, turning them into explicit supporters of inequality, reliant  on it to self-fund, yet still unable to meet the needs of their poor. A  real solution to the economics of American cities would require *more  work—more taxes, more laws, more intervention from the federal  government.* \n\nAh yes.... more of the social programs and laws and government intervention that caused the problem in the first place then?? Of course -- socialist create problems with government, then want to solve that problem with government while blaming capitalism. Par for the course.\n\nPerhaps you should note of the title of the post -- note it's context in American politics and the claims of contribution to the racial wealth gap. Because in America, class and race have a funny way of overlapping.\n\nIn America, schools are funded by districts, typically aligning with each Zip Code. These districts are funded by .... *property taxes*. So, increasing property taxes within a zip code directly improves the educational opportunities for the members of that community, which in turn is directly tied to the economic opportunities for the members of that community. With better schools and more jobs in the neighborhood, crime rates go down -- leading to further enrichment of the community.\n\nThe reality is, the American poor would be better off distributed across the country in communities that *could* support their needs; *Communities with proportional class representation.* \n\nBut it's better for democrats to keep them concentrated in decaying urban centers so they can guarantee seats in congress. And so, select neighborhoods continue to languish and and the members of that community are under-served and destined to perpetual generational poverty.",
      "sentiment": 0.9513
    },
    {
      "id": "g2rl1de",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2rl1de/",
      "user": "DivineIntent",
      "text": "But if you increase land value in the area code that is comprised of mostly renters, the rent goes up and they move to the next place they can afford to live... \n\nSo their kids will once again be tied to those lower property taxes related to their new zip code. Nothing changes?",
      "sentiment": 0.5023
    },
    {
      "id": "g2rmlzf",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2rmlzf/",
      "user": "aronovich7",
      "text": "If they passed credit discrimination how is it still possible on some major lending companies they ask for racial background? Is this for lending records to improve the discrimination or a continuation of the inherent segregation due to policies in the past?",
      "sentiment": 0.7059
    },
    {
      "id": "g2rv8lh",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2rv8lh/",
      "user": "Has_P",
      "text": "How did you just casually mention the nationwide relocation of tens of thousands of poor people as if that is in any way easier than alternatives proposed? That is clearly much harder/more expensive than creating programs/initiatives in the poor areas. \n\nPerhaps the Democrats have left many poor people in urban areas because it’s not easy to move people around? Yeah obviously poor people should ideally be located in an area with proportional class representation but the means to get there is extremely challenging and mulifaceted.",
      "sentiment": 0.2492
    },
    {
      "id": "g2rvj6p",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2rvj6p/",
      "user": "Naggins",
      "text": "&gt;more of the social programs and laws and government intervention that caused the problem in the first place then??\n\nAh yes, the famous pro-social programs of slavery, and the Atlanta compromise, and Jim Crow. \n\n&gt;socialist create problems with government\n\nAnd which socialist on the long, long list of socialists in government in the famously socialist United States of America was this?\n\n&gt;class and race have a funny way of overlapping.\n\nOf course they do. That doesn't mean gentrification and desegregation can conflated as the same process. \n\n&gt;In America, schools are funded by districts, typically aligning with each Zip Code. These districts are funded by .... *property taxes*.\n\nOr, and here me our here...they could just not do that and have a more equitable distribution of funding for schools. \n\n&gt;The reality is, the American poor would be better off distributed across the country in communities that *could* support their needs; *Communities with proportional class representation.* \n\nI fully agree. I disagree that gentrification would allow them proportionate space within a given area, rather than being driven out of their communities and into even worse ones with even lower property taxes and even lower rents. At least until the venture capitalists and property speculators start eyeing those neighbourhoods up too. \n\n&gt;But it's better for democrats to keep them concentrated in decaying urban centers so they can guarantee seats in congress. And so, select neighborhoods continue to languish and and the members of that community are under-served and destined to perpetual generational poverty.\n\nMmkay. \n\nI do not value your opinion that free market neo liberalism will be the suddenly become solution to racial economic inequality after centuries of exacerbating it. And I do not value your opinion that social programmes, because they were often done clumsily and unable to surmount those inequalities, are in fact the causes of those inequalities. \n\nI think you're exhibiting a combination of naivete and magical thinking that is typical of ideologues and particularly of those of libertarian stripes, which is not amenable to scientific thinking.",
      "sentiment": -0.4251
    },
    {
      "id": "g2sffe4",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2sffe4/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2ss3q3",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2ss3q3/",
      "user": "Goobadin",
      "text": "The means to get there is to allow the continual and ongoing redevelopment of neighborhoods. Buildings, roads, communities -- all have a natural life-cycle; it's an on going process which on the large scale sees development \"round-robin\" within a geographic area. Communities grow, stabilize, decline, and then are renewed to restart the process. \n\nRedlining stopped this process for certain neighborhoods. It's time to let it start again.",
      "sentiment": 0.5574
    },
    {
      "id": "g2stgws",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2stgws/",
      "user": "Goobadin",
      "text": "No. \n\nA 2019 NYU study showed \"no evidence of elevated rates of mobility for kids who are born into gentrifying neighborhoods\".\n\nAnother by the Philly Fed and University of Chicago, showed:\n\n&gt;**There are very small differences in out-migration rates between  gentrifying neighborhoods and otherwise similar neighborhoods that don’t  gentrify**. Over ten years, we would expect about 60 percent of less  educated renters to move out of non-gentrifying low income  neighborhoods, compared to about 66 percent of less educated renters in  gentrifying neighborhoods.  \n&gt;  \n&gt;Those who leave gentrifying neighborhoods do not end up moving to  destination neighborhoods that are measurably worse than the destination  neighborhoods of households moving out of poor but not gentrifying  neighborhoods  \n&gt;  \n&gt;**The demographic composition of gentrifying neighborhoods,  post-gentrification, remains highly mixed, with many less educated  renters and homeowners**  \n&gt;  \n&gt;**Less educated renters that remain in gentrifying neighborhood don’t  see significant increases in rents:**  There’s no appreciable difference  in rent increases between less educated living in gentrifying and  non-gentrifying neighborhoods  \n&gt;  \n&gt;**Demographic changes in gentrifying neighborhoods are those that are  generally associated with better outcomes for low income children**  growing up in these neighborhoods.  \n&gt;  \n&gt;**Poor neighborhoods that don’t gentrify, don’t state the same, they  decline:  non-gentrifying neighborhoods lose population and experience  declining incomes.**  \n&gt;  \n&gt;Many existing studies of gentrifying neighborhoods that don’t  account for high levels of migration even in non-gentrifying  neighborhoods, that don’t disaggregate effects by socioeconomic status,  and that rely primarily on median rent statistics can produce misleading  pictures of neighborhood change.",
      "sentiment": -0.8481
    },
    {
      "id": "g2sxmws",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2sxmws/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2tb5nu",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2tb5nu/",
      "user": "Goobadin",
      "text": "Don't conflate the American Socialist's inability to obtain the majority requisite for governing, and their ability to influence policy.\n\nIt is, the same political party in the States that fought for slavery, implemented the policies leading to redlining, and now fights to stop the redevelopment of predominately black communities.\n\nRedlining promptly resulted in disruption of normal neighborhood life-cycles and prevented development in these poorer communities.\n\nI'm not stating that gentrification and desegregation are the same process, but that in America, poverty trends can be traced along racial lines; There is an overwhelming relationship between poverty and race in the US.\n\nWith the affect redlining had on neighborhood development, those neighborhoods account for a vast % of impoverished blacks in America -- and score worst on the diversity index -- they are segregated communities. For these communities, in America, gentrification *is* a question of desegregation.\n\n&amp;#x200B;\n\n&gt;*\\[...\\] it also frequently kills some cultural traditions and diversity, the precise characteristics that make cities so dynamic and desirable in the first place.*\n\n&amp;#x200B;\n\n&gt;*Gentrification may provide a new tax base, but it also reshapes what   cities are, turning them into explicit supporters of inequality, reliant   on it to self-fund, yet still unable to meet the needs of their poor.*\n\nNotice a key tenet Merkowitz's argument: killing cultural traditions and diversity, reshaping the cities...\n\nThese neighborhoods are NOT diverse, they have some of the worst diversity index scores; He simply means it ceases to be a black enclave -- too many white people.\n\nYou assert that gentrification drives out the old residents of a neighborhood -- same argument in a sense, but not focused on race. You also assert it drives up rent costs (which you deem to be a major factor in driving people out).\n\nFor your fears on gentrification:\n\n[https://www.philadelphiafed.org/-/media/research-and-data/publications/working-papers/2019/wp19-30.pdf](https://www.philadelphiafed.org/-/media/research-and-data/publications/working-papers/2019/wp19-30.pdf)\n\nRent increases for gentrifying neighborhoods increase at a slower rate than non gentrifying. Further, an NYU study also corroborates: \"Gentrification\" of an area doesn't drive residents out of their neighborhoods any faster than what happens in non-gentrifying neighborhoods.\n\nIn reality, the oppositions you and Merkowitz levy aren't based in fact.\n\n&gt;I think you're exhibiting a combination of naivete and magical thinking  that is typical of ideologues and particularly of those of libertarian  stripes, which is not amenable to scientific thinking.\n\nMy \"magic\" thinking, is what actually happened everywhere else. Communities grew, stabilized, declined, and were renewed to start the process over -- all driven by market forces. The only place that broke down? Where the government initiated red-lining.\n\nI truly do appreciate you citing a book predicated on ideology with no factual basis, ignoring the last 80 years of history, and then referring to my \"magic thinking\".",
      "sentiment": -0.9922
    },
    {
      "id": "g2tzkcp",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2tzkcp/",
      "user": "bilberberbers",
      "text": "Most of the homes that were built are still in existence and in possession of the lineage to which they were segregationally given today. Its not a thing that \"happened\", its objectively a thing that is happening.",
      "sentiment": 0.0
    },
    {
      "id": "g2u6lie",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/g2u6lie/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "ifotnt",
      "url": "https://www.reddit.com/r/science/comments/ifotnt/new_dealera_programs_to_boost_home_ownership/",
      "user": "smurfyjenkins",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "g2osuuu",
      "ifotnt"
    ],
    [
      "g2ot0bd",
      "ifotnt"
    ],
    [
      "g2ovybr",
      "g2osuuu"
    ],
    [
      "g2oyxq1",
      "ifotnt"
    ],
    [
      "g2ozkuy",
      "g2ovybr"
    ],
    [
      "g2ozwr2",
      "g2ozkuy"
    ],
    [
      "g2p0kbh",
      "g2ozwr2"
    ],
    [
      "g2p849q",
      "g2osuuu"
    ],
    [
      "g2p8a1t",
      "g2osuuu"
    ],
    [
      "g2p8l5s",
      "g2osuuu"
    ],
    [
      "g2pdan0",
      "g2osuuu"
    ],
    [
      "g2pdno5",
      "ifotnt"
    ],
    [
      "g2ph3oq",
      "ifotnt"
    ],
    [
      "g2pik6h",
      "g2ot0bd"
    ],
    [
      "g2pl5v3",
      "g2pik6h"
    ],
    [
      "g2psjih",
      "g2ph3oq"
    ],
    [
      "g2ptr5p",
      "g2psjih"
    ],
    [
      "g2pvllc",
      "g2ph3oq"
    ],
    [
      "g2pwe8j",
      "g2oyxq1"
    ],
    [
      "g2pwl13",
      "ifotnt"
    ],
    [
      "g2pxa2h",
      "ifotnt"
    ],
    [
      "g2pzmvs",
      "g2ptr5p"
    ],
    [
      "g2qhjm7",
      "g2pvllc"
    ],
    [
      "g2qifxi",
      "g2qhjm7"
    ],
    [
      "g2qijov",
      "g2pdno5"
    ],
    [
      "g2qkrcj",
      "g2pwe8j"
    ],
    [
      "g2ql1d0",
      "g2qhjm7"
    ],
    [
      "g2qlvmc",
      "g2ql1d0"
    ],
    [
      "g2qrkqo",
      "g2qkrcj"
    ],
    [
      "g2qsoo0",
      "g2qlvmc"
    ],
    [
      "g2qw8dp",
      "g2qrkqo"
    ],
    [
      "g2r2tlw",
      "g2qw8dp"
    ],
    [
      "g2rl1de",
      "g2r2tlw"
    ],
    [
      "g2rmlzf",
      "g2pzmvs"
    ],
    [
      "g2rv8lh",
      "g2r2tlw"
    ],
    [
      "g2rvj6p",
      "g2r2tlw"
    ],
    [
      "g2sffe4",
      "g2pxa2h"
    ],
    [
      "g2ss3q3",
      "g2rv8lh"
    ],
    [
      "g2stgws",
      "g2rl1de"
    ],
    [
      "g2sxmws",
      "g2rvj6p"
    ],
    [
      "g2tb5nu",
      "g2rvj6p"
    ],
    [
      "g2tzkcp",
      "g2ph3oq"
    ],
    [
      "g2u6lie",
      "g2pzmvs"
    ]
  ]
}