{
  "nodes": [
    {
      "id": "gwvhkqq",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhkqq/",
      "user": "crushonaguywhodoesnt",
      "text": "okok its chill bro, i'll tell you\n\nso idk about u guys but i've never been harassed or threatened by a black person.\n\nmen, on the other hand, is a different story. women are harassed by men veryyy often. \n\ni mean that's it, really. one's based on assumption and the others based on experience :)",
      "sentiment": 0.4389
    },
    {
      "id": "gwvhm7v",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhm7v/",
      "user": "OpinionatedAcc",
      "text": "Well it is and should be a legitimate concern for girls/women. Should they not be concernrd?",
      "sentiment": 0.2732
    },
    {
      "id": "gwvhoo2",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhoo2/",
      "user": "Tod_2004",
      "text": "They're both wrong tho. Both are judging an entire group for the bad actions of a few of them",
      "sentiment": -0.765
    },
    {
      "id": "gwvhov0",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhov0/",
      "user": "secccret726",
      "text": "Both are stereotypes. Both are fairly inaccurate and offensive. It is sexist to say that.",
      "sentiment": -0.4588
    },
    {
      "id": "gwvhsws",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhsws/",
      "user": "Tod_2004",
      "text": "Alot of black people are thugs so it should be a legitimate concern to be afraid of them then, right? Should they not be concerned?",
      "sentiment": 0.0
    },
    {
      "id": "gwvhuih",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhuih/",
      "user": "Tod_2004",
      "text": "Agreed",
      "sentiment": 0.2732
    },
    {
      "id": "gwvhw3q",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhw3q/",
      "user": "sweaterbreaker",
      "text": "I swear I've only seen that opinion online like do those people even exist in real life",
      "sentiment": 0.3182
    },
    {
      "id": "gwvhxu9",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvhxu9/",
      "user": "VadeKing",
      "text": "Id say that at the end of the day it’s because statistics show that a very large percentage of guys really do end up being problematic, and not only that but the number of women and others that end up dealing with sexual harassment of some kind are just proof that while it may not be all men it is still enough for it to be a genuine issue. You’re right in the fact that the previous statement was racist, but the “not all men” issue is backed by statistics showing that it is a very substantial number of them, and they may not even be 100% accurate because some people may not report incidents. It’s not sexist to point at statistics that prove that it’s not just a stereotype and base your thoughts and feelings on them, it’s just looking at the facts and preparing for the worst. (In my opinion)",
      "sentiment": -0.8271
    },
    {
      "id": "gwvi3kb",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvi3kb/",
      "user": "crushonaguywhodoesnt",
      "text": "i don't think so. i mean i don't believe all men are out to rape me but it's important to be cautious. i've had my ass grabbed and had older men try to get me to dance with them when i explicitly tell them no multiply times. normal people don't just assume all men are rapists, but we're just careful under certain circumstances like when we're alone and shit. i mean it'd be stupid to not be cautious when something bad repeatedly happens to you, right?",
      "sentiment": -0.9804
    },
    {
      "id": "gwvi4a0",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvi4a0/",
      "user": "OpinionatedAcc",
      "text": "Okay dude, when it comes to blacks, it's not even a race thing. If your in a poor neighborhood(and minorities are usually stuck in these neighborhoods) crime is more common than in a wealthy suburb(where whites usually live). \nI wouldn't be legitimately scared of someone if I was in a good neighborhood, but if it was like the ghetto, I'd definitely steer clear of some folks there.",
      "sentiment": 0.8821
    },
    {
      "id": "gwvil45",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvil45/",
      "user": "lenleaf",
      "text": "well when you look at the statistics a large percentage of women are sexually assaulted, or harassed by men. speaking for women right now i know most of us have started to be harassed by men at a young age. while we understand it’s not all men, it’s enough to make us scared to be alone in the street. being afraid of a person based off the color of their skin is stupid, but being afraid based off the fact that a man could take me and harass/ rape me off any given moment is different. it isn’t our fault we’re conditioned to be more trusting of women. i hope this explains it well",
      "sentiment": -0.9288
    },
    {
      "id": "gwvizvt",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvizvt/",
      "user": "Tod_2004",
      "text": "Yeah, that's why I'm asking online",
      "sentiment": 0.296
    },
    {
      "id": "gwvj4cv",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvj4cv/",
      "user": "sweaterbreaker",
      "text": "If it's just online it probably shouldn't bother you tbh",
      "sentiment": 0.2584
    },
    {
      "id": "gwvjouh",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvjouh/",
      "user": "Tod_2004",
      "text": "I wasn't serious, just using your own logic against you",
      "sentiment": 0.0572
    },
    {
      "id": "gwvjy9f",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvjy9f/",
      "user": "heavenlylord",
      "text": "but you can say the same exact thing about black people. they commit more crime on average, so why can you not be more cautious around them? I'm not arguing this, just using your logic.",
      "sentiment": 0.153
    },
    {
      "id": "gwvkakl",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvkakl/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "gwvo8uy",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvo8uy/",
      "user": "VadeKing",
      "text": "Alright so let’s do some math.\n\nTotal US population = 328.2 million\n\n13.4% of the total US population is black so around 43,987,800 people in the US are black, cool.\n\nThe total number of offenses committed BY blacks is around 2,667,010 (whites are much higher with 7,014,550 meaning your “they commit more crimes on average” comment doesn’t work here) which means that only 2.8% of the black population commits a crime (and some of them could be repeat offenders)\n\nSo essentially 2.8% of 13% of the total US population could be trouble. Pretty small right? Now let’s look at some rape statistics.\n\nAgain, Total US population = 328.2 million\n\nMen make up 49% of the total US population meaning roughly 157 million dudes are vibin here. That’s already a much bigger number right? It doesn’t stop there.\n\nRoughly 91% of women have to deal with sexual assault and seeing as how someone has to make up the other 51% of the population (164 million) we can figure out that 149,240,000 women are raped or sexually assaulted. Okay thats a scary large number, so what percent of rapists have victims described as men?\n\n99%. 99% of offenders described in these circumstances were male, meaning that roughly 147,747,600 were carried out by men. \n\n45% of the total US population have been offenders in some kind of sexual harassment or assault. When you say “it’s not all men” sure, you’re right, but there are HUNDREDS OF MILLIONS who are guilty of this. It’s unfair to look at 2.8% of the population and be weary of them, because it’s such a tiny section of the bigger picture. Yes they exist, but the chances of you ever running into someone like that is low. Now just consider for a second that HUNDREDS OF MILLIONS of women have ALREADY been affected and have had encounters like this, and 45% of the entire population have been the ones to start these encounters. You’ve never had an issue with someone of another race but you’ve probably met a male that’s engaged in some kind of sexual harassment in your lifetime and you will further into the future. The statistics are nowhere near the same and they can’t at all be compared. Fearing 2.8% of 13% the population vs 45% is in no way comparable, and I think that women have plenty of justification for being weary after doing this math.\n\nSources Cited:\n\nhttps://www.ojjdp.gov/ojstatbb/crime/ucr.asp?table_in=2\n\nhttps://www.unwomenuk.org/safe-spaces-now\n\nhttps://www.bjs.gov/content/pub/pdf/SOO.PDF\n\n(Edit: Yes I did take an entire hour to write all of this out and do the math)\n\nEdit part 2: It’s actually 97% of women. So allow me to rework my math for a second. \n\n159,080,000 women are victims of sexual harassment or assault meaning that around 157,489,200 men have engaged in some form of this. \n\nTHATS 48% OF THE TOTAL POPULATION THAT WOMEN HAVE ALREADY BEEN HARASSED AND ASSAULTED BY.",
      "sentiment": -0.9932
    },
    {
      "id": "gwvrffa",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvrffa/",
      "user": "heavenlylord",
      "text": "so you are saying that 99% of all men have committed sexual assault or harassment? that seems like an insane number.\n\nI guess me and most of the other guys I know are in that super rare 1% of people who have never sexually assaulted a women.\n\n&amp;#x200B;\n\nBut all the math and everything is irrelevant. From your logic, we understand that:\n\nif men disproportionately commit rape and sexual assault (which they do), it makes sense to be cautious around them\n\nif black people disproportionately commit crime (which they do), it makes sense to be cautious around them as well, even if you are just slightly more cautious\n\n&amp;#x200B;\n\nHowever, it seems that there is some threshold you have for when it is okay to be careful around a type of person. So I would ask: what percent of black people exactly would have to be criminals before it is okay to be afraid of them?",
      "sentiment": -0.9392
    },
    {
      "id": "gwvsk40",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvsk40/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "gwvsm02",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvsm02/",
      "user": "VadeKing",
      "text": "That isn’t at all what i’m saying, what I just showed you is that a VERY VERY VERY small percent of the actual population is in this group that you’re so worried about. You’re not likely to meet any of them, and if you do then they most likely wouldn’t do anything to harm you any way so being nervous about the entire race is in fact racist. And I specifically mentioned that I was talking about sexual harassment AND assault. If it was just sexual assault then yes 99% would be an extreme, but I included sexual harassment because that is also an issue that needs to be addressed. I would like to ask why the math is irrelevant considering the fact that it proves that you objectively have no reason to fear black people and completely explains why women would be so cautious around men. You’re simply taking the things I say and finding what you want to hear and then acting as if that was my entire argument, when in fact by reviewing what I wrote it should be abundantly obvious that I was trying to dissuade you from being cautious around black people entirely. Instead of spending your time trying to make my argument invalid, I would like you to feel some empathy for women and understand where they’re coming from when they say these kinds of things and try to help change things so it’s safer for everyone instead of immediately calling them sexist.\n\nEdit: It just occurred to me that you didn’t even try to understand the math if you’re assuming that i’m saying that 99% of men are offenders. 99% of sexual assault and harassment are committed by men, that doesn’t mean 99% of men it just means 99% of the total number of assaults were committed by men.",
      "sentiment": -0.9832
    },
    {
      "id": "gwvvobd",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvvobd/",
      "user": "heavenlylord",
      "text": "Sorry if I come off as an unempathetic asshole. I am leaning towards agreeing with you but I ask these questions because I want to fully understand what you think.\n\nI say the math is irrelevant because I like to look at things in a more abstract way. Then we can apply the real-world scenario afterwards.\n\n&amp;#x200B;\n\nIf I was making your argument, this is how I would do it:\n\nI think it is important to balance your personal feeling of safety and the harm you might do to others or a group of people.\n\nFor example, if you were to clutch your purse when a black person was approaching in a public place (which in SOME LOGICAL WAY does make sense, since your are somewhat MORE LIKELY to be robbed by that black person than a white person, on average), it is still a racist and bad thing to do. Why? Because the chance of you actually being robbed is still very low, and your action perpetuates a stereotype that black people are criminals and thugs, which is harmful in the long run. Your fear of being robbed is significantly exaggerated due to your racism, and your actions are unwarranted.\n\nOn the other hand, if you were a women walking alone at night and a man is approaching, there might be a pretty significant chance of something bad happening to you. The risk is significant enough that it does warrant action, and the harm done to men by perpetuating a stereotype is somewhat negligible.\n\n&amp;#x200B;\n\nIf you take this position, however, you also have to accept that, if we lived in a hypothetical world where black people committed a massive amount of crime, it would be okay to engage in behavior considered racist by today's standards. I don't really think that is unreasonable to accept though.",
      "sentiment": -0.9848
    },
    {
      "id": "gwvwjqj",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvwjqj/",
      "user": "VadeKing",
      "text": "Well sure your last point makes sense but we don’t live in that world, nor will we at any point in the future so why think about that? Yes if crime rates were higher then sure it would be slightly more understandable to do things like clutching our belongings closer to us, but again we don’t live in a world like that and we won’t ever. \n\nI can understand wanting to look at things from an abstract perspective but when it comes to these real genuine issues that can be... not ideal. You said you like to apply the real-world scenario afterwards but if the issue IS the real-world scenario then applying it AFTER you’ve done your thinking only means that the conclusions you would come to would be off. \n\nDON’T GET ME WRONG I can see ways in which we could all benefit from thinking of things in that manner more, but I just think that in this one particular situation we need to think down to earth since this is such a major issue that’s effected so many people already, and moving forward I don’t think abstract is the way to handle this particular issue. \n\nI apologize if I sounded irritated or annoyed in any of my previous comments, It’s currently 5am and I have yet to sleep so my ability to read tone in text is iffy so I may have taken some of what you said in a manner that you didn’t intend and I apologize for that.",
      "sentiment": 0.6065
    },
    {
      "id": "gwvxpjd",
      "url": "https://www.reddit.com/r/teenagers/comments/n4go9x/we_can_all_agree_that_saying_i_know_all_black/gwvxpjd/",
      "user": "heavenlylord",
      "text": "I think it's super important to think about things in an abstract way because it gives us a way to arrive at a conclusion based upon a fundamental set of beliefs. Having this baseline set of beliefs gives us a way to evaluate and draw a conclusion for any scenario. And it's important that you are okay with any conclusion that comes from those beliefs, or at least you feel that conclusion is preferable to any alternative.\n\nEven if you have to confront extreme hypotheticals that seem ridiculous, by the end of it you will have a much more solid and justifiable argument.\n\nI think that it helps to have an opinion that is firmly grounded in something you really believe in.\n\nMost of this stuff is really just important if you want to argue with people online though, you can always just get all your opinions from twitter lmao",
      "sentiment": 0.8771
    }
  ],
  "edges": [
    [
      "gwvhkqq",
      "n4go9x"
    ],
    [
      "gwvhm7v",
      "n4go9x"
    ],
    [
      "gwvhoo2",
      "gwvhkqq"
    ],
    [
      "gwvhov0",
      "n4go9x"
    ],
    [
      "gwvhsws",
      "gwvhm7v"
    ],
    [
      "gwvhuih",
      "gwvhov0"
    ],
    [
      "gwvhw3q",
      "n4go9x"
    ],
    [
      "gwvhxu9",
      "n4go9x"
    ],
    [
      "gwvi3kb",
      "gwvhoo2"
    ],
    [
      "gwvi4a0",
      "gwvhsws"
    ],
    [
      "gwvil45",
      "n4go9x"
    ],
    [
      "gwvizvt",
      "gwvhw3q"
    ],
    [
      "gwvj4cv",
      "gwvizvt"
    ],
    [
      "gwvjouh",
      "gwvi4a0"
    ],
    [
      "gwvjy9f",
      "gwvhxu9"
    ],
    [
      "gwvkakl",
      "gwvjouh"
    ],
    [
      "gwvo8uy",
      "gwvjy9f"
    ],
    [
      "gwvrffa",
      "gwvo8uy"
    ],
    [
      "gwvsk40",
      "gwvjy9f"
    ],
    [
      "gwvsm02",
      "gwvrffa"
    ],
    [
      "gwvvobd",
      "gwvsm02"
    ],
    [
      "gwvwjqj",
      "gwvvobd"
    ],
    [
      "gwvxpjd",
      "gwvwjqj"
    ]
  ]
}