{
  "nodes": [
    {
      "id": "gjhrw24",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjhrw24/",
      "user": "mother-of-bees",
      "text": "I’m sorry you’re having to deal with this, that’s truly such a shame. I would simply recommend using a different breeder. You want someone that makes you feel comfortable and has clearly cared well for the puppies. I’m not a POC so can’t say anything about the commonality of dealing with racism in searching for a dog, but I wish you the best of luck and hope you find the Dobie of your dreams from a breeder that treats you with respect! Good luck!",
      "sentiment": 0.9905
    },
    {
      "id": "gjhzori",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjhzori/",
      "user": "JessicaRabbit_001",
      "text": "Look for another breeder. If this breeder considers dobermans to be “fighting” dogs, they are not qualified to breed them.  When I sold my pups, many years ago the only thing I insisted on was that if you were a renter, your landlord accepted the breed and any  pet fee was paid before pick up. I also followed up on the pups and the new owner and made myself available to answer questions. Good luck, be prepared to be put on a list for a well bred pup.",
      "sentiment": 0.875
    },
    {
      "id": "gji18zv",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gji18zv/",
      "user": "Codles",
      "text": "Is this breeder part of a larger organization? If so, it may be worth voicing your concerns with them as well.\n\nThis breeder sounds awful.",
      "sentiment": 0.0
    },
    {
      "id": "gji3tjm",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gji3tjm/",
      "user": "Boombamtao",
      "text": "Thank you, I will look elsewhere. Sad thing is I gave her a notarized letter from my landlord saying I was allowed to have a Doberman as well but it just seem like she was trying to find every reason to feel like I was gonna make the dog aggressive.",
      "sentiment": 0.705
    },
    {
      "id": "gji4bll",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gji4bll/",
      "user": "Boombamtao",
      "text": "I am not sure but I will into it. If they are I will report them. Thank you for the advice.",
      "sentiment": 0.4155
    },
    {
      "id": "gji4gk8",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gji4gk8/",
      "user": "Boombamtao",
      "text": "🙏 thank you, I will go with another breeder. This is to much and I don’t feel comfortable buying from them anymore.",
      "sentiment": 0.7003
    },
    {
      "id": "gji5hm4",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gji5hm4/",
      "user": "JessicaRabbit_001",
      "text": "Your 🙏 welcome. Again good luck and research the breeder you would like to purchase from. AKC can help you find a good one in your area. Look for for a Doberman club in your area.",
      "sentiment": 0.9432
    },
    {
      "id": "gjifekm",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjifekm/",
      "user": "ftsillok",
      "text": "I will gladly sell you a pup! Shoot me a message 😉",
      "sentiment": 0.0
    },
    {
      "id": "gjifw9b",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjifw9b/",
      "user": "Boombamtao",
      "text": "Sending you a message now!",
      "sentiment": 0.0
    },
    {
      "id": "gjiiizm",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjiiizm/",
      "user": "ADVENTURE-_63",
      "text": "List the breeder please.",
      "sentiment": 0.3182
    },
    {
      "id": "gjipkbs",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjipkbs/",
      "user": "sirdobey",
      "text": "Try Feverhaus dobermans in NYC. Im not a POC so I cant speak to it but the breeder was great to work with and breeds amazing dobes. I got my boy in June and couldnt be happier. He is very cautious in general about who he gives pups too and is a very upfront no BS person so be prepared for that but its close to you and the dogs have a great temprament.",
      "sentiment": 0.9238
    },
    {
      "id": "gjjqu92",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjjqu92/",
      "user": "jld702",
      "text": "Sorry you had that unfortunate experience with some “breeder” who sounds more like an ignorant clown. A top notch breeder will be more concerned about placing their well cared for pups in a home where the personality of the pup will mesh well with yours/your family. Good luck in finding a more qualified breeder and hope you are able to find a doberbaby.",
      "sentiment": 0.9141
    },
    {
      "id": "gjmynsw",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjmynsw/",
      "user": "MantisStyle",
      "text": "Maybe racist, maybe not. That one breeder sounds like she's got a fucked up bias, but who knows. If it is any consolation, many many (most, all) breeders are a bit wacky. We have been denied because we had a child. We have been denied because we never owned a doberman before (chicken or the egg situation). We were denied because we didn't want to crop the ears. We work from home (pre covid) with a yard, great salary, and we both are very athletic - an ideal home for a doberman. And we're white. And we were denied by several breeders. \n\nSo is it a race thing? Absolutely could be. But it could be a simple as the fact that you're in an apartment (we were denied for that too, even though the apartments butted up against Piedmont park in Atlanta (akin to Central Park). Like I said, breeders are all crazy in their own way. But they all want to avoid two things: returned dogs that they will have to place later or people breeding their dogs without additional payment/approval. It is what it is. So even if you are being discriminated against, be happy that you're not supporting them with your hard earned money. \n\nThere's plenty of breeders out there. Don't worry - you'll find one. Also remember that we're still in lockdown so the demand for dogs have gone way way up.  So they can be as picky as they want. A friend of mine couldn't get approved for an unwanted pound mixed-breed dog that was most likely going to be put down. All because he doesn't have a yard. After 9 months of trying he finally found one - a pure bred puppy from a breeder. Go figure. \n\nBut I wouldn't say there's any more or less racism in doberman dog breeding than you would find in any other walk of life. And remember, you don't have to get one from NY. It really can be from anywhere. Good luck!",
      "sentiment": -0.8607
    },
    {
      "id": "gjpub2h",
      "url": "https://www.reddit.com/r/DobermanPinscher/comments/kynqzk/breeder_racism/gjpub2h/",
      "user": "Tracydr1",
      "text": "I’m sorry for your experience. I did turn down an African American with my litter but it had nothing to do with color. She didn’t pass my screening criteria.\n\nThere is a wonderful breeder/AKC judge down in the south ,his kennel name is Talladega. He is black. You might want to talk with him about his experiences.\n\nThere’s Also a very sweet AA breeder in The Midwest, IL or Michigan who has some very well known dogs. Her kennel ame is Moa’s.",
      "sentiment": 0.931
    }
  ],
  "edges": [
    [
      "gjhrw24",
      "kynqzk"
    ],
    [
      "gjhzori",
      "kynqzk"
    ],
    [
      "gji18zv",
      "kynqzk"
    ],
    [
      "gji3tjm",
      "gjhzori"
    ],
    [
      "gji4bll",
      "gji18zv"
    ],
    [
      "gji4gk8",
      "gjhrw24"
    ],
    [
      "gji5hm4",
      "gji3tjm"
    ],
    [
      "gjifekm",
      "kynqzk"
    ],
    [
      "gjifw9b",
      "gjifekm"
    ],
    [
      "gjiiizm",
      "kynqzk"
    ],
    [
      "gjipkbs",
      "kynqzk"
    ],
    [
      "gjjqu92",
      "kynqzk"
    ],
    [
      "gjmynsw",
      "kynqzk"
    ],
    [
      "gjpub2h",
      "gjhzori"
    ]
  ]
}