{
  "nodes": [
    {
      "id": "g2pa23p",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pa23p/",
      "user": "Blutarg",
      "text": "What is \"gross\" about that character?",
      "sentiment": -0.4767
    },
    {
      "id": "g2pado5",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pado5/",
      "user": "99Poppies",
      "text": "I think maybe the exposed breasts and rather revealing outfit may be a part of the issue.",
      "sentiment": -0.0772
    },
    {
      "id": "g2pbfpm",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pbfpm/",
      "user": "stnstrwbrry",
      "text": "I know but she could've just changed the outfit and gave her a modest look, not change her race and make her fat like that's also a problem",
      "sentiment": -0.0772
    },
    {
      "id": "g2pc77o",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pc77o/",
      "user": "kikipinpin",
      "text": "There was some discussion of that 'artist' elsewhere on Reddit the other day and the general consensus seemed to be that it's a parody account from someone who is essentially pretending to be an uber-SJW cliche character. I don't know for sure but I would certainly tend to think they are a parody/troll account aimed at pissing people off, based on their Twitter profile.\n\nEither way ... they make \\*all\\* characters fat and black and they always give them weird tree-trunk legs that make them look like they've got lymphoedema.",
      "sentiment": 0.1202
    },
    {
      "id": "g2pdazi",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pdazi/",
      "user": "stnstrwbrry",
      "text": "Oh wow the sarcasm got me lol. I got wooshed hard",
      "sentiment": 0.6486
    },
    {
      "id": "g2pdfzw",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pdfzw/",
      "user": "trashQueen1947",
      "text": "As an art student I know a lot of these kinds of artists irl (unfortunately). I’m from Colorado and my high school was kinda famous for the athletic programs and so there were like 4 visibly overweight people in my whole school. Then I come to art school in the south and MANY of my classmates are really fat! I was not expecting that so being a bit culture shocked I was a bit too formal to most overweight girls I met and they took my niceness for either me hitting on them or trying to become instant bffs. Honestly I feel bad for some of the girls that I befriended early on and then had to tell I wasn’t into after they asked me to be gfs. Many where really nice and honestly just fat because they had been through a lot in life and had bad relationships with food. Then there’s girls like this artist who treated it like a “quirky” personality trait.",
      "sentiment": 0.4623
    },
    {
      "id": "g2ph7a1",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2ph7a1/",
      "user": "jesuismexican",
      "text": "There’s ways to have a less revealing clothing for sure especially because the character is 16 but her superpower in MHA is to pull stuff out of her skin, with larger objects needing to come out of large gaps in her clothing. Kinda part of her power. The new version doesn’t really account for that, it’s basically a completely different hero",
      "sentiment": 0.7886
    },
    {
      "id": "g2plky1",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2plky1/",
      "user": "timecube_traveler",
      "text": "That outfit always peeved me off even with the in-lore explanation because it's designed to be sexy but like.. You can have way more skin showing for having huge stuff coming out of it with a more modest outfit. Maybe a sports bra, shorts and sneakers instead of boots because calves are a kinda big body parts they're missing out on. It's a pet peeve of mine.",
      "sentiment": 0.6808
    },
    {
      "id": "g2pmaen",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pmaen/",
      "user": "jesuismexican",
      "text": "I agree completely. A sporty outfit would make more sense and would probably be more useful anyway within the context of the show. \n\nAlso her ability to create stuff is based off of food consumption which is why she’s so skinny, the character on the right just throws that all out. Half the fun of the show/books is how specific and limited the powers are sometimes in my opinion",
      "sentiment": 0.8883
    },
    {
      "id": "g2pn9fa",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pn9fa/",
      "user": "Terytha",
      "text": "I think the author of MHA draws some of the most realistic bodies I've seen though, generally oversized boobs notwithstanding. There's even a literal obese hero. As in that's his power.",
      "sentiment": 0.5574
    },
    {
      "id": "g2pp1n9",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pp1n9/",
      "user": "acjj1990",
      "text": "But her ability is to create from using her own fat, which is why her outfit leaves her stomach visible.\n\nSure you can gather fat from your arms, but most fat is usually localizers to ones abdomen.",
      "sentiment": 0.8201
    },
    {
      "id": "g2prlsm",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2prlsm/",
      "user": "stnstrwbrry",
      "text": "I mean she got fat in her boobs, her quirk benefits from it I would assume",
      "sentiment": 0.3818
    },
    {
      "id": "g2pu58c",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2pu58c/",
      "user": "atrahal",
      "text": "On a serious note, not the weird tweet perspective: Momo is 15-16 and craaazy sexualized. Her costume could show skin (so she can use her powers) without being tits out and a miniskirt. Stretchy armored shorts, armored boots, a sports bra or crop style top. Overall Horikoshi does a great job with character design but poor Yaomomo got the short end of the fan service stick.",
      "sentiment": 0.2942
    },
    {
      "id": "g2q47om",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2q47om/",
      "user": "TheCapitalKing",
      "text": "It’s a Japanese show all their shows have girls half naked for everything. It’s the main reason I don’t watch more of them. Like why does this cartoon character need double d’s that are completely visible, I just wanted to watch a fun show about turning the moon into a fighting robot",
      "sentiment": 0.552
    },
    {
      "id": "g2q4iwr",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2q4iwr/",
      "user": "TheCapitalKing",
      "text": "It wouldn’t really be an anime without enough cleavage to make it really uncomfortable to recommend the show to a friend",
      "sentiment": 0.4715
    },
    {
      "id": "g2q4wn4",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2q4wn4/",
      "user": "Terytha",
      "text": "There are very few exceptions to this, yes. Anime artists like boobs.\n\nWho can blame them though really.",
      "sentiment": 0.4981
    },
    {
      "id": "g2q6m5j",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2q6m5j/",
      "user": "TheCapitalKing",
      "text": "The liking is fine. The drawing is less chill",
      "sentiment": 0.5423
    },
    {
      "id": "g2qaxxf",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qaxxf/",
      "user": "Mighty_Zhdun",
      "text": "Honestly, more modestly dressed, chunky, and darker skinned characters would be totally cool but... This character isn't those things. You don't have to be a fan of a show or book or comic, and if you think they aren't diverse enough, go ahead and never give them your disposable income. But being a 'fan' whilst doing stuff like this really confuses me. You .. don't like the character?",
      "sentiment": 0.7088
    },
    {
      "id": "g2qbf84",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qbf84/",
      "user": "Mighty_Zhdun",
      "text": "Ah I see, twas a parody account. I agree there's a diversity problem and an oversexualization problem with a lot of media, but therefore I don't watch or read said media, but I do understand why people come up with alternative designs like this (actual people, not parody accounts), but I personally prefer trying to make my own media instead. I wrote a novel because I was salty about not having autistic women in sci fi stories, and now, in my small book, it's canon. In my opinion that is more progress than headcanoning a popular character as autistic when They Aren't ™",
      "sentiment": 0.92
    },
    {
      "id": "g2qg3vu",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qg3vu/",
      "user": "finalflash45",
      "text": "Being skinny and Japanese is a big no no.\nBeing black and fat? That's perfectly fine.",
      "sentiment": 0.5859
    },
    {
      "id": "g2qo5t7",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qo5t7/",
      "user": "Hoofwoof",
      "text": "Momo would be dead by now if she was wearing that.  I don't even think the boys' uniforms are that covering and she relies on exposed skin to use her power.  She'd be dead lol",
      "sentiment": -0.7964
    },
    {
      "id": "g2qpdzv",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qpdzv/",
      "user": "tpfang56",
      "text": "even though this is a troll account, I have seen a few artists like that on tumblr where they make white or light-skinned/thin/fit characters fat and racebent. it always looks so ugly because of the particular art style they adopt. I hate it and it causes me visceral disgust on sight, but I don’t think its okay to harass said artists like people are prone to do on twitter. \n\nI hate momo’s design too tbh but meh, male shounen authors fail hard at female characters in almost every instance.",
      "sentiment": -0.9507
    },
    {
      "id": "g2qxpzq",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qxpzq/",
      "user": "Raikou0215",
      "text": "Just a dang cloak would do the trick.",
      "sentiment": -0.0516
    },
    {
      "id": "g2qygcy",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qygcy/",
      "user": "thereefulfreble",
      "text": "Yeah, or even just have an exposed back to pull the big stuff out of",
      "sentiment": 0.2263
    },
    {
      "id": "g2qyhds",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qyhds/",
      "user": "haikusbot",
      "text": "*Yeah, or even just*\n\n*Have an exposed back to pull*\n\n*The big stuff out of*\n\n\\- thereefulfreble\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&amp;#32;more&amp;#32;about&amp;#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
      "sentiment": 0.6249
    },
    {
      "id": "g2qzetx",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qzetx/",
      "user": "atrahal",
      "text": "As Edna Mode says, NO CAPES!\n\nMore seriously, a cloak wouldn’t solve the lack of boob support and chest coverage Momo has, especially if it’s an open cloak or it covers enough fat reservoirs and skin that she can’t use her quirk effectively. Plus, that would just lead to “ooo is she wearing ANYTHING under it??” sexualisation. Gross. Just give her a normal top and bottoms that don’t invite panty shot fan art.",
      "sentiment": 0.3455
    },
    {
      "id": "g2qzl5n",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2qzl5n/",
      "user": "bisonbarbie",
      "text": "Good bot",
      "sentiment": 0.4404
    },
    {
      "id": "g2r1i6t",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r1i6t/",
      "user": "stnstrwbrry",
      "text": "I agree there are diversity problems in media but tbh MHA has a lot of body types. There is a fat person, a skinny person, a curvy person and of course a buff person. But they are Japanese so they shouldn't turn black. \n\nAnd you're right, there should be autistic women in scifi stories. It would be very cool to see that!",
      "sentiment": 0.5546
    },
    {
      "id": "g2r1ovp",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r1ovp/",
      "user": "stnstrwbrry",
      "text": "Or she'd have to rip her unrevealing clothes in every episode just to use her  powers whenever someone comes along. And then Mineta would have a nosebleed right after",
      "sentiment": 0.0
    },
    {
      "id": "g2r23xu",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r23xu/",
      "user": "stnstrwbrry",
      "text": "I don't like it when people can't admit to themselves that this can be a problem and embrace it to the point where it gets stupid. It's okay to be fat, but to convince people that it's a quirk thing is just weird",
      "sentiment": -0.3294
    },
    {
      "id": "g2r3rch",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r3rch/",
      "user": "Hoofwoof",
      "text": "Okay so correction, Mineta would be dead of hemorrhage.",
      "sentiment": -0.5267
    },
    {
      "id": "g2r46jk",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r46jk/",
      "user": "stnstrwbrry",
      "text": "Yes but instead of dying, he gets rushed to the clinic and gets treated and the next episode it happens again. It will happen in every episode. Every episode of MHA will be Mineta having a hemorrhage in every episode becaude Momo wasn't allowed to wear revealing clothing",
      "sentiment": 0.2144
    },
    {
      "id": "g2r4iq9",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r4iq9/",
      "user": "Hoofwoof",
      "text": "I already hate him and I don't even know if I could watch the show if that was a running gag.  Momo wearing a mankini and a massive utility belt is all that's saving the show from Mineta.  Fuck.",
      "sentiment": -0.8625
    },
    {
      "id": "g2r4pan",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r4pan/",
      "user": "stnstrwbrry",
      "text": "I want to rip his hair balls off and leave him bald while his scalp bleeds.",
      "sentiment": 0.0258
    },
    {
      "id": "g2r6hx8",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r6hx8/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2r8ymy",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2r8ymy/",
      "user": "BMXTKD",
      "text": "Most black people around the world don't look like that.  Most black people in the world tend to be from places that either get lots of exercise, or suffer from a lack of nutrition.      \n\nThis is pure Americacentrism, from an African American perspective.",
      "sentiment": -0.7851
    },
    {
      "id": "g2rfch9",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2rfch9/",
      "user": "sweetheartblues",
      "text": "honestly, I don’t see any issue with headcanons as long as everyone respects each other’s opinions! in theory, it’s fun and sometimes comforting to project your own traits onto characters you relate to, but you can’t expect everyone else in the fandom to cater to your narrative. IDK though, I’ve never been drawn to fandom spaces.\nedit: also, congrats on the novel!! good autistic/neurodivergent representation is so hard to find, so I’m always excited to see people creating it!",
      "sentiment": 0.9662
    },
    {
      "id": "g2rqeac",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2rqeac/",
      "user": "red-plaid-hat",
      "text": "&gt; There are very few exceptions to this, yes. \n\nAnime that is commercialized for the west is full of stuff like this. But, there is plenty that is just normal kids doing shit like baseball or cooking, but the west doesn't want that. There are more anime in this world than most people can imagine because a lot of it stays *home.*  \n\n\nAm I saying that Japan doesn't have weird anime with huge boobs in-country? Absolutely not. They exist, but most of the content western cultures (read: not Japan) consume are large-breasted because that's what sells.",
      "sentiment": 0.5509
    },
    {
      "id": "g2rwt0p",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2rwt0p/",
      "user": "Mighty_Zhdun",
      "text": "Thank you",
      "sentiment": 0.3612
    },
    {
      "id": "g2rx0np",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2rx0np/",
      "user": "Mighty_Zhdun",
      "text": "Yeah headcanons are not evil but I often find they get accepted to a degree that causes people to not get mad at the lack of representation because they've come to see x character as a member of y minority but the authors or creators get out of having to confirm anything. Also thank you for your interest in my story, I can message you about it if you'd like",
      "sentiment": 0.9477
    },
    {
      "id": "g2s6042",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2s6042/",
      "user": "DerpFarce",
      "text": "dude momo's power is literally converting her fat into tanks and stuff. how tf these people think she's gonna be fat?",
      "sentiment": 0.0
    },
    {
      "id": "g2sa3us",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2sa3us/",
      "user": "virginiarph",
      "text": "my problem with her is that she uses adipose to use her abilities. if that's the case then why is she stick thin? Shouldnt she be a bit bulkier to begin with?",
      "sentiment": -0.264
    },
    {
      "id": "g2sa6ls",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2sa6ls/",
      "user": "justanyusername123",
      "text": "I'm pretty sure the criticism is about the insanely revealing and sexualising outfit on a teenager. Not about her being slim or Japanese. I am a big MHA fan myself and not a prude, but even I agree the re-imagined costume is much more age appropriate.",
      "sentiment": 0.6908
    },
    {
      "id": "g2saij4",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2saij4/",
      "user": "justanyusername123",
      "text": "Japanese anime doesn't always use real-life Japanese phenotypes (e.g. dark hair and skin). All Might himself is a Japanese man but portrayed with yellow hair and blue eyes. Like another famous Japanese hero, Sailor Moon. Anime art typically uses a variety of colours for hair, eyes and skin, that do not align with real life races. Midoriya is green haired lol. So anime characters may well have dark/black skin whilst still being Japanese, if that is their character.",
      "sentiment": 0.9382
    },
    {
      "id": "g2sije7",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2sije7/",
      "user": "pruggle",
      "text": "Ewwww",
      "sentiment": 0.0
    },
    {
      "id": "g2smiy3",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2smiy3/",
      "user": "philmarcracken",
      "text": "Tumblr have been doing this to japanese artists for years OP",
      "sentiment": 0.0
    },
    {
      "id": "g2sn8v5",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2sn8v5/",
      "user": "Terytha",
      "text": "I know, I was being a bit facetious. Most of my favorites don't have ridiculously huge boobs. ;)",
      "sentiment": 0.6171
    },
    {
      "id": "g2ssp0a",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2ssp0a/",
      "user": "BlackCatLuna",
      "text": "Not necessarily, very few shoujo anime feature women like that, since the primary audience is female. Tezuka's works don't feature anyone that I'd classify as half naked either.",
      "sentiment": 0.3612
    },
    {
      "id": "g2st2n7",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2st2n7/",
      "user": "TheCapitalKing",
      "text": "Not gonna lie the only ones I’ve watched that aren’t kids shows are Gurren Laugan, seven deadly sins, and my hero and all three of those are pretty bad about it so I just assumed",
      "sentiment": 0.0772
    },
    {
      "id": "g2svu2t",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2svu2t/",
      "user": "BlackCatLuna",
      "text": "I see, they're primarily aimed at men so that makes sense.\n\nOh! Overlord might be a good one for you then. You're watching the nation character descend into villainy but for the most part the girls are well dressed.",
      "sentiment": 0.3802
    },
    {
      "id": "g2sw4em",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2sw4em/",
      "user": "thebluef0x",
      "text": "To be fair Momo is kinda oversexualized and I think the anime would be much better if they changed it to something more normal or creative like the other suits.\n\nI don't accept that \"Oh it's because her quirk\" bs",
      "sentiment": 0.8262
    },
    {
      "id": "g2t17ou",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2t17ou/",
      "user": "darium4",
      "text": "So I’ve seen some of this artists other stuff that’s plastered with “stop sexualizing women” and whether or not it’s a parody account, it really bothers me that their way of not sexualizing women is making them obese and covered in body hair. \n\nA more modest look is absolutely the way to go if that’s the goal or even an outfit that is still revealing but more tasteful. A woman being thin isn’t her being sexualized. Tf kind of logic is that. And same goes for the inverse. Overweight women can be and are absolutely sexualized as well.",
      "sentiment": -0.1903
    },
    {
      "id": "g2tcyno",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2tcyno/",
      "user": "Soulsaversara",
      "text": "Obviously the redraw is awful but I am not a big fan of the original costume and her superpower does needs less clothing but it could have been shorts and a crop top rather than a boob split",
      "sentiment": 0.1796
    },
    {
      "id": "g2u928y",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2u928y/",
      "user": "Trovaa",
      "text": "not only is it pointless and ignorant to complain about the sexualization of her (albeit more understandable) why would they make her look like this when it goes against the entire point of her quirk and where the anime is set\n\nif anything i've seen more people built like momo at my school than the redrawn one.",
      "sentiment": 0.1689
    },
    {
      "id": "g2up2ol",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2up2ol/",
      "user": "BMXTKD",
      "text": "Here's a realistic body they can show.  A muscular male with a decent amount of body fat.",
      "sentiment": 0.0
    },
    {
      "id": "g2upgfw",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2upgfw/",
      "user": "Terytha",
      "text": "There's some of that but also realistically, people who train to be heroes would be pretty ripped.",
      "sentiment": 0.8674
    },
    {
      "id": "g2v6q0x",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2v6q0x/",
      "user": "RandomBRguy089",
      "text": "If this person had read the manga or watch the anime (I bet my ass he/she did neither), he/she would know that:\n\n1 - Momo creates things out of her skin. For that reason, she dresses like this.\n\n2 - To create things, Momo uses her body fat. Many theorize this is the reason for her being slim despite eating a lot.",
      "sentiment": 0.296
    },
    {
      "id": "g2wfo6p",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2wfo6p/",
      "user": "Reddysharkyboi",
      "text": "But she's a superhero who burns calories so much by using her power.\n\n She literally has to eat alot because she needs the energy to create something. \n\nAlso she's a 15-16 year old girl who does a lot of exercise.\n\n Her body type is pretty realistic,\n\n\n maybe she should look more muscular though.",
      "sentiment": 0.8625
    },
    {
      "id": "g2wfsma",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g2wfsma/",
      "user": "Reddysharkyboi",
      "text": "They changed some of the body types skinnier in the anime. Uraraka is kinda chubby in the manga, in a cute way, but they changed that in the anime.",
      "sentiment": 0.25
    },
    {
      "id": "g3ln7pw",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g3ln7pw/",
      "user": "Danarky",
      "text": "Gurren Lagann is literally one of the best anime. And if you're referring to Yoko, you entirely missed the point of her character.\n\nKamina is shirtless half the time but I don't see people throwing a fit about that",
      "sentiment": 0.6253
    },
    {
      "id": "g3n1lh6",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g3n1lh6/",
      "user": "TheCapitalKing",
      "text": "Yeah I liked it a ton. The difference between Kamina and Yoko was that they never did extended close ups on his chest and ass",
      "sentiment": 0.128
    },
    {
      "id": "g3n36oh",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g3n36oh/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "g5dhv05",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/g5dhv05/",
      "user": "CrabOutOfTheBucket",
      "text": "&gt; implying that black people are the more “ethical” race.\n\nWay to infantilize an entire group of people.\n\n&gt; makes them black when trying to make the characters less conventionally attractive.\n\nWay to imply that the group of people you infantilized are ugly too.",
      "sentiment": -0.1725
    },
    {
      "id": "gdnh6tb",
      "url": "https://www.reddit.com/r/fatlogic/comments/ifn3o9/artist_thinks_that_being_skinny_and_japanese_isnt/gdnh6tb/",
      "user": "Mr-back-pain",
      "text": "She needs exposed skin to use her power in the first place so her uniform makes sense",
      "sentiment": -0.0772
    }
  ],
  "edges": [
    [
      "g2pa23p",
      "ifn3o9"
    ],
    [
      "g2pado5",
      "ifn3o9"
    ],
    [
      "g2pbfpm",
      "g2pado5"
    ],
    [
      "g2pc77o",
      "ifn3o9"
    ],
    [
      "g2pdazi",
      "g2pc77o"
    ],
    [
      "g2pdfzw",
      "ifn3o9"
    ],
    [
      "g2ph7a1",
      "g2pado5"
    ],
    [
      "g2plky1",
      "g2ph7a1"
    ],
    [
      "g2pmaen",
      "g2plky1"
    ],
    [
      "g2pn9fa",
      "ifn3o9"
    ],
    [
      "g2pp1n9",
      "ifn3o9"
    ],
    [
      "g2prlsm",
      "g2pn9fa"
    ],
    [
      "g2pu58c",
      "g2pa23p"
    ],
    [
      "g2q47om",
      "g2pado5"
    ],
    [
      "g2q4iwr",
      "g2pn9fa"
    ],
    [
      "g2q4wn4",
      "g2q4iwr"
    ],
    [
      "g2q6m5j",
      "g2q4wn4"
    ],
    [
      "g2qaxxf",
      "ifn3o9"
    ],
    [
      "g2qbf84",
      "g2qaxxf"
    ],
    [
      "g2qg3vu",
      "ifn3o9"
    ],
    [
      "g2qo5t7",
      "ifn3o9"
    ],
    [
      "g2qpdzv",
      "g2pc77o"
    ],
    [
      "g2qxpzq",
      "g2pu58c"
    ],
    [
      "g2qygcy",
      "g2plky1"
    ],
    [
      "g2qyhds",
      "g2qygcy"
    ],
    [
      "g2qzetx",
      "g2qxpzq"
    ],
    [
      "g2qzl5n",
      "g2qyhds"
    ],
    [
      "g2r1i6t",
      "g2qbf84"
    ],
    [
      "g2r1ovp",
      "g2qo5t7"
    ],
    [
      "g2r23xu",
      "g2pdfzw"
    ],
    [
      "g2r3rch",
      "g2r1ovp"
    ],
    [
      "g2r46jk",
      "g2r3rch"
    ],
    [
      "g2r4iq9",
      "g2r46jk"
    ],
    [
      "g2r4pan",
      "g2r4iq9"
    ],
    [
      "g2r6hx8",
      "ifn3o9"
    ],
    [
      "g2r8ymy",
      "ifn3o9"
    ],
    [
      "g2rfch9",
      "g2qbf84"
    ],
    [
      "g2rqeac",
      "g2q4wn4"
    ],
    [
      "g2rwt0p",
      "g2r1i6t"
    ],
    [
      "g2rx0np",
      "g2rfch9"
    ],
    [
      "g2s6042",
      "ifn3o9"
    ],
    [
      "g2sa3us",
      "ifn3o9"
    ],
    [
      "g2sa6ls",
      "ifn3o9"
    ],
    [
      "g2saij4",
      "g2r1i6t"
    ],
    [
      "g2sije7",
      "ifn3o9"
    ],
    [
      "g2smiy3",
      "ifn3o9"
    ],
    [
      "g2sn8v5",
      "g2rqeac"
    ],
    [
      "g2ssp0a",
      "g2q47om"
    ],
    [
      "g2st2n7",
      "g2ssp0a"
    ],
    [
      "g2svu2t",
      "g2st2n7"
    ],
    [
      "g2sw4em",
      "ifn3o9"
    ],
    [
      "g2t17ou",
      "g2pbfpm"
    ],
    [
      "g2tcyno",
      "ifn3o9"
    ],
    [
      "g2u928y",
      "ifn3o9"
    ],
    [
      "g2up2ol",
      "g2pn9fa"
    ],
    [
      "g2upgfw",
      "g2up2ol"
    ],
    [
      "g2v6q0x",
      "ifn3o9"
    ],
    [
      "g2wfo6p",
      "ifn3o9"
    ],
    [
      "g2wfsma",
      "g2pn9fa"
    ],
    [
      "g3ln7pw",
      "g2st2n7"
    ],
    [
      "g3n1lh6",
      "g3ln7pw"
    ],
    [
      "g3n36oh",
      "g3n1lh6"
    ],
    [
      "g5dhv05",
      "ifn3o9"
    ],
    [
      "gdnh6tb",
      "ifn3o9"
    ]
  ]
}