{
  "nodes": [
    {
      "id": "fyqx5pe",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyqx5pe/",
      "user": "Nat_Libertarian",
      "text": "I am not a racist, but as soon as we discover aliens I will hate the ever loving hell out of them.",
      "sentiment": -0.7176
    },
    {
      "id": "fyrcyjx",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyrcyjx/",
      "user": "BigWeedTinyDick",
      "text": "you are a libertarian tho, which is pretty much the same thing",
      "sentiment": 0.6249
    },
    {
      "id": "fyrjo7v",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyrjo7v/",
      "user": "Evinceo",
      "text": "Back that up with facts?",
      "sentiment": 0.0
    },
    {
      "id": "fyrk78t",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyrk78t/",
      "user": "BigWeedTinyDick",
      "text": "back that ass up",
      "sentiment": -0.5423
    },
    {
      "id": "fysseet",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fysseet/",
      "user": "AutistMcSpergLord",
      "text": "Hey look, a panel talking down to Autistics about racism.  [Clearly a population which scores LOWER than average on the IAT needs to be talked down to about racism.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4636978/)\n\nHaving non-autistics involved in disability advocacy do a panel is a terrible way to discuss racism because they would rather shoot themselves in the head than meaningfully disagree with eachother or the current zeitgeist on racism in any way.  I would rather have a 2000 word debate around here over if rejecting identity politics or embracing social justice is the true solution to ending racism where people are linking to scientific research the entire time.",
      "sentiment": -0.9649
    },
    {
      "id": "fyu00xp",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyu00xp/",
      "user": "timee_bot",
      "text": "View in your timezone:  \n[Saturday, July 25 at 5pm PDT][0]  \n\n[0]: https://timee.io/20200726T0000?tl=%22Racism%20in%20the%20Neurodivergent%20Community%22%20Panel%20Discussion\n\n\n^(_*Assumed PDT instead of PST because DST is observed_)",
      "sentiment": 0.0
    },
    {
      "id": "fyufaq1",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyufaq1/",
      "user": "kitkatkommie",
      "text": "Hi there, thank you so much for your feedback! I believe there might have been some misunderstanding about the intent &amp; structuring of the panel.\n\nThe focus of the panel isn't being hosted to \"talk down\" to neurodivergent families about racism, but rather, to give BIPOC neurodivergent families, specifically, a platform to discuss the different forms that systemic racism take in the community (in terms of diagnosis and special education support disparities) and for them to get connected to resources that specifically support BIPOC neurodivergent families.\n\nCelebrating Differences is organizing this panel because many of the BIPOC neurodivergent families that the Organization works with have **requested the Organization hold an informational event that specifically highlights and provides resources to fight against systemic racism within the community with specialized professional perspective.** Therefore, the Organization's intent was to reach out to any willing professional specialist speakers – neurodivergent or not – in order to fulfill the discussion's mission.\n\nAll panel speakers were chosen and contacted by a team of neurodiverse young people, who are familiar with each panelist's integrity and experiences with systemic racism within the neurodivergent community either as a neurodivergent community member, parent of a neurodivergent student, or a special education educator.\n\nOriginally, this panel was just created for Celebrating Differences Organization's clients who **wanted a specific professional-focused panel**, but the Organization decided to also make this event accessible to the public.\n\nI hope this makes sense and clarifies the intent of the panel.",
      "sentiment": 0.9489
    },
    {
      "id": "fyuk9y3",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyuk9y3/",
      "user": "kitkatkommie",
      "text": "I accidentally deleted the original post while trying to edit – sorry about that! Here is the information once again! \n\n\"In light of the current national conversation about racial equality, [Celebrating Differences Organization](http://celebratingdifferences.net/) (CDO), a youth-led nonprofit organization focused on promoting neurodivergent inclusivity, awareness and allyship, is hosting a virtual “Racism in the Neurodivergent Community” panel over Zoom on **Saturday, July 25 at 5pm PST**, discussing the ways systemic and social racism is present within the neurodivergent community.\n\nOur panel will include the following speakers…\n\n* **Erica Malena**, licensed clinical social worker and founder of [Touch of Wholeness Psychological Services LLC](https://www.touchofwholeness.org/).\n* **Derrick Erwing,** Regional Sports Director of [Special Olympics Northern California](https://www.sonc.org/).\n* **Anna Wang**, co-founder and Vice President of [Friends of Children with Special Needs](https://fcsn1996.org/) (FCSN).\n* **Karrie Simmons**, neurodivergent awareness advocate.\n\n[**Here**](https://forms.gle/yKWqcfDnpyEHzYsB9) is the interest form for families to sign up to receive the panel Zoom link.\"",
      "sentiment": 0.937
    },
    {
      "id": "fyuzdvh",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fyuzdvh/",
      "user": "AutistMcSpergLord",
      "text": "There is a long history, and I'll name Autism Speaks specifically of advocates who speak on behalf of Autistic people (mostly parents) fearmongering about autism as a fundraising tactic.  Saying autism will break up your marriage, ruin your family, if your child has it you will be depressed, that sort of thing.  There were some worse scandals like that as well, like them tacitly supporting the Judge Rotenberg Centre and you can look into the story surrounding that if you want.\n\nStill I think I wasn't clear on the point of the panel and I think you for the explanation.\n\nAll the same, a panel of just non-autistic professionals is just going to be oblivious in certain ways.  I'm surrounded with people who have never been diagnosed with autism but have autism.  Who got diagnosed but then never accessed healthcare services afterwards.  They come to places like this because they don't know what else to do.  It's not like people being able to access healthcare means they just give up, and I see every day how people  work around the problem and seek out less formal means of coping with disability.  Professionals just don't see that every day.  Diversity in terms of skin colour really isn't enough to understand the systemic barriers to access disabled people face, and how these systemic barriers particularly impact certain racial groups.  Let me tell you the #1 thing that has improved access to healthcare services recently - COVID-19 - which has made telehealth so accessible that poor people with health issues who couldn't make it out to distant specialist appointments were suddenly able to see them.\n\nI'm happy for your event and all and that you at least care enough about people to raise this topic.  It's just disappointing that an organisation with plenty of neurodiverse people to have on the panel still doesn't really see the point of representation and think it's better to focus on what professionals think.\n\nP.S. \"Racism impacting neurodivergent people\" I think is better branding.",
      "sentiment": 0.6387
    },
    {
      "id": "fywjibd",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/fywjibd/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "hv3cmo",
      "url": "https://www.reddit.com/r/aspergers/comments/hv3cmo/racism_in_the_neurodivergent_community_panel/",
      "user": "kitkatkommie",
      "text": "Hey all!\n\nIn light of the current national conversation about racial equality, [Celebrating Differences Organization](http://celebratingdifferences.net/) (CDO), a youth-led nonprofit organization focused on promoting neurodivergent inclusivity, awareness and allyship, is hosting a virtual “Racism in the Neurodivergent Community” panel over Zoom on **Saturday, July 25 at 5pm PST**, discussing the ways systemic and social racism is present within the neurodivergent community.\n\nOur panel will include the following speakers…\n\n* **Erica Malena**, licensed clinical social worker and founder of [Touch of Wholeness Psychological Services LLC](https://www.touchofwholeness.org/).\n* **Derrick Erwing,** Regional Sports Director of [Special Olympics Northern California](https://www.sonc.org/).\n* **Anna Wang**, co-founder and Vice President of [Friends of Children with Special Needs](https://fcsn1996.org/) (FCSN).\n* **Karrie Simmons**, neurodivergent awareness advocate.\n\n[**Here**](https://forms.gle/yKWqcfDnpyEHzYsB9) is the interest form for families to sign up to receive the panel Zoom link.",
      "sentiment": 0.9381
    }
  ],
  "edges": [
    [
      "fyqx5pe",
      "hv3cmo"
    ],
    [
      "fyrcyjx",
      "fyqx5pe"
    ],
    [
      "fyrjo7v",
      "fyrcyjx"
    ],
    [
      "fyrk78t",
      "fyrjo7v"
    ],
    [
      "fysseet",
      "hv3cmo"
    ],
    [
      "fyu00xp",
      "hv3cmo"
    ],
    [
      "fyufaq1",
      "fysseet"
    ],
    [
      "fyuk9y3",
      "hv3cmo"
    ],
    [
      "fyuzdvh",
      "fyufaq1"
    ],
    [
      "fywjibd",
      "fyuzdvh"
    ]
  ]
}