{
  "nodes": [
    {
      "id": "gqvihaf",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqvihaf/",
      "user": "oath2order",
      "text": "What's the relevance to this sub?",
      "sentiment": 0.0
    },
    {
      "id": "gqw3iva",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqw3iva/",
      "user": "King_Posner",
      "text": "This one has it, if you read. The constitutional law evolutionary argument is pretty solid, I don’t agree with the conclusion as they only prove economic class is an issue, not an intersected, legally speaking, but it’s a good analysis of the caselaw.",
      "sentiment": 0.7271
    },
    {
      "id": "gqw7kg4",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqw7kg4/",
      "user": "Sandra_Day_Rehnquist",
      "text": "What do they want the court to do about it, rule that wealth must be redistributed on the basis of race?",
      "sentiment": 0.5423
    },
    {
      "id": "gqx8ssz",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqx8ssz/",
      "user": "King_Posner",
      "text": "The article has a series of race neutral action steps that it contends would work. I’m not a personal fan of the ideas, but they are legally kosher (on that ground) and proposed. Maybe read more than the headline?",
      "sentiment": 0.0307
    },
    {
      "id": "gqx8zxb",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqx8zxb/",
      "user": "arbivark",
      "text": "it's connected to timbs v indiana. here is their amicus in timbs. https://www.aclu.org/legal-document/timbs-v-indiana-amicus-brief-0.\nthe linked article above expands on those themes. i've been posting occasionally on the fallout from timbs, which i see as a landmark case.",
      "sentiment": 0.1779
    },
    {
      "id": "gqxf3hi",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxf3hi/",
      "user": "Cwagmire",
      "text": "They propose a few \"race neutral\" actions that are very dumb, but don't involve the courts at all.  Also, calling them \"race neutral\" is largely not true since 1) they are specifically chosen to help one race out in particular, and 2) some of them would absolutely have a disproportionately negative effect on other races, such as through higher taxes.  I have absolutely no doubt that the ACLU and other left-wing groups would jump all over such \"race neutral\" laws and call them racist if their benefits and costs were reversed.",
      "sentiment": -0.7486
    },
    {
      "id": "gqxfw1v",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxfw1v/",
      "user": "Cwagmire",
      "text": "I guess because it cites a couple of cases and proposes some changes to law?  Or because the ACLU wrote it?  IDK, though.  It really does not seem to belong here IMO.  The article really has nothing to do with \"the Supreme Court, the federal judiciary, and constitutional law,\" other than a few, very tangential nods to court cases and the Constitution.",
      "sentiment": 0.4266
    },
    {
      "id": "gqxg74f",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxg74f/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "gqxhgkn",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxhgkn/",
      "user": "King_Posner",
      "text": "There is an irony in that we agree on the landmark, though for different reasons. I see it as proof Thomas’ theory is paying off, he finally has a listener on the bench, he wasn’t speaking to empty air, P&amp;I is on the upswing, now at 200% the original value! \n\nYou see it for the jurisprudential part, and I find that intriguing. Are you reading the clear majority, after all it was 7(1,1)-0, as tea leaves that a test will soon emerge with a ruleset once the right case, something close to call maybe a 5-4/6-3, shows up? I find the lack of a ruleset to be the reason this case is practically useless for marking purposes, sure grisswold opened the door but Roe (Casey) was the landmark.  I’m curious what you’re seeing as a good indicator.",
      "sentiment": 0.8805
    },
    {
      "id": "gqxi910",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxi910/",
      "user": "Sandra_Day_Rehnquist",
      "text": "All of their proposed solutions are merely progressive policy preferences that they claim will reduce black poverty, which is debatable. After all, the War on Poverty has proven beyond a shadow of a doubt that signing poor people checks does not solve poverty.\n\nThey first attempt to argue that President Biden should forgive $50,000 of student loan debt, because they claim that the student loan system \"is racist and predatory\". Yet who would actually benefiting from forgiving that much worth of student loan debt? It would do nothing to help the vast majority of poor people, black and white, who have not attended college. It doesn't even give much help to people who attended your average college. Rather, it benefits doctors and lawyers, and other professionals who took on over $50,000 worth of student loans. These are the very people who need help the least. According to a [recent University of Chicago study](https://bfi.uchicago.edu/wp-content/uploads/2020/11/BFI_WP_2020169.pdf), the top 10% of income earners would see seven times more benefits from such a plan than the bottom 10%. Considering that the stated goal of this program is to lower the racial income gap, it appears to fail marvelously.\n\nTheir second solution is turning the post office into a bank, which they claim would save black families $3,000 a year. I have severe doubts that the US Postal Service would be able to run a profitable bank. Hell, they can't even break even running post offices, and they've had over two centuries of experience on that front.\n\nFinally, they argue that the Child Tax Credit should be radically expanded to fight poverty. If anything, this would be harmful for black children, as well as white children, because it adds to the incentives to have children out of wedlock.\n\nI share your concern for the lack of wealth in certain communities, but the ACLU ignores ideas that would actually make a difference. If they really wanted to make a difference, then they would be advocating for high marriage rates, charter and other alternative schools, and regulatory policies that promote job growth. The problems in the black community today, as well as the white community, can be best solved by promoting marriage. Every piece of evidence has shown that whether of not your parents are married and living together is the number one determinant of your financial outcome in life.",
      "sentiment": 0.7448
    },
    {
      "id": "gqxj1mc",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxj1mc/",
      "user": "arbivark",
      "text": "as usual i find your comments hard to follow. i share thomas' and ij's hope for a rehabilitated p i clause. i'll go reread the thomas concurrence. https://supreme.justia.com/cases/federal/us/586/17-1091/ that was a good read thanks.",
      "sentiment": 0.8591
    },
    {
      "id": "gqxj8tw",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxj8tw/",
      "user": "Sandra_Day_Rehnquist",
      "text": "Right, I don't see why this was posted in r/scotus. Their solutions are entirely policy proposals, which lie with the legislature and executive branch. Their proposed solutions are incredibly dumb. Their first solution primarily benefits well educated professionals, their second is a recipe for incompetence, and their third will further dis-incentivize marriage, which hurts children the most. Hardly a list for closing the racial wealth gap.\n\nDid we learn nothing from the 1960s?",
      "sentiment": 0.1548
    },
    {
      "id": "gqxlund",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxlund/",
      "user": "King_Posner",
      "text": "We both agree it’s landmark. I think it’s landmark because thomas is finally not alone, and has received pay off in the form of Gorsuch agreeing on PI issues. \n\nYou seem to find it landmark on the basis of the jurisprudence itself, in that it’s incorporated. Done so strongly, 7 majority, 1 concurrence, 1 other concurrence. That said, there was no ruleset created, merely it applies, so I am asking how you see this as landmark without any real meat yet. Grisswold opened the door to reproductive rights, but roe (and Casey) is the landmark in that - isn’t this more like Grisswold than Roe? I’m asking why you see it as a landmark without a ruleset, what you’re reading into it.",
      "sentiment": 0.8276
    },
    {
      "id": "gqxm39a",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxm39a/",
      "user": "King_Posner",
      "text": "I specifically said I don’t agree with their proposals, but they do create the action steps they are asking for as opposed to your guess on what asking, and they try to show an evolution (poorly, see my other reply) from early case law to modern to these proposals.",
      "sentiment": 0.5267
    },
    {
      "id": "gqxmkin",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxmkin/",
      "user": "Cwagmire",
      "text": "Haven't you heard?  60s-style segregation is hip again, baby!  As long as the right people are given the segregated, errr, I mean safe, spaces, that is.",
      "sentiment": 0.4926
    },
    {
      "id": "gqxmtjc",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gqxmtjc/",
      "user": "GenJohnONeill",
      "text": "&gt; Hell, they can't even break even running post offices, and they've had over two centuries of experience on that front.\n\nLOL imagine saying this with a straight face. The USPS is such a well-oiled machine that Republican direct efforts to break it and render mail undeliverable largely failed.\n\nThe rest is similar drivel.",
      "sentiment": -0.5372
    },
    {
      "id": "gr2pamn",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gr2pamn/",
      "user": "Viol33",
      "text": "&gt; After all, the War on Poverty has proven beyond a shadow of a doubt that signing poor people checks does not solve poverty.\n\nIt reduced poverty. Not sure what else you wanted it to do...",
      "sentiment": -0.9428
    },
    {
      "id": "gr2viwi",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gr2viwi/",
      "user": "Sandra_Day_Rehnquist",
      "text": "The poverty rate in 1970 was 12.6%. In 2017 (the most recent data that I could find), it was 12.3%. In that half century, it has never dropped beneath 11%, and has only thrice risen above 15%. I'd hardly call that a reduction in poverty.",
      "sentiment": -0.765
    },
    {
      "id": "gr5pdqw",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/gr5pdqw/",
      "user": "Viol33",
      "text": "Why would you start the clock at 1970? The poverty rate was 19% when Johnson introduced the War on Poverty legislation in 1964 (it was in the low 20's in the late 1950s) and has not risen above 15.2% since he left office. You're welcome to come to whatever conclusions you want about why it hasn't gotten any lower, but that's beside the point.",
      "sentiment": -0.5727
    },
    {
      "id": "m4ljb0",
      "url": "https://www.reddit.com/r/scotus/comments/m4ljb0/the_racial_wealth_gap_is_a_civil_liberties_issue/",
      "user": "arbivark",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "gqvihaf",
      "m4ljb0"
    ],
    [
      "gqw3iva",
      "gqvihaf"
    ],
    [
      "gqw7kg4",
      "m4ljb0"
    ],
    [
      "gqx8ssz",
      "gqw7kg4"
    ],
    [
      "gqx8zxb",
      "gqvihaf"
    ],
    [
      "gqxf3hi",
      "gqw7kg4"
    ],
    [
      "gqxfw1v",
      "gqvihaf"
    ],
    [
      "gqxg74f",
      "gqx8ssz"
    ],
    [
      "gqxhgkn",
      "gqx8zxb"
    ],
    [
      "gqxi910",
      "gqx8ssz"
    ],
    [
      "gqxj1mc",
      "gqxhgkn"
    ],
    [
      "gqxj8tw",
      "gqxf3hi"
    ],
    [
      "gqxlund",
      "gqxj1mc"
    ],
    [
      "gqxm39a",
      "gqxi910"
    ],
    [
      "gqxmkin",
      "gqxj8tw"
    ],
    [
      "gqxmtjc",
      "gqxi910"
    ],
    [
      "gr2pamn",
      "gqxi910"
    ],
    [
      "gr2viwi",
      "gr2pamn"
    ],
    [
      "gr5pdqw",
      "gr2viwi"
    ]
  ]
}