{
  "nodes": [
    {
      "id": "g2bnps4",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2bnps4/",
      "user": "SamsonsRevenge",
      "text": "Most of the racism in Lethbridge is due to tensions between the “white” and aboriginal communities. I use “white” because the majority of the population is of that racial orientation. \n\nHonestly most of it isn’t very overt. It’s more discomfort. Most of the homeless drug addicts down town happen to be aboriginal, and there is a very clear social and economic divide. Most people individually aren’t racist, a lot of it is just a defense mechanism for being implied to be racist due to social and economic forces outside of their control. \n\nAnyways, I’m originally from the Calgary area, and I don’t think Lethbridge is really any more or less racist than there. But, I’m also a white male who doesn’t really hang out with racist people. So maybe I just have sample bias.",
      "sentiment": -0.9429
    },
    {
      "id": "g2bot3g",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2bot3g/",
      "user": "Betker01Jake",
      "text": "Racism is an issue nearly everywhere you go. I am a mulatto man so I see some rough stuff for sure. I have been asked if I own my vehicle and have to prove it own it with a bill of sale (which i keep under my seat for this exact reason). For some reasons registration and insurance paper are not enough. I have been followed around stores with my wife and kids. It exists but there are much bigger issues going on right now with medical consent and corporate power to really feel much division is racism. I just biol it down to naivety",
      "sentiment": -0.7351
    },
    {
      "id": "g2bsl9p",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2bsl9p/",
      "user": "Zebleblic",
      "text": "My wife is from india and grew up in the Philippines. She felt more unsafe downtown in lethbrudge than anywhere in the Philippines because of the \"natives\". Her, her Filipino friends, and another person I know from China all have horrible views of natives because of what they see downtown. They are disgusted by them and how they act. Some of them worked at the mall and saw a lot of shit they caused. \n\nMind you, when my wife moved in with me, we had a super nice native lady as our neighbor and it changed her perception of natives. When she moved here for the first few years the only native people she met were the sketchy drugged out homeless people down town. She didn't really interact with any normal natives who live normal lives. And im guessing a lot of people fall into that.",
      "sentiment": -0.1779
    },
    {
      "id": "g2bsrdq",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2bsrdq/",
      "user": "SamsonsRevenge",
      "text": "That’s crazy. You just got pulled over, and made to prove the ownership of your car under the bill of sale? \n\nThat’s so unusual it makes me question if it’s a result of weak profiling. For instance - this screams like a case where a similar car was suspected to have been stolen by a man who only Nd it’s your description because of the colour of his skin. It’s an easy identifier, so it’s naturally used. But it’s awfully and terribly unfair to literally everyone being profiled. I’d be pissed if that happened to me. \n\nDid the police give you any explanation? Did you press them for questions? That’s your right. You can do that if cops do shit like this.",
      "sentiment": -0.9753
    },
    {
      "id": "g2btws9",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2btws9/",
      "user": "Betker01Jake",
      "text": "I never got an explanation. It was a check to and it seems to be going pretty smoothly but ofcourse myself driving with a wife and 3 kids in the back seat must mean I am stealing something. My wife was beyond angry when they asked for more proof that the vehicle was mine. I don't even know why I had it in a glove box, I normally throw them out.\n\nTrust me I have fought stuff like this, I have since made sure all drives are recorded so I can actually prove my word when I make complaints",
      "sentiment": -0.6428
    },
    {
      "id": "g2bu5sr",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2bu5sr/",
      "user": "SamsonsRevenge",
      "text": "That’s a good call.",
      "sentiment": 0.4404
    },
    {
      "id": "g2byn7j",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2byn7j/",
      "user": "Outrageous_Birthday6",
      "text": "A lot of the issues we have are that we live in a society created and maintained by racist values and beliefs and that many of us benefit from those beliefs and values.\n\nIt is very difficult for people to confront racism for that reason. \n\nWe can all (well most people anyway) agree that the residential school system was racist and evil. Alberta had more kids in res school that other provinces. The last res school ended in 1996. \n\nThe reality is that tens of thousands of church officials, government workers, lawyers, social workers, teachers and police officers created and maintained this system of horrific abuse for decades. It’s not an abstract concept. Actual people, many of whom are part of respected professions were involved.\n\nOdds are you know people who were involved in one capacity or an other. \n\nAnd that’s the dilemma right here- that racism is here, we grew up with it, we live with it and we need to all acknowledge the racism within us and try and change.",
      "sentiment": -0.9724
    },
    {
      "id": "g2c3ke6",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2c3ke6/",
      "user": "DJmashedpotatoes",
      "text": "My husband is Native, and I’m mixed Native and white and can pass for white or Latino depending on who you talk to.  Yeah, we’ve faced overt racism. I’ve seen people suddenly become uncomfortable around me when they find out I’m Native.  I’ve heard negative comments about Natives second hand in restaurants. I don’t have to worry about getting followed at shoppers or Walmart when I’m shopping alone, but it’s happened several times when we’re shopping together.\n\nHealthcare workers don’t take us seriously, even though my husband is an RN.  Facebook comments are trash whenever any local news topic about Natives gets posted.   Cops always have something to say.\n\n\n\n\nPeople just make wild assumptions about you.  You prove them wrong, then you’re *not like the other Natives*. \n\nYeah those guys downtown suck, but you have no idea the hell they’ve been through growing up.\n\n\nYeah it’s not overt most of the time, but it’s those little interactions with people that you notice.  I just put my Karen wig on and call that shit out now.  I don’t care if it makes you uncomfortable.",
      "sentiment": -0.9769
    },
    {
      "id": "g2cqamy",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2cqamy/",
      "user": "GetMeABaconSandwich",
      "text": "As a visible minority, I got the EFF out of Lethbridge as soon as i finished school, primarily due to how I was treated growing up.",
      "sentiment": 0.1779
    },
    {
      "id": "g2cy0qn",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2cy0qn/",
      "user": "Walbagger",
      "text": "&gt;I have been followed around stores with my wife and kids.\n\nI'm really sorry that has happened to you.",
      "sentiment": -0.1513
    },
    {
      "id": "g2d9clx",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2d9clx/",
      "user": "piratesmashy",
      "text": "Carding/street checks are a serious issue in Lethbridge. A buddy of mine's (mixed race, male) kids are stopped damned about near every time they drive. \n\nhttps://www.cbc.ca/news/canada/calgary/lethbridge-police-checks-review-annual-report-1.4561435",
      "sentiment": -0.5859
    },
    {
      "id": "g2da7qi",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2da7qi/",
      "user": "peternorthstar",
      "text": "I hate it when my wife and kids follow me around. Just let me go to the Top Hat in peace!!!",
      "sentiment": 0.3561
    },
    {
      "id": "g2dag9f",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2dag9f/",
      "user": "carnsolus",
      "text": "i'm in agreement\n\ni don't think most of lethbridge is the sort of racist where you'd judge someone just for being native, but they might be the sort where their initial reaction to natives isn't a good one\n\nif i see a group of native american males, i'm not going to feel overly safe for a bit, whereas i wouldn't care/notice for other races\n\nmy girlfriend is brown and she's never mentioned feeling discriminated against",
      "sentiment": -0.0927
    },
    {
      "id": "g2dkfk6",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2dkfk6/",
      "user": "skyfelldown",
      "text": "&gt; Most of the homeless drug addicts down town happen to be aboriginal\n\nThis is categorically untrue. I have worked in the addictions field specifically with the homeless population, for the last 10 years. You notice the first nations peoples more. But to say \"most\" are first nations is just plain old factually not true.",
      "sentiment": -0.4585
    },
    {
      "id": "g2dkqm8",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2dkqm8/",
      "user": "skyfelldown",
      "text": "I work in addictions and have for the past 10 years, specifically with our homeless or at-risk population. I am white so I personally have not experienced racism toward myself. But I see it from others against my clients non stop. Subtle things like security asking me if it's okay to let people in to see me because they're \"shady looking\", and then they come in and it's a first nations person.\n\nJust yesterday actually security asked me if someone could come in to see me and stated \"I don't know if he's just wasting everyone's time or if he has a good reason to be here\". wtf kinda judgement is that? So I say of course let him in, that's the point of my being here. And the client comes inside and oh, he's a first nations person.\n\nSecurity have also told me there is \"riff raff\" here to see me. Again, first nations. \n\nSecurity have never said this about white clients. Never. And quite frankly the last time I can recall being threatened or having aggression was from a white client. \n\nIt's just garbage. Such garbage.",
      "sentiment": 0.5643
    },
    {
      "id": "g2dq0ov",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2dq0ov/",
      "user": "SamsonsRevenge",
      "text": "Galt Gardens would be skewing my perception. Perhaps this is an issue of visibility vs the invisible. It does seem most major issues in this town remain largely invisible. So if I was being ignorant there, it is due to my personal experiences.",
      "sentiment": -0.2732
    },
    {
      "id": "g2duibb",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2duibb/",
      "user": "rockclock",
      "text": "I'm just some Arab guy who moved to Lethbridge a year ago and I have not run into any problems with anyone. Normally, I wouldn't add anything to these sorts of conversations since Lethbridge has been good to me, but I imagine the view gets pretty skewed if people like me never speak up.",
      "sentiment": 0.8248
    },
    {
      "id": "g2e2clh",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2e2clh/",
      "user": "skyfelldown",
      "text": "First Nations peoples are 'visible' in that they're 'other'. When we see a disorderly white person we might just assume they're, for lack of a better term, 'white trash' or something. Or because they're white and we're used to white being the 'default' we might not even see that at all! It's like a blind spot really. We just go about our business. But because FN are 'other' we automatically see them, notice them, etc. \n\nBecause you see First Nations peoples in Galt Gardens I can in a way get why a person might hold this belief. But there are over 13,000 members of the Blood Tribe, so who you see in Lethbridge is a tiny, tiny, tiny portion of the Blood Tribe",
      "sentiment": 0.126
    },
    {
      "id": "g2e2kve",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2e2kve/",
      "user": "skyfelldown",
      "text": "in the 'where is home' documentary about lethbridge (on youtube) there's a gentleman who's a paramedic and happens to be first nations, and he speaks about having never experienced racism until he took an EMT position here in lethbridge. ouch.",
      "sentiment": 0.5096
    },
    {
      "id": "g2e3dc9",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2e3dc9/",
      "user": "DJmashedpotatoes",
      "text": "&gt; But there are over 13,000 members of the Blood Tribe, so who you see in Lethbridge is a tiny, tiny, tiny portion of the Blood Tribe\n\nSay it louder for the people in the back.",
      "sentiment": 0.0
    },
    {
      "id": "g2ecylk",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2ecylk/",
      "user": "skyfelldown",
      "text": "thousands and thousands of people living in and around Moses Lake and Standoff and Glenwood, living normal lives, going to work and school, raising their families, farming &amp; ranching, practising their traditions, being regular families like anyone here in Lethbridge is. \n\nThe Blood Reserve is the largest in Canada in both area and population. To think that someone they see downtown is representative of that whole population is ridiculous. Not to mention, those they see down town have families who love them and want healing for them and wish they'd be able to beat their demons and come home. \n\nPeople are so clueless. But it's permitted! We don't learn much in schools or university, so unless you spend significant time with indigenous peoples what could you possibly know? Which is funny because the answer is \"nothing\", yet ignorance will assume and label and decide that things are a certain way regardless. Ugh.",
      "sentiment": 0.8568
    },
    {
      "id": "g2es0zi",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2es0zi/",
      "user": "DJmashedpotatoes",
      "text": "I love this.  Thank you.",
      "sentiment": 0.795
    },
    {
      "id": "g2gb7dg",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2gb7dg/",
      "user": "SamsonsRevenge",
      "text": "You sound like a fundamental Evangelical describing original sin.\n\nIt's easy to just not be racist. View people as individuals, as opposed to groups. It really is just that simple.",
      "sentiment": 0.7446
    },
    {
      "id": "g2gbpg8",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2gbpg8/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2gynli",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2gynli/",
      "user": "Outrageous_Birthday6",
      "text": "It’s easy to yell at some idiots selling shirts that are obviously racist.\n\nIt’s harder to rethink literally everything in our society, to understand why things are the way they are and really think about how we can include everyone and how we can make amends for past injustices.\n\nI’d like to see people think more about their own biases against racialized people and spend less time yelling at idiots selling racist shirts.",
      "sentiment": -0.5574
    },
    {
      "id": "g2h4hq6",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2h4hq6/",
      "user": "skyfelldown",
      "text": "thank you! ♥",
      "sentiment": 0.7901
    },
    {
      "id": "g2h4wrs",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2h4wrs/",
      "user": "SamsonsRevenge",
      "text": "&gt; It’s harder to rethink literally everything in our society, to understand why things are the way they are and really think about how we can include everyone and how we can make amends for past injustices.\n\nWhat is there to really re-think though? We have, at the institutional level, eliminated any semblance of racist, or discriminatory procedures and laws against every conceivable group. \n\nIt's really easy - just treat people as individuals, and treat people with respect. \n\nThat doesn't mean that I buy the argument that Canadian society is white supremacist, or that \"white privilege\" is a valid concept.",
      "sentiment": 0.8016
    },
    {
      "id": "g2hlg96",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2hlg96/",
      "user": "Outrageous_Birthday6",
      "text": "Imagine here if all the landlords and business owners calling out the one idiot selling racist shirts actually looked at themselves and their own practices to see where they could improve. Wouldn’t that be cool?",
      "sentiment": -0.4767
    },
    {
      "id": "g2hlrl3",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2hlrl3/",
      "user": "SamsonsRevenge",
      "text": "Why not just don’t buy the shirt? I don’t feel comfortable with shaming or doxxing people who hold different views than me. I just don’t buy the shirt. I don’t think it requires an additional level of zealotry or activism.",
      "sentiment": 0.5106
    },
    {
      "id": "g2hnxlj",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2hnxlj/",
      "user": "Outrageous_Birthday6",
      "text": "Lol. It’s a fairly expensive shirt with probably stolen art, I don’t know who would buy it. \n\nI guess we will all keep an eye out to discover them in the wild 😜",
      "sentiment": -0.1027
    },
    {
      "id": "g2hpj6o",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2hpj6o/",
      "user": "SamsonsRevenge",
      "text": "That's just it too, like who in the Hell would actually wear this monstronsity in public? It's like a badge saying \"look at me, I'm an asshole\".",
      "sentiment": -0.1531
    },
    {
      "id": "g2ixdoa",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2ixdoa/",
      "user": "Outrageous_Birthday6",
      "text": "Well neck tattoo guy wore the shirt for his interview on Global XD",
      "sentiment": 0.7672
    },
    {
      "id": "g2iyjck",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2iyjck/",
      "user": "batterydies",
      "text": "Am native and can say people are very racist. They’re clever about it too. They’re very under the radar, making backhanded compliments and always quick to say that I’m not like other natives. My least favourite are the ones who are racist, know they are racist, and so they act 10 times nicer to me to make it look like they’re not racist at all, while giving me dirty looks when no one else is around. I do get followed in stores, and I am almost never helped by staff unless I’m the only one left in the store.",
      "sentiment": -0.5453
    },
    {
      "id": "g2j66ge",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2j66ge/",
      "user": "Adilshaykh7",
      "text": "The people in Calgary are so friendly and welcoming move there if you have to. Calgary always felt like home especially at uofc. Lived there for 6 years before moving abroad for school. Now because my parents work in Lethbridge I have to visit this city on and off. Sure not everyone in Lethbridge is racist, but it’s huge. And idc much about it if someone has an opinion or preformed assumptions about me that’s cool. But I worry everyday on the road that a white cop can mess my life up if I’m being stupid. \nWhere a female or white boy would prolly get away had they made the same mistake. \nIf I ever come back to Alberta it will be coz I really want to work at foothills. Calgary made me love Canada and it’s ppl.  Lethbridge has stirred this inner hatred towards Alberta in me and I’m trying to not let it get to me. \nI’m brown and don’t even really look it, can only imagine what ppl with turbans would be going thru. In general the more rural a place, the more backward and racist it is. Go figure.",
      "sentiment": -0.871
    },
    {
      "id": "g2jfo3l",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2jfo3l/",
      "user": "skyfelldown",
      "text": "this is gross and i'm sorry you experience this.",
      "sentiment": -0.5267
    },
    {
      "id": "g2xnduu",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2xnduu/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g2xqb8c",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g2xqb8c/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "g31gal1",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g31gal1/",
      "user": "Iostinpaste",
      "text": "No no you don't understand. The narrative clearly states only caucasians can be racist. We don't want hear the opinions of minorities if it doesn't support the self hating, virtue signaling white narrative. Clearly if you move here from a foreign land it's fine if you don't like the natives because as an ignorant immigrant, you just don't understand. If someone moves from a small Saskatchewan town and comes to the same conclusions that person should know better because they are white and smaht and privileged.",
      "sentiment": 0.4015
    },
    {
      "id": "g31gw3v",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g31gw3v/",
      "user": "Iostinpaste",
      "text": "It's extremely hard to talk of one's biases without being thrown under the bus that is pop culture these days. If you ever start to talk of anything in reality you are painted as a leper and thrown to the wolves. Ideologies are running rampant and mental illness is right behind it.",
      "sentiment": -0.5256
    },
    {
      "id": "g31hecm",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g31hecm/",
      "user": "Iostinpaste",
      "text": "Hey bub, no talking about reality in here. This is a no logic zone. Fucking racist biggot.",
      "sentiment": -0.8268
    },
    {
      "id": "g31hl26",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g31hl26/",
      "user": "Iostinpaste",
      "text": "You don't know what the fuck your talking about lmao",
      "sentiment": 0.1027
    },
    {
      "id": "g31hqrb",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g31hqrb/",
      "user": "Iostinpaste",
      "text": "Who the fuck doesn't know this?",
      "sentiment": -0.5423
    },
    {
      "id": "g31v6t8",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g31v6t8/",
      "user": "Zebleblic",
      "text": "I come from a small town Saskatchewan town. We had a few native families in town that were great people, but then we had the natives come from the reserve who would show up for 2 weeks of work and never show up again after getting a paycheck. They were looked down on and no one wanted to hire them because that ALWAYS happened.",
      "sentiment": -0.0644
    },
    {
      "id": "g32tkjb",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/g32tkjb/",
      "user": "skyfelldown",
      "text": "ok pal",
      "sentiment": 0.296
    },
    {
      "id": "idu5az",
      "url": "https://www.reddit.com/r/Lethbridge/comments/idu5az/racism_in_lethbridge/",
      "user": "GarbageandtheGits",
      "text": "Hopefully this post won’t offend anyone because it’s purpose is to be an open ended conversation and non argumentative. It’s a very sensitive topic but the post is to spark genuine discussion and conversation.\n\nI saw a post earlier on the sub bringing up racism and the post had a fair bit of buzz which got me thinking I wasn’t alone in the whole “Lethbridge racism” thing. It was something I always felt was around and would casually joke with friends about it, but never really got anyone’s genuine experiences on the matter. However, Seeing the post earlier made me interested in what other peoples experiences were on the topic. Growing up in Calgary half of my life left me with a lot of mixed experiences on the matter, but moving to Lethbridge last year made me feel more uncomfortable than I’d ever been in Calgary. There was never any overt experiences I could really attribute to these feelings other than a lot of mistreatment and bullying by new peers—but I’d never feel comfortable jumping to “racism”. \n\nAnother matter different from Calgary (south) is that there’s a high number of indigenous people, toward whom Ive unfortunately heard more racist comments thrown at than any other place I’ve been to. There were always similar hostilities in Calgary, but it feels distinctly greater out here. \n\nWhat are others experiences on the whole topic of racism down here in Lethbridge?",
      "sentiment": -0.969
    }
  ],
  "edges": [
    [
      "g2bnps4",
      "idu5az"
    ],
    [
      "g2bot3g",
      "idu5az"
    ],
    [
      "g2bsl9p",
      "idu5az"
    ],
    [
      "g2bsrdq",
      "g2bot3g"
    ],
    [
      "g2btws9",
      "g2bsrdq"
    ],
    [
      "g2bu5sr",
      "g2btws9"
    ],
    [
      "g2byn7j",
      "idu5az"
    ],
    [
      "g2c3ke6",
      "idu5az"
    ],
    [
      "g2cqamy",
      "idu5az"
    ],
    [
      "g2cy0qn",
      "g2bot3g"
    ],
    [
      "g2d9clx",
      "g2btws9"
    ],
    [
      "g2da7qi",
      "g2cy0qn"
    ],
    [
      "g2dag9f",
      "g2bnps4"
    ],
    [
      "g2dkfk6",
      "g2bnps4"
    ],
    [
      "g2dkqm8",
      "idu5az"
    ],
    [
      "g2dq0ov",
      "g2dkfk6"
    ],
    [
      "g2duibb",
      "idu5az"
    ],
    [
      "g2e2clh",
      "g2dq0ov"
    ],
    [
      "g2e2kve",
      "idu5az"
    ],
    [
      "g2e3dc9",
      "g2e2clh"
    ],
    [
      "g2ecylk",
      "g2e3dc9"
    ],
    [
      "g2es0zi",
      "g2ecylk"
    ],
    [
      "g2gb7dg",
      "g2byn7j"
    ],
    [
      "g2gbpg8",
      "idu5az"
    ],
    [
      "g2gynli",
      "g2gb7dg"
    ],
    [
      "g2h4hq6",
      "g2es0zi"
    ],
    [
      "g2h4wrs",
      "g2gynli"
    ],
    [
      "g2hlg96",
      "g2h4wrs"
    ],
    [
      "g2hlrl3",
      "g2hlg96"
    ],
    [
      "g2hnxlj",
      "g2hlrl3"
    ],
    [
      "g2hpj6o",
      "g2hnxlj"
    ],
    [
      "g2ixdoa",
      "g2hpj6o"
    ],
    [
      "g2iyjck",
      "idu5az"
    ],
    [
      "g2j66ge",
      "idu5az"
    ],
    [
      "g2jfo3l",
      "g2iyjck"
    ],
    [
      "g2xnduu",
      "g2byn7j"
    ],
    [
      "g2xqb8c",
      "g2h4wrs"
    ],
    [
      "g31gal1",
      "g2bsl9p"
    ],
    [
      "g31gw3v",
      "g2gynli"
    ],
    [
      "g31hecm",
      "g2bnps4"
    ],
    [
      "g31hl26",
      "g2e2clh"
    ],
    [
      "g31hqrb",
      "g2ecylk"
    ],
    [
      "g31v6t8",
      "g31gal1"
    ],
    [
      "g32tkjb",
      "g31hl26"
    ]
  ]
}