{
  "nodes": [
    {
      "id": "gvykd4k",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvykd4k/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "gvykr4g",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvykr4g/",
      "user": "Alice__L",
      "text": "&gt;\\#BLM movement are just as racist, if not more so than the KKK\n\nGive me a source where BLM was harassing white people by burning crosses outside their yards, bombed white churces, and/or organized public lynches of white men for looking at black women improperly and then I'll concede to your point.",
      "sentiment": -0.8176
    },
    {
      "id": "gvynjev",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvynjev/",
      "user": "BobsNotMyUncle5050",
      "text": "In example,  Using your example of Citigroup.... current bank loans to businesses  at 100%    ....when demographics are accounted for finalized and outstanding loans, 89% are for businesses wholly majorly  owned by white people. 76.3% of people in USA are white , but they have 89% of Citigroup's loans.. the company is choosing to remedy their inequities",
      "sentiment": 0.3612
    },
    {
      "id": "gvynsie",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvynsie/",
      "user": "BobsNotMyUncle5050",
      "text": " Marching against people of color moving into your neighborhood , kkk...... and marching against  people being murdered for the color of their skin BLM.......not the same",
      "sentiment": -0.6597
    },
    {
      "id": "gvyp6mu",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvyp6mu/",
      "user": "spacewxyz",
      "text": "The solution to differences in society isn't discrimination or racism or sexism. For example, the fact that most women are nurses doesn't mean we should have initiatives that give male nurses benefits over female nurses. \n\nWhat citigroup should be doing is providing benefits based on class, not race. Then naturally what should happen is that because black and latino people tend to be poorer, they will happen to benefit from it more, but it didn't require racism and discrimination. Poor Asian and white people, although less numerous per capita, wouldn't get screwed over because of racism",
      "sentiment": 0.4078
    },
    {
      "id": "gvyq73h",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvyq73h/",
      "user": "[deleted]",
      "text": "[deleted]",
      "sentiment": 0.0
    },
    {
      "id": "gvyr3f4",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvyr3f4/",
      "user": "Alice__L",
      "text": "Give me a source of BLM orchestrating the killing of a white person instead of this bullshit.\n\nJust because a random black person is a murderer doesn't mean the murder was done by BLM, unlike the KKK who actively organized lynchings and bombings.",
      "sentiment": -0.8577
    },
    {
      "id": "gvyrnhn",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvyrnhn/",
      "user": "the_Fe_XY",
      "text": "I think the underlying problem with your question is that it assumes a zero-sum game where for every loan a black person receives, a white/asian person does not receive one. This is not discrimination *against* white/asian people, it is a conscious decision to be more inclusive of black-owned businesses.  A bank is not raising standards for one ethnic group, it sounds like they are taking into account the race of a business owner and using that as a soft factor in their favor. \n\n&amp;#x200B;\n\nI don't really have much on hand in terms of discrimination by private actors, but I think this would be okay even if it were a state-sectioned lending program. As you know from cases like masterpiece cake-shop, private businesses are given a bit more latitude in terms of what is \"discriminatory.\" However, If Citigroup is using race as a soft factor that only works as a positive for black businesses, then this is not discrimination. I would also argue that there is a compelling interest by Citigroup to diversify their business loans by race because black business owners are not necessarily building the same businesses as whites, as evidenced by  *Fullilove v. Klutznick.*",
      "sentiment": 0.9728
    },
    {
      "id": "gvytdqg",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvytdqg/",
      "user": "fzylqd",
      "text": "Because white people ruined earth",
      "sentiment": -0.4767
    },
    {
      "id": "gvyyafj",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvyyafj/",
      "user": "bug-hunter",
      "text": "Some reasons:\n\n* Most of these companies have either intentionally or unintentionally discriminated against non-white borrowers, often for years.\n* Many of these companies simply never bothered to advertise to black communities or place branches in those communities, or underserved these communities.\n* In many cases, minority owned businesses have not had access to the same services. One glaring example was with PPP loans, where [minority owned companies often last to receive (or too late to receive) funds.](https://www.cbsnews.com/news/minority-owned-businesses-were-last-to-receive-ppp-loans-adding-to-their-despair/)\n\nYour argument assumes that somehow all things are even fair now, even though objective evidence shows they are not. Your argument about SAT scores implicitly ignores the well known factors of that lead to those reduced scores.",
      "sentiment": 0.4352
    },
    {
      "id": "gvz3i2y",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gvz3i2y/",
      "user": "Pet_me_I_am_a_puppy",
      "text": "Who says they will get screwed over because of racism? Maybe current company policies are what are discriminatory and they are just getting rid of those policies. (See redlining.) Making the playing field even does not mean the formerly benefited group is now being discriminated against. It's just a much better sound bite to say, \"we are focusing more on X community,\" when really all they have done is change their policies/risk profile on income and address.",
      "sentiment": -0.5574
    },
    {
      "id": "gw0eedi",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gw0eedi/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "gw0f9c3",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gw0f9c3/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "gw0gmxa",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gw0gmxa/",
      "user": "spacewxyz",
      "text": "The article about citigroup clearly stated they intend to lend to black businesses more. They are going to reach out to black businesses specifically, and give them investments. That's race based investments. An Asian or white person won't receive those same benefits for their business, even if they're poor and started off worse than the black business owner. And sure, I absolutely welcome an even playing field totally independent of race. If there are specific discriminatory policies that target black people based on their race, those should absolutely be removed. I'm not aware of company policies targeting black people, but if they exist I welcome them being removed. Correlation isn't causation though, so just because certain policies have created results that are seemingly inequitable, that doesn't mean the policy itself caused the inequality. Like income tax breaks will happen to benefit Asians more, but that doesn't mean income tax breaks are racist against black people just because they happen to benefit Asian people more.\n\n I ultimately believe that a black business owner and Asian business owner should not be treated differently because of their race. I will never change on my position that people should not be discriminated based on their race, and I also believe that your skin color shouldn't determine what kind of benefits you get. Treating them differently based on race is textbook discrimination. \n\nINB4: Oh well whites and Asians have been receiving special benefits for a long time now, therefore we need to reverse the polarity to account for that. Fact, individuals should not be treated because of statistics about their race. The fact that Asians have the highest income doesn't mean all Asians have a high income or have received benefits. Similarly, the fact that African Americans tend to be involved with crime more often on average compared to other races doesn't mean we should treat all black people as criminals. That's intolerable. That's why race based policies make no sense. They are fallacious generalizations that are completely unjustified and destroy the value of the individual. We can implement policies that aren't race specific but will happen to benefit black and latinos more. By implementing policies that help the poor, that will indirectly benefit black people and latinos more because they tend to be more poor.  We can help black and latino communities without resorting to discrimination.",
      "sentiment": 0.9784
    },
    {
      "id": "gw0gp5b",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gw0gp5b/",
      "user": "the_Fe_XY",
      "text": "&gt;Actually it has nothing to do with a zero sum game or if it would benefit society.\n\nThat is literally part of the equal protection analysis performed by the supreme Court to see if it is racially discriminatory though... However, you are asking me to distill hundreds of pages of judicial opinions into talking points for an internet debate where, candidly, I don't think you engaging in a good faith discussion so much as looking for some reason to be upset. I'm going to end this here and inform you that racially blind practices are not considered effective within american law. Using class is not considered effective as a proxy for addressing systematic inequality within american law. The us government is, technically, allowed to discriminate based on race if the reason is good enough. \n\nI would encourage you to do some research on scotus opinions about affirmative action. They pretty much address what you are talking about in fisher v. Texas and, spoiler alert, the supreme court disagrees with you.",
      "sentiment": 0.9294
    },
    {
      "id": "gw0ieda",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/gw0ieda/",
      "user": "spacewxyz",
      "text": "Well you're wrong, and fisher v. Texas was a 4-3 decision with strong dissent. With all of Trump's latest picks, its doubtful that it would have gone the way it did. So saying \"the supreme court disagrees with you\", isn't really true whatsoever, nor does this particular case undermine anything i've said philosophically or logically. The majority position even stated that the university should:  \"tailor its approach in light of changing circumstances, ensuring that race plays no greater role than is necessary to meet its compelling interest.\" Yes the majority here thinks race should be a factor, but only to a limited extent.\n\n\" Using class is not considered effective as a proxy for addressing systematic inequality within american law. The us government is, technically, allowed to discriminate based on race if the reason is good enough. \"\n\nAccording to who? Class is an amazing way to address inequality. And no, the US government isn't \"technically\" allowed to discriminate. Period. Read up on federal laws against discrimination.\n\n[https://www.justice.gov/crt/federal-protections-against-national-origin-discrimination-1](https://www.justice.gov/crt/federal-protections-against-national-origin-discrimination-1)",
      "sentiment": 0.8187
    },
    {
      "id": "mz4jax",
      "url": "https://www.reddit.com/r/legaladviceofftopic/comments/mz4jax/how_is_it_legal_for_companies_to_target_black_and/",
      "user": "spacewxyz",
      "text": "I've seen a lot of companies put forward various initiatives to provide benefits for black and latino individuals as part of an \"anti\" racist agenda. Citigroup said it was going to invest more in black owned businesses for example. I dont understand how these kinds of actions are legal. It sounds like discrimination. First of all how are they going to evaluate if it's a black owned business. Can I just claim I'm a black owned business because I had a black ancestor 5 generations ago and a tan? Can darker skinned Indian or Jamaican people be considered black or is just African Americans with more than 10% African genes . Any kind of racial evaluation for investment seems like an inherently racist and discriminatory endeavor. It's inherently segregating. The other question I have is that will poor Asian and white business owners not get the same treatment and benefits based on their skin color? Seems completely absurd and illegal. Well because your race tends to do better, it doesn't matter that you're poor and struggled to create your business. It sure reminds me of how Asians need 200-300 more points on their SATs at Stanford name Harvard compared to black applicants. My bet is that Asians and white business owners will need a higher credit score and more equity ( irony alert) than black business owners purely based on race. Cam someone please explain how this is legal or fair?",
      "sentiment": 0.5004
    }
  ],
  "edges": [
    [
      "gvykd4k",
      "mz4jax"
    ],
    [
      "gvykr4g",
      "gvykd4k"
    ],
    [
      "gvynjev",
      "mz4jax"
    ],
    [
      "gvynsie",
      "gvykr4g"
    ],
    [
      "gvyp6mu",
      "gvynjev"
    ],
    [
      "gvyq73h",
      "gvykr4g"
    ],
    [
      "gvyr3f4",
      "gvyq73h"
    ],
    [
      "gvyrnhn",
      "mz4jax"
    ],
    [
      "gvytdqg",
      "mz4jax"
    ],
    [
      "gvyyafj",
      "mz4jax"
    ],
    [
      "gvz3i2y",
      "gvyp6mu"
    ],
    [
      "gw0eedi",
      "gvyrnhn"
    ],
    [
      "gw0f9c3",
      "gvyyafj"
    ],
    [
      "gw0gmxa",
      "gvz3i2y"
    ],
    [
      "gw0gp5b",
      "gw0eedi"
    ],
    [
      "gw0ieda",
      "gw0gp5b"
    ]
  ]
}