{
  "nodes": [
    {
      "id": "1395740077733695496",
      "url": "https://twitter.com/Theame21/status/1395740077733695496",
      "user": "Theame21",
      "text": "Of Christians a lot of these young men and women we're seeing getting killed are coming from Christian homes this is an attack on the Christian community, we need to address this now Mom and Daddy may be Christian but somewhere the child may have become rebellious",
      "sentiment": -0.765
    },
    {
      "id": "1395741355398336515",
      "url": "https://twitter.com/Theame21/status/1395741355398336515",
      "user": "Theame21",
      "text": "This is being called by the MIGHTY NAME THROUGH THE POWERFUL BLOOD  OUR LORD AND SAVIOR JESUS CHRIST THROUGH HIS  POWERFUL BLOOD. THE PRINCIPALITIES IS HERE.",
      "sentiment": 0.7944
    },
    {
      "id": "1395740268398268417",
      "url": "https://twitter.com/Theame21/status/1395740268398268417",
      "user": "Theame21",
      "text": "Because of because of a lot of the influence of antichrists and the attack against a lot of our homes and a lot of our people in our community is not being recognized as also it would be as anti-semitic or being anti-muslim. So this great revival needs to take place to redeem",
      "sentiment": 0.4807
    },
    {
      "id": "1395739732093636608",
      "url": "https://twitter.com/Theame21/status/1395739732093636608",
      "user": "Theame21",
      "text": "I bet you the Jewish people will be in worship every Saturday they don't have to work on a job. All the Muslims have to do is just gather together by the billions I bet you they will be in worship at the mosque. But there's a problem when it comes to protecting the rights of",
      "sentiment": -0.3291
    },
    {
      "id": "1395739529143853058",
      "url": "https://twitter.com/Theame21/status/1395739529143853058",
      "user": "Theame21",
      "text": "Our country has inadvertently let us down really with laws that protect people of and and their religious practices and you know one of the things that I have noticed is that all the Jewish person has to say is there being anti-semitic;",
      "sentiment": 0.3818
    },
    {
      "id": "1395739277959573506",
      "url": "https://twitter.com/Theame21/status/1395739277959573506",
      "user": "Theame21",
      "text": "I've been told there needs to be a mess fasting in prayer because this angel that is here now is not here the play this angel of principalities is not happy.",
      "sentiment": -0.7604
    },
    {
      "id": "1395739045297274883",
      "url": "https://twitter.com/Theame21/status/1395739045297274883",
      "user": "Theame21",
      "text": "But what about that 100 sheep throughout the community God didn't leave that sheep and neither should y'all. You pastors and bishops y'all need to get together and have this revival and you need to start reaching these young men these young women.",
      "sentiment": 0.6214
    },
    {
      "id": "1395738887650217986",
      "url": "https://twitter.com/Theame21/status/1395738887650217986",
      "user": "Theame21",
      "text": "If we want to see a change in our communities you have to go to the highways and the byways and start reintroducing yourself God left the 99 to go get that 100 sheep. It's all well and good we can get with those that are reachable and want to be there;",
      "sentiment": 0.7717
    },
    {
      "id": "1395738556006555648",
      "url": "https://twitter.com/Theame21/status/1395738556006555648",
      "user": "Theame21",
      "text": "Our families this revival is imminent if we don't start calling these revival through the community and becoming more proactive with regaining the great falling away. This angel of principalities is not been sent here to play with anyone.",
      "sentiment": 0.8399
    },
    {
      "id": "1395738334295638019",
      "url": "https://twitter.com/Theame21/status/1395738334295638019",
      "user": "Theame21",
      "text": "One of the things that the African-American community is suffering because of this is one the police brutality that's been going on that's one two the mental illness and the broken relationships that are happening in the community between African American men women our children",
      "sentiment": -0.9169
    },
    {
      "id": "1395738011531350018",
      "url": "https://twitter.com/Theame21/status/1395738011531350018",
      "user": "Theame21",
      "text": "There's a lot of things that are affecting the African-American community, one of these things is the violence that's been going on in our communities but when you turn away from God it must be understood when you turn away from God you're turning yourself over to God knows what;",
      "sentiment": 0.6597
    },
    {
      "id": "1395737781234700294",
      "url": "https://twitter.com/Theame21/status/1395737781234700294",
      "user": "Theame21",
      "text": "This is imminent there must be a revival through the African-American communities the covid revival, the call for fasting and praying this is imminent the pastor's y'all must get together and call this revival throughout the African-American community.",
      "sentiment": 0.3612
    },
    {
      "id": "1395736874828935169",
      "url": "https://twitter.com/Theame21/status/1395736874828935169",
      "user": "Theame21",
      "text": "@BishopJakes \\nI have been told that the angel of principalities is here, there must be a revival, there must be a covid-19 revival to take place throughout the communities.",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "1395740077733695496",
      "1395739732093636608"
    ],
    [
      "1395741355398336515",
      "1395740077733695496"
    ],
    [
      "1395740268398268417",
      "1395740077733695496"
    ],
    [
      "1395739732093636608",
      "1395739529143853058"
    ],
    [
      "1395739529143853058",
      "1395739277959573506"
    ],
    [
      "1395739277959573506",
      "1395739045297274883"
    ],
    [
      "1395739045297274883",
      "1395738887650217986"
    ],
    [
      "1395738887650217986",
      "1395738556006555648"
    ],
    [
      "1395738556006555648",
      "1395738334295638019"
    ],
    [
      "1395738334295638019",
      "1395738011531350018"
    ],
    [
      "1395738011531350018",
      "1395737781234700294"
    ],
    [
      "1395737781234700294",
      "1395736874828935169"
    ]
  ]
}