{
  "nodes": [
    {
      "id": "gapu8gj",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gapu8gj/",
      "user": "w11t",
      "text": "Kamala Harris announced her intention to equalize pay between \"latina women\" and \"white men\" ... [this will be a major focus for her administration](https://twitter.com/KamalaHarris/status/1321879231794712576). Raising the minimum wage for all? No. Equalizing things that can't be equalized? Yeah let's do that pandering for 4 years. Guys be real, Kamala isn't gonna do $15 min wage or equalize latina women and white man pay. It's weird to focus in on groups the way she does. It's all words.\n\nIs this who you want the first woman president to be?",
      "sentiment": -0.5615
    },
    {
      "id": "gaq3irx",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaq3irx/",
      "user": "seriousbangs",
      "text": "I think rather than specific policy we need to focus on Voting Rights. Push for Automatic Voter Registration &amp; Universal Mail In Voting for a start. That in turn will make it easy to vote, leading to less voter suppression and more young folks voting.\n\nAlso we need to get the the third parties to stop going on about 5% and start working on Ranked Choice Voting. Our First Past The Post System means there will be no viable 3rd parties.\n\nLastly we need to kill off the 2 big wedge issues. \n\nDrop Gun Control. Completely. You're never going to win it, all you're going to do is lose elections. Let people have their freaking guns. You'll save more lives that way. \n\nNext, we need to stop saying \"pro-choice/life\". This is the right wing framing and it was chosen specifically because both are good things and hard to argue against. \n\nCall it what it is, Criminalization, and remind people that when it's illegal there has to be punishment, the punishment will be death or life in prison and it will be applied to miscarriages.",
      "sentiment": -0.9817
    },
    {
      "id": "gaq4v34",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaq4v34/",
      "user": "amber-ri",
      "text": "Like an atwater strategy, but for the left",
      "sentiment": 0.1901
    },
    {
      "id": "gaq6sip",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaq6sip/",
      "user": "FinalBoss1010",
      "text": "Inequality is a complex issued cause by a shit ton of variables.  The solution is never going to be something as simple as \"raise the minimum wage\".  \n\nBut yes, I think going the identity politics route, is a bad idea.  For instance, if people were protesting against police violence and abusive of authority period, I think they woudl have more allies and less enemies, then by making it a racial thing.  If you solve the problem of police abuse of authority and lack of accountability, you solve the problems with it for minorities and everyone else.\n\nThing is, the fields of critical theory have a pretty solid hold across the universities, and they're churning out \"activists\" left and right, who have no option but to go to the left, and try to twist it into what they want.  Identity politics isn't going anywhere, and it only makes things worse, it just creates more and more lines to divide ourselves by.",
      "sentiment": -0.9879
    },
    {
      "id": "gaqaqbc",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqaqbc/",
      "user": "thatspositive",
      "text": "&gt;Women make less than women (waitress vs. Jennifer Lawrence)\n\nWhy did the waitress decide to be a waitress and not Jennifer Lawrence?",
      "sentiment": 0.0
    },
    {
      "id": "gaqarsg",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqarsg/",
      "user": "GenderNeutralBot",
      "text": "Hello. In order to promote inclusivity and reduce gender bias, please consider using gender-neutral language in the future.\n\nInstead of **waitress**, use **server**, **table attendant** or **waitron**.\n\nThank you very much.\n\n^(I am a bot. Downvote to remove this comment. For more information on gender-neutral language, please do a web search for *\"Nonsexist Writing.\"*)",
      "sentiment": 0.8074
    },
    {
      "id": "gaqask8",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqask8/",
      "user": "AntiObnoxiousBot",
      "text": "Hey /u/GenderNeutralBot\n\nI want to let you know that you are being very obnoxious and everyone is annoyed by your presence.\n\n^(I am a bot. Downvotes won't remove this comment. If you want more information on gender-neutral language, just know that nobody associates the \"corrected\" language with sexism.)\n\n_^(People who get offended by the pettiest things will only alienate themselves.)_",
      "sentiment": -0.8221
    },
    {
      "id": "gaqb46o",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqb46o/",
      "user": "Drakovar",
      "text": "Fighting against inequality is not a fight for exact equality. \nStaying within a ratio between 1 and... 30? 7? Sure why not. But right now its between 1 and.. 300 and some i think. \nThats the subject, not \"equality of outcome is a myth\"",
      "sentiment": 0.2148
    },
    {
      "id": "gaqe14w",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqe14w/",
      "user": "thatspositive",
      "text": "Lol",
      "sentiment": 0.4215
    },
    {
      "id": "gaqu9rf",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqu9rf/",
      "user": "w11t",
      "text": "You will always be fighting because equality doesn't exist between any 2 people let alone any 2 groups or genders or races or societies or countries or planets",
      "sentiment": -0.5423
    },
    {
      "id": "gaqud3u",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gaqud3u/",
      "user": "DiversityDan79",
      "text": "Race issues are too important to minority groups to ignore it. You can see this in the fact that the blacks etc. supported Biden over Bernie. Bernie's policy would have been better for minorities, but he was addressing their issues on even a shallow level.",
      "sentiment": 0.3071
    },
    {
      "id": "garrijm",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/garrijm/",
      "user": "West_Ad_7303",
      "text": "90% of Americans support universal background checks, the republicans always flip the argument and start claiming that the democrats want to to ban guns and the democrats don't have a response because they are totally incompetent when it comes to making arguments.\n\nAnything beyond background checks isn't going to happen because it doesn't have widespread popular support.\n\nBeto coming out and supporting a gun ban was just stupid because:\n\nA: It's never going to happen because it doesn't have popular support.\n\nB: It'll hurt any his chances when running in an election in the future.",
      "sentiment": -0.9662
    },
    {
      "id": "gasodbf",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gasodbf/",
      "user": "Rora999",
      "text": "&gt;Top\n\nIs this a serious comment or are you fucking with us?",
      "sentiment": -0.0772
    },
    {
      "id": "gatiiud",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gatiiud/",
      "user": "seriousbangs",
      "text": "Opinion Polls do not a voter make.",
      "sentiment": 0.0
    },
    {
      "id": "gau8aui",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/gau8aui/",
      "user": "thatspositive",
      "text": "Why does the waitress complain about not earning enough when she could have just choose to be a famous actress?",
      "sentiment": -0.3612
    },
    {
      "id": "jlmu8v",
      "url": "https://www.reddit.com/r/seculartalk/comments/jlmu8v/strategy_shift_should_the_left_stop_talking_about/",
      "user": "w11t",
      "text": "**&gt;Women make less than men!!**\n\nWomen make less than women (waitress vs. Jennifer Lawrence)\n\n**&gt;Black people make less than white people!!**\n\nBlack people make less than black people (construction vs. LeBron James)\n\n**&gt;Group A makes less than Group B!!!!**\n\nPeople in Group A make less than others in Group A.\n\nPeople in Group B make less than others in Group B.\n\n...\n\nEquality doesn't exist between 2 genders.\n\nEquality doesn't exist WITHIN genders.\n\nEquality doesn't exist between 2 races.\n\nEquality doesn't exist WITHIN races.\n\nEquality doesn't exist between 2 people.\n\nEquality doesn't exist between 2 groups.\n\nEquality doesn't exist between 2 societies.\n\nEquality doesn't exist between 2 countries.\n\nEquality won't exist between 2 planets.\n\nEquality doesn't exist nor has it ever. Equal implies \"no differences\" but ***fairness*** implies \"just treatment\" ... either way, who cares, focus on specific policy proposals.",
      "sentiment": 0.7326
    }
  ],
  "edges": [
    [
      "gapu8gj",
      "jlmu8v"
    ],
    [
      "gaq3irx",
      "jlmu8v"
    ],
    [
      "gaq4v34",
      "jlmu8v"
    ],
    [
      "gaq6sip",
      "jlmu8v"
    ],
    [
      "gaqaqbc",
      "jlmu8v"
    ],
    [
      "gaqarsg",
      "gaqaqbc"
    ],
    [
      "gaqask8",
      "gaqarsg"
    ],
    [
      "gaqb46o",
      "jlmu8v"
    ],
    [
      "gaqe14w",
      "gaqarsg"
    ],
    [
      "gaqu9rf",
      "gaqb46o"
    ],
    [
      "gaqud3u",
      "jlmu8v"
    ],
    [
      "garrijm",
      "gaq3irx"
    ],
    [
      "gasodbf",
      "gaqaqbc"
    ],
    [
      "gatiiud",
      "garrijm"
    ],
    [
      "gau8aui",
      "gasodbf"
    ]
  ]
}