{
  "nodes": [
    {
      "id": "glkqy70",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkqy70/",
      "user": "AutoModerator",
      "text": "Join the Labour Socialists Discord Server to meet some friendly British socialists https://discord.gg/S8pJtqA, subscribe to r/GreenAndPleasant for all things UK, r/DWPHelp for benefits and welfare support and r/BAME_UK for issues affecting ethnic minorities. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Labour) if you have any questions or concerns.*",
      "sentiment": 0.8519
    },
    {
      "id": "glkr164",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkr164/",
      "user": "Spekeboy",
      "text": "I’m guessing...some strongly worded motions at CLPs and branches. \n\nThat ought to do it!",
      "sentiment": 0.3382
    },
    {
      "id": "glkrldr",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkrldr/",
      "user": "Resolvent_Mule",
      "text": "We're in a pandemic. Closing the borders is common sense. Starmer is doing a fantastic job as leader of the opposition. Care to explain the racism or perhaps sarcasm to me?",
      "sentiment": 0.2023
    },
    {
      "id": "glks7mz",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glks7mz/",
      "user": "Spekeboy",
      "text": "You can have people coming in with a robust test and trace system. \n\nKeith just wants to be able to shout ‘close the borders’ at the red wall. \n\nI’m not surprised that someone who thinks Starmer is doing a ‘fantastic job’ doesn’t know what racism looks like. \n\nIf he’s doing such a fantastic job, why are 100,000 people dead due to Tory corruption and incompetence and he’s still 4 points behind in the polls? Hmmm? \n\nPeople like you are the death of the Labour Party",
      "sentiment": -0.7119
    },
    {
      "id": "glksjwu",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glksjwu/",
      "user": "the6thmonkey",
      "text": "I'm all for criticising Starmer and Labour as it is right now but this message is about enforcing lockdown and stopping more infected individuals from arriving.\n\nTo be honest the message is ridiculously late but it isn't based on race.  \nPlease criticise Keir based on the right wing pandering he does because there is plenty of it.\n\nThere is no need to attack based on things where nothing is clearly wrong as it will give them ammo to use against us.",
      "sentiment": -0.9266
    },
    {
      "id": "glksmh0",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glksmh0/",
      "user": "Resolvent_Mule",
      "text": "Just like notorious racist Jacinda Ardern. I think you're losing touch with reality my friend.\n\nThe boost for the Tories seems to be from their successful vaccine rollout. People are fickle and have short memories.\n\nPlus if I recall correctly, Corbyn was the death of the Labour party. Now we have a parliamentary term in which the Tories can do as they please, without the numbers on the opposition benches to stop them. If only Starmer had become leader sooner.",
      "sentiment": 0.1531
    },
    {
      "id": "glkt3pc",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkt3pc/",
      "user": "Spekeboy",
      "text": "Who is ‘us’? Who is ‘them’? \n\nWhy is this targeted at red wall voters? \n\nFunny how places like South Korea don’t have closed borders just effective test and trace. \n\nAnd how is it that Keith can call for schools to be open but borders to be closed?",
      "sentiment": 0.6917
    },
    {
      "id": "glktag9",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glktag9/",
      "user": "Spekeboy",
      "text": "Oh this is embarrassing for you. New Zealand doesn’t have closed borders. Just stringent quarantine and testing rules. \n\nAre you a professional thundering dumbass or is it just a hobby?",
      "sentiment": -0.7351
    },
    {
      "id": "glkto4w",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkto4w/",
      "user": "Resolvent_Mule",
      "text": "You should have listened to PMQs. Kier called for a system akin to that in NZ, but funnily enough not as strict as to travel to NZ you have to within a particular class or request approval to travel ahead of your trip. Kier is advocating having people quarantine in airport hotels at their expense. Seems a good idea to me. \n\nYou should listen to your dear leader.",
      "sentiment": 0.9455
    },
    {
      "id": "glktu7m",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glktu7m/",
      "user": "Spekeboy",
      "text": "That’s not in the poster is it dumbfuck? \n\nIt just says ‘borders are open’. No wonder black people are leaving Labour with dogwhistling like this.\n\nAnd he ain’t my leader. I’m not in Labour. I left when they elected the guy who let Jimmy Savile get away with paedophilia as leader.",
      "sentiment": 0.0772
    },
    {
      "id": "glkufe0",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkufe0/",
      "user": "Resolvent_Mule",
      "text": "When your argument descends into calling people dumbfucks, I think you've lost the argument.\n\nAn open border means you can travel freely without any impediments. Starmer is advocating restrictions on travel and policies which will help stop the spread of new variants. \n\nIn any ordinary circumstance, it would be a horribly racist poster, but we are in extraordinary times. The aim of the poster isn't to appeal to the right, it is merely to show how inept BoJo is, in light of having no restrictions on travel for much of the last 12-months.",
      "sentiment": -0.7391
    },
    {
      "id": "glkusws",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkusws/",
      "user": "articleofpeace",
      "text": "Out of interest, what is it specifically that makes you think Starmer is doing 'fantastically' as LOTO?\n\nIs it Starmer's complete abandonment of left wing principles and policy that make you think he's doing well? Is it his opposition to the unions, and alienation of them to such a degree they're extracting their funding from the party, which he seems to be replacing with landlords and wealthy donors? Or would it be his abject failure to grasp and control the narrative, thereby ceding it to the Tories and likely gifting them another generation in power? Or is it his focus on changing party rules, issuing authoritarian diktats, expelling members, and pursuing legal action against the left wing members of the Party? Is it his normalisation of transphobia or his selective, racist, and dehumanising politicisation of anti-semitism? Perhaps it's Mr Abstain's total failure to actually *oppose* that you like? \n\nMaybe it's his total inability to actually get ahead of the Tories - or even match Corbyn's polling numbers -, despite having an unprecedentedly sycophantic media and the Tories having a buffoon in charge during a pandemic that they've world-leadingly bungled, while also pursing one of the most significant constitutional changes in British history, under brexit, that (again) they've managed to completely cock up, and after a decade of their austerity measures that have crippled the economy.\n\nEach to their own. Personally I think 'successful opposition' requires both 'success' and 'opposition', neither of which Mr Suit can make any claim to.",
      "sentiment": 0.6569
    },
    {
      "id": "glkv1m5",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkv1m5/",
      "user": "articleofpeace",
      "text": "&gt;In any ordinary circumstance, it would be a horribly racist poster, but we are in extraordinary times.\n\nSo what you're saying is either:\n\n1. It is a horribly racist poster, but this horrible racism is justifiable in extraordinary times.\n2. It is not a horribly racist poster, because extraordinary times have somehow transmuted it into a fundamentally different poster.\n\nCan you explain this please?\n\nI'm not interested in the 'aim' of the poster. Most sexist, transphobic, racist, anti-semitic etc things don't *aim* to be prejudiced. That's not relevant.",
      "sentiment": -0.9839
    },
    {
      "id": "glkv5mz",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkv5mz/",
      "user": "Resolvent_Mule",
      "text": "It's all about context and there's no need to be deliberately belligerent.",
      "sentiment": -0.296
    },
    {
      "id": "glkvmat",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkvmat/",
      "user": "articleofpeace",
      "text": "Can you explain yourself?\n\nIt looks very like you're saying racist dogwhistles are justifiable because we're in a pandemic.\n\nRacism is banned on this sub.\n\nThere's nothing belligerent in my comment and I find it extremely suspect that you've chosen to accuse me of that instead of answering an accusation of racism.",
      "sentiment": -0.9565
    },
    {
      "id": "glkvtwy",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkvtwy/",
      "user": "Resolvent_Mule",
      "text": "I'm saying that the poster, absent a global pandemic, is offensive. In the context of a global pandemic where countries globally are limiting entry or even closing borders, it is good policy to not have open borders.\n\nIn the context race doesn't come into it. Context is everything my friend.",
      "sentiment": 0.4767
    },
    {
      "id": "glkwded",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkwded/",
      "user": "Spekeboy",
      "text": "Your racism justifications are nowhere on that poster. That’s how dog whistles work. \n\nNowhere does it say improved test and trace or improved quarantine regulations. Aimed at a part of the world the Labour Party perceives to be xenophobic, it simply references ‘OPEN BORDERS’. \n\nI know Libs are thick as pigshit but even you have to grasp the concept of a dog whistle",
      "sentiment": 0.34
    },
    {
      "id": "glkyir5",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkyir5/",
      "user": "articleofpeace",
      "text": "Context is everything, I agree: that's why it's bizarre that you're denying its context.\n\nThe pandemic adds a context. It doesn't override or remove other contexts. Starmer knows this. The poster is very clearly playing on the rhetoric of racism with open/closed borders, in an attempt to play to the sensibilities of brexit types.",
      "sentiment": 0.0442
    },
    {
      "id": "glkzc61",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glkzc61/",
      "user": "Resolvent_Mule",
      "text": "The overriding context at the moment for international travel is all about the pandemic. The issue of open/closed borders has never been a matter of public health the scale of which it is now. \n\nIt's definitely point scoring against the Tories, but I do not see the issue with making a point over the fact that our borders have been as open as a polyamorous relationship for large swathes of the pandemic.",
      "sentiment": 0.2054
    },
    {
      "id": "gll24e9",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/gll24e9/",
      "user": "articleofpeace",
      "text": "One context does not and cannot 'override' others. The whole point of this kind of text and media is that it's polysemic: it ties into a range of different trends and issues. In this sense, there's no reason to believe that the pandemic is even the *primary* intended referent, given that it's been precisely a month since we fully exited the EU; an issue that was entirely focussed around border rhetoric.\n\nIf you're going to claim that this poster about the dangers of open borders actively precludes reference to the primary, best known, and most passionately argued immediately relevant discussion about the dangers of open borders in the UK then you're going to need to make a very special argument to make that case.\n\nEither way, just to be crystal clear: are you taking the position that you're ok with Labour using racist dogwhistles to point-score against the Tories?",
      "sentiment": -0.044
    },
    {
      "id": "gll33gv",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/gll33gv/",
      "user": "Resolvent_Mule",
      "text": "To be clear, I am saying that in the context of a pandemic where an open border (i.e. unimpeded access with little or no safeguards for those entering) is clearly unacceptable and the Tories have failed to implement a coherent policy, it would be foolish for labour not to seize on the opportunity this presents.\n\nYou cannot disregard the context and impute your own due to your disdain for Starmer. This has nothing to do with Brexit or pandering to the right of the party and everything to do with Covid-19.",
      "sentiment": -0.2351
    },
    {
      "id": "gllbf60",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/gllbf60/",
      "user": "articleofpeace",
      "text": "I'm not disregarding any context. That's what you're doing:\n\n&gt;This has nothing to do with Brexit or pandering to the right of the party and everything to do with Covid-19.\n\nIn precisely the same way we can say that the immediate context of Theresa May's Hostile Environment and Go Home vans was a Home Office push to curb immigration during an austerity period. It was not racist dogwhistling and it had nothing to do with brexit or pandering to the right wing voters.\n\n...sure.",
      "sentiment": 0.742
    },
    {
      "id": "gllbruq",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/gllbruq/",
      "user": "Resolvent_Mule",
      "text": "Drawing comparisons between the two is absurd. The hostile environment was indefensible. This is in response to an appalling absence of policy on entry to the UK during a pandemic. In the circumstances, a poster with rhetoric about not having an open border is eminently sensible.",
      "sentiment": -0.6249
    },
    {
      "id": "glleth6",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glleth6/",
      "user": "articleofpeace",
      "text": "&gt;Drawing comparisons between the two is absurd\n\nWhy? It demonstrates the point clearly. You not liking the comparison isn't a reason the comparison isn't valid.\n\n&gt;In the circumstances, a poster with rhetoric about not having an open border is eminently sensible.\n\nThe question isn't if it's sensible. The question is if it's racist, which you've claimed it isn't based on narrowly, artificially, and conveniently restricting the context within which it can be viewed. My comparison shows that it's possible to take exactly the same invalid approach to any dogwhistle racism if you want to claim it's not racist.",
      "sentiment": -0.7742
    },
    {
      "id": "glm15wv",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glm15wv/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "glm394l",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glm394l/",
      "user": "[deleted]",
      "text": "[removed]",
      "sentiment": 0.0
    },
    {
      "id": "glnfgod",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glnfgod/",
      "user": "articleofpeace",
      "text": "&gt;You impute whatever context you want to fit your narrative\n\nSo, just to be absolutely clear, you think that the idea of closing our borders is completely unrelated to brexit, and to suggest that the idea of closing our borders could be read as related to brexit is a complete fabrication?\n\nReally interesting to see what ideological loyalty combined with an overinflated virtue ethics does to the mind.\n\n&gt;Do you think there would there be any prospect of Labour decrying an open border, were we not in a pandemic\n\nUnder Sir Suit and the centrists? Absolutely. They'll sell our ideals down the river, as they have in various ways already.\n\nThere's nothing 'faux' here.\n\nYou're supporting and excusing a racist poster. You are a racist.",
      "sentiment": 0.9051
    },
    {
      "id": "glngeib",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glngeib/",
      "user": "Resolvent_Mule",
      "text": "Absolutely. A complete fabrication cooked up by your seething resentment for dear Keir. Labour is a broad church and I, for one, would much rather have an electable leader occupy the centre ground than backing an outlier and ushering the Tories into yet another term in Parliament.",
      "sentiment": -0.0516
    },
    {
      "id": "glnkbw4",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glnkbw4/",
      "user": "articleofpeace",
      "text": "You'd rather push racist narratives to excuse the lie you tell yourself - that centrists are 'electable'.\n\nLabour isn't a broad church. The right conspired to ensure that, and Keir and Evans have done their absolute best to cement it. I'm an *actual* broad churcher. I voted for Keir. He's as ideologically bankrupt as he is politically inept.",
      "sentiment": -0.128
    },
    {
      "id": "glnl3sp",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glnl3sp/",
      "user": "Resolvent_Mule",
      "text": "I'm not sure we'll ever see eye to eye on this. Such is the joy of life I supose.\n\nI see no racist narratives. I see good policy and effective opposition. Open borders in a pandemic is lunacy. \n\nLabour has always been a broad church and isn't beholden to a single faction.\n\nEnjoy the ride under Keir my friend.",
      "sentiment": 0.9549
    },
    {
      "id": "glno5f4",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glno5f4/",
      "user": "articleofpeace",
      "text": "Oh, I left the party, like the rest of the left. I'll be campaigning against Starmer next election.",
      "sentiment": 0.6369
    },
    {
      "id": "glnoev9",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glnoev9/",
      "user": "Resolvent_Mule",
      "text": "Fantastic. Good luck and God speed. If you're not doing what you love in life, then what's the feckin' point.",
      "sentiment": 0.9413
    },
    {
      "id": "glnsr8b",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/glnsr8b/",
      "user": "articleofpeace",
      "text": "It's not what I love. I'd prefer to be campaigning for Labour, like I have in every election for the past two and a half decades. Unfortunately, Labour don't want me and Starmer is too far beyond the pale.\n\nIt'll be interesting to see how well Labour do without their campaigning base or main funding sources.",
      "sentiment": 0.0798
    },
    {
      "id": "l9xyer",
      "url": "https://www.reddit.com/r/Labour/comments/l9xyer/labour_ad_targeted_at_red_wall_voters_is_not_a/",
      "user": "Spekeboy",
      "text": "",
      "sentiment": 0.0
    }
  ],
  "edges": [
    [
      "glkqy70",
      "l9xyer"
    ],
    [
      "glkr164",
      "l9xyer"
    ],
    [
      "glkrldr",
      "l9xyer"
    ],
    [
      "glks7mz",
      "glkrldr"
    ],
    [
      "glksjwu",
      "l9xyer"
    ],
    [
      "glksmh0",
      "glks7mz"
    ],
    [
      "glkt3pc",
      "glksjwu"
    ],
    [
      "glktag9",
      "glksmh0"
    ],
    [
      "glkto4w",
      "glktag9"
    ],
    [
      "glktu7m",
      "glkto4w"
    ],
    [
      "glkufe0",
      "glktu7m"
    ],
    [
      "glkusws",
      "glkrldr"
    ],
    [
      "glkv1m5",
      "glkufe0"
    ],
    [
      "glkv5mz",
      "glkv1m5"
    ],
    [
      "glkvmat",
      "glkv5mz"
    ],
    [
      "glkvtwy",
      "glkvmat"
    ],
    [
      "glkwded",
      "glkvtwy"
    ],
    [
      "glkyir5",
      "glkvtwy"
    ],
    [
      "glkzc61",
      "glkyir5"
    ],
    [
      "gll24e9",
      "glkzc61"
    ],
    [
      "gll33gv",
      "gll24e9"
    ],
    [
      "gllbf60",
      "gll33gv"
    ],
    [
      "gllbruq",
      "gllbf60"
    ],
    [
      "glleth6",
      "gllbruq"
    ],
    [
      "glm15wv",
      "glleth6"
    ],
    [
      "glm394l",
      "glkt3pc"
    ],
    [
      "glnfgod",
      "glm15wv"
    ],
    [
      "glngeib",
      "glnfgod"
    ],
    [
      "glnkbw4",
      "glngeib"
    ],
    [
      "glnl3sp",
      "glnkbw4"
    ],
    [
      "glno5f4",
      "glnl3sp"
    ],
    [
      "glnoev9",
      "glno5f4"
    ],
    [
      "glnsr8b",
      "glnoev9"
    ]
  ]
}